#lang pollen

◊chapter{Σύντομο βιογραφικό}

◊section{Κωνσταντίνος Χωριανόπουλος}

Ο συγγραφέας αυτού του βιβλίου έχει εργαστεί για περισσότερα από είκοσι χρόνια στην έρευνα και ανάπτυξη συστημάτων διάδρασης μεταξύ ανθρώπου και υπολογιστή.
Στις αρχές της πρώτης δεκαετίας αυτού του αιώνα, έκανε σημαντικές συνεισφορές για τον μετασχηματισμό της παθητικής κατανάλωσης τηλεοπτικού περιεχομένου προς μια περισσότερο διαδραστική κατεύθυνση.
Μια δεκαετία αργότερα, διαπίστωσε, με έκπληξη,  ότι η πλειονότητα των χρηστών είχε στραφεί σε νέες ψηφιακές υπηρεσίες, οι οποίες θεωρούν τα σύγχρονα επιτραπέζια και κινητά συστήματα σαν συσκευές κατανάλωσης, παρόμοια με την παραδοσιακή τηλεόραση.
Τα τελευταία χρόνια, εργάζεται για την διάδοση συστημάτων και πρακτικών που υποστηρίζουν περισσότερο υγιείς και βιώσιμες ανθρώπινες αξίες και βασίζονται σε ανθρωπιστικές και διαφανείς τεχνολογίες.