#lang pollen

◊chapter{Ορισμός}

◊epigraph["victor-definition"]

◊include["abs-definition"]

◊section{Η αξία της κατασκευής συστημάτων διάδρασης}


Για κάθε σύστημα που δίνει ρόλο στον ανθρώπινο παράγοντα, θα πρέπει
πρώτα να τεκμηριώσουμε πώς ορίζουμε και πώς αντιλαμβανόμαστε τον άνθρωπο.
Η κατανόηση αυτή δεν μπορεί να είναι αντικειμενική, γιατί, ανάλογα
με τη γνωστική περιοχή, υπάρχει μια διαφορετική οπτική γωνία, ενώ,
ακόμη και μέσα στην ίδια γνωστική περιοχή, έχουμε διαφορετικές σχολές.
Για παράδειγμα, στην περιοχή της σύγχρονης δυτικής ιατρικής
δίνεται έμφαση στα επιμέρους ανθρώπινα όργανα,
ενώ στις αντίστοιχες παραδοσιακές ανατολικές,
δίνεται έμφαση σε μια ολιστική αντίληψη.
Ακόμη, στην περιοχή της βιολογίας δίνεται έμφαση στις αντικειμενικές διαδράσεις,
οι οποίες έχουν τα κύταρα σε κλίμακα, τα οποία λίγο διαφέρουν
από τα αντίστοιχα συγγενικών βιολογικών οργανισμών. Από την άλλη,
στην ψυχολογία και στην κοινωνιολογία υπάρχουν σχολές που δίνουν
έμφαση στην ατομική και στη συλλογική συμπεριφορά,
οι οποίες διαμορφώνονται
κυρίως από το εκπαιδευτικό και πολιτισμικό περιβάλλον των ανθρώπων.
Πράγματι, το αξιακό σύστημα ενός πολιτισμού καθορίζει στον
μεγαλύτερο βαθμό και τον ορισμό που έχουμε για τον άνθρωπο,
ενώ σημαντικό ρόλο παίζει και η οπτική γωνία των επιμέρους
γνωστικών περιοχών. Κατά τον ίδιο τρόπο, στην περιοχή της διάδρασης
υπάρχουν διαφορετικές σχολές, αλλά και διαφορετικές χρονικές περίοδοι
με διαφορετικά αξιακά συστήματα.

◊figure["augmentation-typewriter"]

◊figure["nls-cscw"]

Τα συστήματα διάδρασης έχουν ενσωματώσει διαχρονικά πολλές επιρροές
από διαφορετικές γνωστικές περιοχές, ενώ και το πολιτισμικό υπόβαθρο
των σημαντικότερων συντελεστών διαφέρουν σημαντικά σε κάθε περίοδο.
Η αρχική θεμελίωση της περιοχής της κατασκευής των συστημάτων διάδρασης
έγινε την δεκαετία του 1960,
◊fn{◊cite["licklider1960man, @engelbart1962augmenting"]}
με το όραμα ενός συχνού και προχωρημένου χρήστη,
ο οποίος συνεργάζεται με άλλους χρήστες μέσω του συστήματος,
◊fn{◊figref["augmentation-typewriter"]}
◊fn{◊figref["nls-cscw"]}
με στόχο την κατανόηση πολύπλοκων φυσικών ή κοινωνικών φαινομένων.
Εδώ, ο άνθρωπος είναι μια δυναμική οντότητα που μαθαίνει συνέχεια
και μετασχηματίζεται μέσα από τη συνεργασία και τη διάδραση,
ενώ και τα προβλήματα που αντιμετωπίζει δεν είναι σαφώς καθορισμένα.

Μια δεκαετία αργότερα,
η πιο συστηματική θεμελίωση έγινε από γνωστικούς ψυχολόγους,
◊fn{◊cite["card1983psychology"]}
οι οποίοι μοντελοποιούν τον άνθρωπο ως έναν επεξεργαστή πληροφορίας,
ο οποίος βρίσκεται μόνος του μπροστά σε ένα τερματικό και εκτελεί
επαναλαμβανόμενες απλές διεργασίες,
οι οποίες δεν απαιτούν κάποια δεξιότητα παρά μόνο μια σύντομη εκπαίδευση.
Στην περίπτωση αυτή, ο άνθρωπος είναι κάτι σταθερό,
σαν ένα γρανάζι μιας μηχανής που εκτελεί συνέχεια την ίδια διεργασία.

Το παράδειγμα της στατικής θεώρησης του ανθρώπου είναι αυτό που επικράτησε,
γιατί σίγουρα είναι το πιο εύκολο να μάθουν οι χρήστες
και ταυτόχρονα είναι το
πιο αποδοτικό για όσους οργανώνουν τις διεργασίες των χρηστών.
Αν, δηλαδή, θεωρήσουμε τον άνθρωπο ως το στατικό εξάρτημα μιας
μηχανής που παραμένει πάντα το ίδιο και είναι σχετικά προβλέψιμο, 
τότε το συνολικό σύστημα είναι πιο εύκολο να κατασκευαστεί.
Ταυτόχρονα, όμως, η στατική θεώρηση του ανθρώπινου παράγοντα
δεν αφήνει πολλά περιθώρια για την βελτίωση και την επαύξησή του
προς μια νέα κατάσταση με περισσότερες γνώσεις και δεξιότητες,
από την οποία νέα κατάσταση θα αλληλεπιδράσει με τα νέα μηχανήματα
που θα κατασκευάσει.◊fn{◊cite["engelbart1962augmenting"]}


Έχοντας δώσει ένα πλαίσιο και ενδεικτικά παραδείγματα για
τον ορισμό του ανθρώπου,
θα πρέπει να κάνουμε το ίδιο και για τον υπολογιστή.
Για παράδειγμα, η χρήση της λέξης υπολογιστής για την περιγραφή
των δημοφιλών επιτραπέζιων και κινητών συστημάτων 
είναι μια σχετικά πρόσφατη σύμβαση.
Μέχρι και την δεκαετία του 1950,
η λέξη υπολογιστής αναφέρεται με απόλυτη σαφήνεια 
σε μια ανθρώπινη δουλειά γραφείου,
◊fn{◊figref["human-computers"]}
που αφορούσε τον υπολογισμό λογαριθμικών πινάκων για χρήση 
στην πρόβλεψη της τροχιάς πυραύλων και στη θαλάσσια πλοήγηση.
Η εφεύρεση και η διάδοση των πρώτων κεντρικών υπολογιστών 
λίγο αργότερα άλλαξε εντελώς το νόημα της λέξης,
αφού την ίδια ακριβώς δουλειά, δηλαδή τον υπολογισμό των λογαριθμικών πινάκων, 
την έκαναν πλέον μηχανήματα.

◊figure["human-computers"]

◊figure["transistor-radio"]

Την ίδια ακριβώς περίοδο, η εφεύρεση του τρανζίστορ 
επέτρεψε την κατασκευή μικρών φορητών ραδιοφώνων,
τα οποία έμειναν γνωστά για μια γενιά ανθρώπων ως τρανζιστοράκια.
◊fn{◊figref["transistor-radio"]}
Με το ίδιο σκεπτικό, θα μπορούσαμε να ονοματίσουμε 
τους λεγόμενους κινητούς και φορετούς υπολογιστές 
επίσης τρανζιστοράκια,
αφού είναι γεμάτοι από αυτά. Ταυτόχρονα,
η ονομασία έξυπνο τηλέφωνο και η συσχέτισή της 
με τις δημοφιλείς συσκευές Android και iOS
αποτελεί μια ακόμη χειρότερη παρανόηση για μια κατηγορία προϊόντων,
τα οποία οι κατασκευαστές τους θέλουν να θεωρούνται έξυπνα.
Επομένως, το γεγονός ότι ένα κατασκεύασμα χρησιμοποιεί κάποιο υλικό ή κάποιο λογισμικό
για να κάνει μία λειτουργία δεν μπορεί να καθορίζει την ονομασία του,
ούτε φυσικά μπορούμε να βασιζόμαστε σε χαρακτηρισμούς που δίνει ο κατασκευαστής.
◊fn{◊cite["lanier2014owns"]}



Έχοντας περιγράψει ένα πλαίσιο επιμέρους ορισμών για τον άνθρωπο
και τον υπολογιστή, μπορούμε να περάσουμε στο κεντρικό μας θέμα
που είναι η διάδρασή τους. Μια από τις αρχικές και πολύ δημοφιλείς
θεωρήσεις της διάδρασης είναι αυτή του αυτοματισμού
ή της κατασκευής έξυπνων συστημάτων. 
Ο στόχος, δηλαδή, της κατασκευής της διάδρασης είναι να μην έχουμε
καθόλου διάδραση ή, αν η διάδραση είναι απαραίτητη,
αυτή να γίνεται με φυσικούς τρόπους, όπως είναι η ομιλία.
Η περιοχή της Τεχνητής Νοημοσύνης εστιάζει πάνω σε αυτόν τον στόχο
και μετά από πενήντα χρόνια έχει σημειώσει πρόοδο, αλλά με αρκετούς
περιορισμούς, καθώς και με παραδοχές 
που δεν είναι πάντα εποικοδομητικές για τις δυνατότητες του ανθρώπου.
◊fn{◊cite["engelbart1962augmenting, @weizenbaum1976computer"]}
Αντίθετα, η σχολή της επαυξημένης νοημοσύνης θεωρεί πως
η κατασκευή συστημάτων διάδρασης μπορεί να γίνει με τέτοιο τρόπο
ώστε όχι μόνο να βελτιώνουν τις επιδόσεις μας σε μια διεργασία
αλλά και να αυξάνουν τη συλλογική νοημοσύνη. Για αυτόν τον σκοπό,
η διάδραση με έναν επεξεργαστή κειμένου είναι κάτι περισσότερο.
Για παράδειγμα, στο σύστημα NLS, η επεξεργασία κειμένου
γίνεται με ένα εξειδικευμένο πληκτρολόγιο ακόρντων,
το οποίο αυξάνει την ταχύτητα και την εργονομία.
Ανάμεσα σε πολλές άλλες πρωτιές, το σύστημα NLS
επιτρέπει τη συνεργασία μεταξύ χρηστών που βρίσκονται
σε διαφορετικά τερματικά σε πραγματικό χρόνο.◊fn{◊cite["licklider1960man"]}
Επίσης, γίνεται συνεργατικά με μια δομημένη μορφή κειμένου,
η οποία βασίζεται στο υπερκείμενο και στο ιστορικό των εγγράφων,
έτσι ώστε να μην υπάρχουν αμφισημίες και ασάφειες.


Το πιο χαρακτηριστικό παράδειγμα διάδρασης είναι αυτό του επιτραπέζιου υπολογιστή
και της γραφικής επιφάνειας εργασίας
που ελέγχεται από τον χρήστη με συσκευές εισόδου
όπως το πληκτρολόγιο και το ποντίκι.
◊fn{◊cite["freiberger1984fire, @hiltzik1999dealers, @hertzfeld2004revolution"]}
Η επιτραπέζια μορφή υπολογιστή και διάδρασης είναι σημαντική,
γιατί ήταν η πρώτη που ξέφυγε από τις μέχρι τότε
πολύ εξειδικευμένες εφαρμογές, όπως είναι οι βάσεις δεδομένων.
Έτσι, μπόρεσε να διευκολύνει τις εργασίες και την καθημερινότητα
πάρα πολλών χρηστών με την επεξεργασία κειμένου,
την ανάκτηση πληροφορίας από τον ιστό
και την επικοινωνία μέσω του ηλεκτρονικού ταχυδρομείου.
Αν και το μοντέλο διάδρασης με τον επιτραπέζιο υπολογιστή
δεν είναι ούτε τόσο δημοφιλές ούτε τόσο εύκολο
όσο αυτό του κινητού υπολογισμού
με τα έξυπνα κινητά και τις ταμπλέτες,
έχει ιδιαίτερο ενδιαφέρον, γιατί έχει μείνει σχετικά ίδιο
από τότε που δημιουργήθηκε, πράγμα που επιβεβαιώνει,
ότι ανεξάρτητα από τη ραγδαία τεχνολογική εξέλιξη,
η ανθρώπινη διάδραση κινείται σε πιο αργούς ρυθμούς.◊fn{◊cite["waldrop2001dream"]}
Σε αυτό το πλαίσιο, η ευχρηστία και η εμπειρία του χρήστη
αποτελούν τους κεντρικούς ορισμούς
και έχουν καθορίσει τον τρόπο με τον οποίο επεξεργαζόμαστε έγγραφα.
◊fn{◊figref["xerox-bravo"]}
◊fn{◊figref["wordstar-editor"]}


◊figure["xerox-bravo"]

◊figure["wordstar-editor"]

Αν και η ευχρηστία είναι μία από τις βασικές αξίες της διάδρασης,
δεν είναι η μόνη, ενώ η σημασία της μπορεί να είναι πολύ μικρή
σε ορισμένες περιπτώσεις. Αν, για παράδειγμα, το σύστημα διάδρασης
έχει εφαρμογή στη διασκέδαση,
τότε θέλουμε η διάδραση να προσφέρει, εκτός από απλή ευχρηστία,
ψυχαγωγία και μάθηση.
Στην περίπτωση της βελτίωσης ενός συστήματος
που είτε προϋπάρχει είτε είναι παρόμοιο με υπάρχοντα συστήματα,
ο πιο απλός τρόπος από πλευράς κόστους, αποτελεσματικότητας
και ταχύτητας είναι να βασιστούμε σε επιτυχημένα ιστορικά παραδείγματα.
Πράγματι, η αντιλαμβανόμενη ευχρηστία σχετίζεται περισσότερο
με την οικειότητα του χρήστη με ένα σύστημα,◊fn{◊cite["raskin2000humane"]}
παρά με την αντικειμενική επίδοσή του
μετά από κάποια μικρή περίοδο εξάσκησης. Για παράδειγμα,
η εκμάθηση του πληκτρολογίου ακόρντων ή μιας τροπικής διεπαφής,
απαιτεί μερικές ώρες εκπαίδευσης, αλλά έχει διαχρονικό κέρδος
τόσο για την απόδοση όσο και για την εργονομία
κατά την επεξεργασία κειμένου. Παρομοίως, η διακόσμηση της διεπαφής
με εικονίδια και περίτεχνα περιγράμματα που αλληλοκαλύπτονται
παρέχει μόνο υποκειμενική αισθητική οικειότητα,
ενώ δεν έχει καμία αντικειμενική απόδοση,
ειδικά για τον συχνό χρήστη.


Το γεγονός αυτό, από μόνο του, αποτελεί τη σημαντικότερη γνώση
σε αυτήν την περιοχή και ταυτόχρονα δείχνει ότι με αυτήν την νοοτροπία η εφικτή καινοτομία
μπορεί να παρουσιαστεί μόνο σταδιακά και ποτέ ως μετάβαση παραδείγματος.
Η κατανόηση της καινοτομίας περισσότερο ως γραμμικής βελτίωσης
παρά ως σημαντικής μετατόπισης παραδείγματος αποτελεί για την περιοχή
της διάδρασης μία από τις σημαντικότερες αντιφάσεις,
η οποία θεμελειώθηκε στα τέλη της δεκαετίας του 1970 κατά
τη μετάβαση από το Xerox PARC στην Apple.
Πράγματι, η Apple, με το κίνητρο της διάδοσης
των προσωπικών συστημάτων διάδρασης
σε όσο γίνεται μεγαλύτερο πληθυσμό,
δημιουργεί με μεγάλη ακρίβεια συστήματα
τα οποία είναι πολύ εύκολα για τον περιστασιακό χρήστη.
Στη συνέχεια μοχλεύει την οικειότητα του χρήστη με μια διεπαφή
ώστε να δημιουργήσει την επόμενη έκδοση, όπου το κίνητρο
παραμένει η οικειότητα και όχι η βέλτιστη διεπαφή,
ειδικά αν ο χρήστης είναι συχνός.
Φυσικά, τα κυρίαρχα συστήματα έχουν σημαντικές αρετές,
εκτός από την υποκειμενική ευχρηστία τους για τον άπειρο και περιστασιακό χρήστη
και μας παρέχουν ένα πλαίσιο κατανόησης
της κατασκευής συστημάτων διάδρασης, έτσι ώστε να μπορέσουμε
να φτιάξουμε εναλλακτικά, με τις ίδιες τεχνικές και τις ίδιες τεχνολογίες
αλλά με διαφορετική φιλοσοφία, κίνητρα και κατεύθυνση.


◊section{Κατασκευή υποδείγματος και επανάληψη}

Η διαδικασία κατασκευής ενός λειτουργικού υποδείγματος είναι χρήσιμη
ως μηχανισμός κατανόησης της διάδρασης που θέλουμε να υλοποιήσουμε,
ενώ όταν το υπόδειγμα είναι σε μια πρώτη ικανοποιητική μορφή τότε
μπορεί να χρησιμοποιηθεί για δοκιμές με τους τελικούς χρήστες
ή ακόμη και να δημοσιευτεί ως αρχική έκδοση
(π.χ. έκδοση άλφα, βήτα, από την ορολογία της τεχνολογίας λογισμικού).
Αυτή η προσέγγιση είναι γνωστή στη βιβλιογραφία και ως
◊em{το υπόδειγμα ως προδιαγραφές}. Δηλαδή, αντί να ετοιμάσουμε
ένα λεπτομερές συμβόλαιο το οποίο θα περιγράφει με λέξεις και διαγράμματα
το αποτέλεσμα, έχουμε το ίδιο το αποτέλεσμα (εν τη γενέσει του)
να δηλώνει τις ίδιες τις προδιαγραφές του. Αυτό είναι μια σχετικά απλή ιδέα,
η οποία όμως φέρνει σε μεγάλη αντίθεση
την περιοχή της κατασκευής συστημάτων διάδρασης
με τις συγγενείς περιοχές της επιστήμης των μηχανικών,
ακόμη και με τη γονική περιοχή της τεχνολογίας λογισμικού.
Επίσης, αποδεικνύει την κεντρική θέση αυτού του βιβλίου,
ότι η κατασκευή συστημάτων διάδρασης είναι μια νέα περιοχή που,
ναι μεν έχει αρκετές ομοιότητες με άλλες, αλλά τελικά έχει τόσες διαφορές
απαιτώντας ουσιαστικά διαφορετική αντιμετώπιση.

◊figure["sage-lightgun"]

◊figure["sketchpad-interaction"]

Αν και υπάρχουν πάρα πολλές τεχνικές και μεθοδολογίες
και ακόμη περισσότερα εργαλεία και δομές
για την κατασκευή της διάδρασης,
αν έπρεπε να τα συνοψίσουμε όλα σε μία πρόταση, θα λέγαμε ότι
◊em{η κατασκευή της διάδρασης είναι η επαναληπτική κατασκευή ενός υποδείγματος.}
Αυτή η επανατοποθέτηση του προβλήματος της κατασκευής μας επιτρέπει
να στρέψουμε την προσοχή μας στη φύση και στον ρόλο του υποδείγματος
ως ένα είδος ζωντανών και ευμετάβλητων προδιαγραφών ενός νέου συστήματος.
Η κατασκευή ενός νέου συστήματος διάδρασης, όσο νέα και αν είναι,
συνήθως βασίζεται σε κάποια υλικά που είναι ήδη διαθέσιμα.
Για παράδειγμα, ο μετασχηματισμός της διάδρασης πέρα από τον τηλέτυπο
ξεκίνησε με νέες συσκευές εισόδου, όπως η πένα, καθώς και με τη χρήση
της οθόνης από ραντάρ για την απεικόνηση γραφικών.
◊fn{◊figref["sage-lightgun"]}
Το σύστημα SAGE δημιουργήθηκε στο MIT και οι συσκευές διάδρασης ήταν οικείες.
Φυσικά απαιτήθηκε πολυετής εργασία και ένας νέος ψηφιακός υπολογιστής
για να μπορέσουν οι ίδιες συσκευές διάδρασης να παίξουν έναν νέο ρόλο
στο σύστημα Sketchpad.
◊fn{◊figref["sketchpad-interaction"]}
Αρκεί μια οπτική σύγκριση των δύο συστημάτων για να δούμε
ότι τα αρχέτυπα για τις βασικές συσκευές εισόδου και εξόδου με τον χρήστη
είναι οι ίδιες ακριβώς και στα δύο συστήματα.
Φυσικά διαφέρει πολύ ο κεντρικός υπολογιστής και κυρίως διαφέρει
η κατασκευή της διάδρασης, αφού το Sketchpad δεν είναι απλά
μια αναπαράσταση της πραγματικότητας, αλλά ένας συνεργάτης 
που διευκολύνει τη σχεδίαση μηχανολογικών συστημάτων.


Το υπόδειγμα θα πρέπει να είναι διαδραστικό,
διαφορετικά είναι σκόπιμο να το χαρακτηρίσουμε ως ένα αρχικό προσχέδιο.
Τα προσχέδια και τα υποδείγματα κάθε άλλο παρά νέα είναι στην περιοχή των μηχανικών.
Οι αρχιτέκτονες μηχανικοί ξεκινάνε τη σχεδίαση στο χαρτί,
γιατί αυτός είναι παραδοσιακά ο πιο γρήγορος τρόπος αναπαράστασης μιας ιδέας
και γιατί αυτό βοηθάει τη σχεδιαστική σκέψη.
Αντίστοιχα, η κατασκευή της διάδρασης είναι σκόπιμο να ξεκινήσει 
από ένα σύντομο αφηγηματικό σενάριο,
το οποίο θα συνοδεύεται από μερικές ενδεικτικές οθόνες.
Παρά τις ομοιότητες με τους αρχιτέκτονες μηχανικούς,
σημαντικές διαφορές στη μέθοδο προκύπτουν
επειδή το αποτέλεσμα του προγραμματισμού της διάδρασης
δεν είναι κάτι στέρεο και σταθερό,
αλλά κάτι πολύ ρευστό, ευμετάβλητο και φευγαλέο,
το οποίο αλλάζει ανάλογα με τη χρήση.
Επιπλέον, τόσο τα προσχέδια όσο και τα πρωτότυπα
θα πρέπει να αντικατοπτρίζουν την κίνηση που υπάρχει εκ των πραγμάτων σε μια διάδραση,
κάτι που δύσκολα γίνεται στο χαρτί ή με απλές εικόνες.
Για τον λόγο αυτό, στα προσχέδια του προγραμματισμού της διάδρασης
θέλουμε να δημιουργήσουμε τουλάχιστον ένα λειτουργικό υπόδειγμα,
◊fn{◊figref["pebble-buck"]}
◊fn{◊figref["handspring-buck"]}
ώστε να μπορεί ο σχεδιαστής και οι άλλοι συμμετέχοντες της ομάδας
όχι μόνο να φανταστούν το τελικό προϊόν, αλλά και να το χρησιμοποιήσουν.

◊figure["pebble-buck"]

◊figure["handspring-buck"]

Οι διαφορές από τους αρχιτέκτονες μηχανικούς 
στην κατασκευή του πρωτοτύπου συνεχίζονται 
στην περίπτωση της μακέτας. Ενώ η μακέτα 
είναι για τους αρχιτέκτονες ένα προχωρημένο πρωτότυπο 
το οποίο αναπαριστά υπό κλίμακα σε τρεις διαστάσεις το μελλοντικό προϊόν, 
στον προγραμματισμό της διάδρασης, ένα διαδραστικό πρωτότυπο 
είναι σχεδόν το ίδιο με το τελικό προϊόν. 
Η σημαντικότερη όμως διαφορά σε σχέση με τους αρχιτέκτονες 
και τις άλλες συγγενείς επιστήμες του μηχανικού είναι ότι 
ένα διαδραστικό πρωτότυπο και, φυσικά, το τελικό προϊόν
δεν ακολουθούν καθόλου διακριτά στάδια κατά τις φάσεις 
της σχεδίασης, της παραγωγής και της βελτίωσης. Για παράδειγμα, 
η πρώτη εμπορική έκδοση του δημοφιλούς Apple iPhone 
δεν είχε εφαρμογές άλλων κατασκευαστών λογισμικού, 
παρά μόνο τις επίσημες εφαρμογές της εταιρείας. 
Ήταν αυτό το ◊em{τελικό προϊόν} 
ή μήπως ήταν ένα πολύ ◊em{προχωρημένο πρωτότυπο}; 
Μπορεί από την πλευρά του υλικού η συσκευή να βελτιώθηκε σταδιακά, 
όμως από την πλευρά του λογισμικού, η νέα δυνατότητα του συστήματος 
να δέχεται πρόσθετες εφαρμογές δημιούργησε ουσιαστικά ένα καινούργιο προϊόν. 
Επομένως, θα μπορούσαμε να χαρακτηρίσουμε το πρώτο εμπορικό iPhone 
ως ένα προχωρημένο διαδραστικό πρωτότυπο των σύγχρονων iPhone, 
τα οποία δεν έχουν πάψει να εξελίσσονται. Σε συνδυασμό με το λογισμικό 
που διατίθεται από την ίδια την εταιρεία, στο οποίο συχνά 
συνεισφέρουν ανεξάρτητοι προγραμματιστές, νέο, εξωτερικό υλικό προστίθεται 
και διευκολύνει σημαντικές ανθρώπινες δραστηριότητες 
οι οποίες έχουν να κάνουν με τις συναλλαγές, την υγεία, τη δημιουργία 
και τη διασκέδαση, παράγοντας ουσιαστικά ένα οικοσύστημα διάδρασης.

Οι βασικές τεχνολογίες και ο αντίστοιχος προγραμματισμός
της δικτύωσης, της αποθήκευσης και της επεξεργασίας δεδομένων
και, κυρίως, της εισόδου και εξόδου της διεπαφής 
με τον άνθρωπο είναι δομικά στοιχεία του συστήματος.
Επομένως, θέλουμε άμεση και εύκολη πρόσβαση σε όλα αυτά μαζί,
χωρίς να πρέπει να ανησυχούμε για τις λεπτομέρειες της υλοποίησης.
Αν και οι λεπτομέρειες της υλοποίησης έχουν μεγάλη σημασία
όταν το σύστημά μας αφορά τις ζωές πολλών ανθρώπων,
σε αυτήν τη φάση της ανάπτυξης
(κατά την οποία δεχόμαστε ότι δεν ξέρουμε τι ακριβώς ετοιμάζουμε,
ούτε το πώς αυτό θα επηρεάσει την καθημερινότητα των ανθρώπων)
είναι σκόπιμο να μην ασχοληθούμε με αυτές.
Με αυτό το δεδομένο, η επιλογή των εργαλείων ανάπτυξης
(ειδικά της γλώσσας προγραμματισμού και των βιβλιοθηκών) απλουστεύεται,
αλλά σε καμία περίπτωση δεν μπορεί να χαρακτηριστεί εύκολη,
πράγμα που θα δούμε στο αντίστοιχο κεφάλαιο
των εργαλείων της κατασκευής της διάδρασης.

Με δεδομένη την ανάγκη ανάπτυξης δεξιοτήτων που θεμελιώνουν 
τον ψηφιακό αλφαβητισμό πέρα από την απλή χρήση, 
προς τη βαθύτερη κατανόηση λειτουργίας και ιδανικά 
τη δημιουργία νέων διαδράσεων, ένα ερώτημα που προκύπτει 
αφορά στην επιλογή του εργαλείου, την οργάνωση, 
αλλά και τη διαδικασία δημιουργίας της διάδρασης. 
Για να απαντήσουμε σε αυτό το ερώτημα θα πρέπει 
να ανατρέξουμε στη φύση της κατασκευής της διάδρασης. 
Το βασικό στοιχείο αυτής της περιοχής είναι ότι 
οι τελικές προδιαγραφές του συστήματος είναι άγνωστες 
κατά το αρχικό στάδιο, ενώ είναι σίγουρο ότι ακόμη 
και αν έχουμε τις πρώτες εκδόσεις σε λειτουργικό επίπεδο, 
οι προδιαγραφές θα συνεχίζουν να προσαρμόζονται με τη χρήση 
και τη διαδικασία της επαναληπτικής αξιολόγησης. Επομένως, 
τα κατάλληλα εργαλεία, οι διαδικασίες, και οι δομές θα πρέπει 
να μπορούν να αλλάζουν γρήγορα, τόσο τα ίδια όσο και τα δημιουργήματά τους. 
Επομένως, τα καταλληλότερα εργαλεία δεν είναι τα έτοιμα, 
αλλά είναι αυτά που θα κατασκευάσουμε και θα προσαρμόσουμε 
έτσι ώστε να ταιριάζουν στο πεδίο του προβληματος.


◊section{Η διάδραση σε μεγαλύτερη κλίμακα}

◊figure["logo-robot"]

◊figure["children-alto"]

Η κατασκευή της διάδρασης έχει παραμείνει μια φευγαλέα περιοχή,
επειδή σε κάθε χρονική περίοδο έχουμε διαφορετικές μορφές
υπολογιστών (π.χ. επιτραπέζιος, κινητός, φορετός, διάχυτος)
και διεπαφών με τους χρήστες
(π.χ. γραμμή εντολών, γραφικό περιβάλλον, χειρονομίες, φυσική γλώσσα).
Για παράδειγμα, ένας χρήστης υπολογιστών ο οποίος έλαβε βασική,
δευτεροβάθμια και τριτοβάθμια εκπαίδευση τη δεκαετία του 1970
ή το πολύ μέχρι τα μισά της δεκαετίας του 1980,
είναι πολύ πιθανό να έχει μεγάλη εξοικείωση με τη γραμμή εντολών
και τους επιτραπέζιους υπολογιστές,
αφού αυτή ήταν η βασική μορφή στα χρόνια της εκπαίδευσής του.
Αντίστοιχα, ένας χρήστης που έλαβε την εκπαίδευσή του μετά το 2000
και κατά τη δεκαετία του 2010,
είναι πολύ πιθανό να μην έχει καθόλου προσωπικό επιτραπέζιο υπολογιστή,
αφού οι βασικές διεργασίες του χρήστη αυτήν τη χρονική περίοδο
(π.χ. αναζήτηση στον παγκόσμιο ιστό, κοινωνική δικτύωση, ψηφιακό περιεχόμενο, κτλ.)
μπορούν να γίνουν εξίσου καλά, αν όχι καλύτερα, με έναν κινητό υπολογιστή.
Βλέπουμε, λοιπόν, ότι, στην πράξη, ο ψηφιακός αλφαβητισμός
ως βασική δεξιότητα πρόσβασης στην πληροφορία
είναι μια έννοια περισσότερο σχετική με τη δημογραφία
και την ημερομηνία γέννησης, παρά μια διαχρονική αξία.


Ο διαδραστικός τρόπος σκέψης είναι στενά συνδεδεμένος
με το εκάστοτε νόημα που αποδίδουμε στον ψηφιακό αλφαβητισμό.
Η αρχική κατασκευή και αρχική θεώρηση των συστημάτων διάδρασης
στόχευε σε έναν προχωρημένο και συχνό χρήστη, για τον οποίο 
η ευχρηστία ταυτίζεται κυρίως με τη βελτίωση της εργασίας
αλλά και με την εργονομία, αφού θα πρέπει να εργάζεται για πολλές ώρες.
Λίγο αργότερα,
οι ερευνητές προσπάθησαν να διευκολύνουν την εξέλιξη των δυνατοτήτων του ανθρώπου
με διαδραστικά συστήματα μάθησης,
◊fn{◊figref["logo-robot"]}
τα οποία δεν εξασκούν απλά τις γνώσεις και τις δεξιότητες,
αλλά καλλιεργούν τον τρόπο σκέψης.
◊fn{◊cite["papert1980mindstorms, @kay1993early"]}
Από την άλλη πλευρά, η τεχνολογία της διάδρασης μπορεί να θεωρηθεί
ως μια νέα τεχνολογία γραφής.
Πράγματι, οι άνθρωποι μαθαίνουν σχετικά εύκολα να μιλάνε, αλλά
η δεξιότητα της ανάγνωσης απαιτεί πολλά χρόνια εκπαίδευσης. Επομένως,
μια γόνιμη αναλογία είναι να θεωρήσουμε τη διάδραση ως ένα νέο
σύστημα γραφής, το οποίο απαιτεί πολλά χρόνια εκπαίδευσης,
◊fn{◊figref["children-alto"]}
ειδικά για όσους θέλουν να βελτιωθούν, ενώ, ταυτόχρονα,
δεν φαίνεται να έχει κάποιο τερματικό σημείο.
◊fn{◊cite["kay1993early"]}

◊figure["kidsim"]

◊figure["mit-scratch"]


Η θέση του ψηφιακού αλφαβητισμού ως κάτι περισσότερο από εκπαίδευση
στην απλή χρήση των τεχνολογιών πληροφόρησης και επικοινωνίας
έχει διαπιστωθεί από τα μισά της δεκαετίας του 1990,
όταν τα γραφικά περιβάλλοντα διεπαφής με τον χρήστη
είχαν κλείσει μία δεκαετία εμπορικής ζωής.
Οι ερευνητές διαπίστωσαν
ότι τα παιδιά που μεγάλωσαν με τη γραφική επιφάνεια εργασίας
είχαν μεν μεγαλύτερη εξοικείωση με την παρουσία του υπολογιστή στη ζωή τους,
αλλά είχαν πολύ μικρότερες δεξιότητες στη δημιουργική χρήση του.
Η διαπίστωση αυτή οδήγησε σε μια σειρά από προσπάθειες
τόσο στο λογισμικό όσο και στο υλικό υπολογιστών,
έτσι ώστε να κρατήσουμε την προσβασιμότητα των σύγχρονων υπολογιστών,
χωρίς όμως να χάσουμε τις δεξιότητες που προσφέρει
η κατασκευή της διάδρασης. Για παράδειγμα,
οι ερευνητές δημιούργησαν λογισμικό όπως τα KidSim,◊fn{◊figref["kidsim"]} Etoys, και Scratch,◊fn{◊figref["mit-scratch"]}
τα οποία βασίζονται στον οπτικό προγραμματισμό 
και στον προγραμματισμό με βάση παραδείγματα χρήσης. 
Αντίστοιχα, για την περίπτωση του υλικού υπολογιστή
δημιουργήθηκε το RaspberryPi, το οποίο είναι πολύ οικονομικό
και συνδέεται με την τηλεόραση,
έτσι ώστε να έχει όσο γίνεται μεγαλύτερη διάχυση
στους νέους χρήστες υπολογιστών, οι οποίοι διαφορετικά
θα μεγάλωναν μόνο με οθόνες αφής.
Τέλος, δημιουργήθηκαν πολλά απτικά προϊόντα προγραμματισμού,
τα οποία δεν έχουν καθόλου οθόνη
και τα οποία βασίζονται στην οργάνωση απτών αντικειμένων,
ενώ και το αποτέλεσμά τους μπορεί να είναι η φυσική κίνηση και η διάδραση με ένα ρομπότ.

Σε πρώτη ανάγνωση, η κατασκευή της διάδρασης 
φαίνεται το άθροισμα, ή ίσως η τομή, των επιμέρους περιοχών 
του προγραμματισμού υπολογιστή και της διάδρασης ανθρώπου 
και υπολογιστή. Στην πράξη όμως, η πρόσθεση των γνώσεων 
προγραμματισμού σε εκείνες της διάδρασης ανθρώπου και υπολογιστή 
δεν αποτελεί μια ικανή συνθήκη για τη δημιουργία νέων επινοήσεων, 
ικανών να επαναπροσδιορίσουν τις ανθρώπινες και τις κοινωνικές δραστηριότητες. 
Αν και η ύπαρξη βασικών επιμέρους γνώσεων, είτε στον ίδιο τον κατασκευαστή, 
είτε στα μέλη μιας ομάδας συνεργασίας, αποτελεί μια αναγκαία συνθήκη, 
υπάρχει επιπλέον η ανάγκη για γνώσεις σε ένα υψηλότερο επίπεδο, 
στο επίπεδο της κατασκευής της διάδρασης. Σε αυτό το υψηλότερο επίπεδο 
αφαίρεσης των επιμέρους λεπτομερειών, εστιάζουμε στα εργαλεία, 
στις δομές, και στις διαδικασίες που θα δώσουν δημιουργικές λύσεις 
σε υπάρχοντα προβλήματα και θα επαυξήσουν τις δυνατότητές μας.

◊figure["linux"]

◊figure["napster"]

Όπως οι οπτικές γλώσσες προγραμματισμού υψηλού επιπέδου (π.χ. Scratch) 
έχουν μικρή μόνο σχέση με τις αντίστοιχες γλώσσες προγραμματισμού 
που είναι κοντά στη μηχανή (π.χ. Assembly, C), 
έτσι και ο προγραμματισμός της διάδρασης έχει μικρή μόνο σχέση 
με τις βασικές επιμέρους περιοχές του, όπως εκείνη του προγραμματισμού ΗΥ. 
Στην πράξη, ο προγραμματιστής της διάδρασης είναι χρήσιμο να ξέρει 
τις βασικές έννοιες του προγραμματισμού, όπως είναι η μεταβλητή 
και οι συνθήκες, αλλά από εκεί και πέρα η δεξιότητά του 
θα αυξηθεί περισσότερο αν μάθει να χρησιμοποιεί και να κατασκευάζει 
νέες βιβλιοθήκες και εργαλεία, παρά αν μάθει όλες τις αλγοριθμικές 
λεπτομέρειες που κάνουν ένα πρόγραμμα υπολογιστή αποδοτικό (π.χ. ταχύτητα, μνήμη). 
Επομένως, αν και μιλάμε για κατασκευή της διάδρασης, 
στην πράξη, η κατασκευή αυτή, όπου υπάρχει, αφορά περισσότερο 
τη δημιουργική σύνθεση και τη χρήση έτοιμων και νέων βιβλιοθηκών 
και εργαλείων με απλές δομές ελέγχου, με τελικό σκοπό την επαύξηση των
ανθρώπινων και κοινωνικών δραστηριοτήτων. Από αυτήν την πλευρά, 
ένα από τα πιο φιλικά και εύχρηστα συστήματα διάδρασης 
είναι η γραμμή εντολών των συστημάτων τύπου UNIX, 
όπου απλές εντολές, οι ανακατεύθυνση της εισόδου και εξόδου, 
καθώς και μικρά προγράμματα μπορούν να συνθέσουν νέες εφαρμογές.


Πέρα από την ανάγκη κατανόησης του σύγχρονου ψηφιακού κόσμου,
οι γνώσεις και οι δεξιότητες της κατασκευής της διάδρασης
δημιουργούν νέα προϊόντα και υπηρεσίες που επηρεάζουν
τις προσωπικές αντιλήψεις, τις συνήθειες, τους θεσμούς
και τις μορφές κοινωνικής οργάνωσης.
Στην εποχή μας, όπου η χρήση του υπολογιστή έχει κατηγορηθεί
για την αύξηση της ανεργίας μέσω του αυτοματισμού
και της αύξησης της παραγωγικότητας,
μπορούμε να δούμε με αισιοδοξία μια αχαρτογράφητη πτυχή του υπολογιστή
ως μέσου και εργαλείου δημιουργίας
ενός νέου επιπέδου ανθρώπινης δραστηριότητας.

Το λειτουργικό σύστημα των επιτραπέζιων υπολογιστών προοριζόταν αρχικά 
προς πώληση ως ένα προϊόν, συσκευασμένο σε ένα κουτί. Στη συνέχεια, 
έγινε αντιληπτό ότι το περιεχόμενο του κουτιού ποτέ δεν ήταν το τελικό, 
αφού λίγες μέρες μετά τη συσκευασία και τη διανομή του, γίνονταν ήδη βελτιώσεις 
στον πηγαίο κώδικα. Η ανάπτυξη του διαδικτύου ως καναλιού διανομής 
επέτρεψε στο λογισμικό να βρει τον χαρακτήρα που του ταιριάζει περισσότερο, 
ως υπηρεσία, αν και υπάρχει μια υβριδική ισορροπία ανάμεσα στα δύο όταν το λογισμικό
συνοδεύει κάποια συσκευή. Διαπιστώνουμε ότι το λογισμικό είναι αρκετά διαφορετικό 
από άλλα προϊόντα και υπηρεσίες αναφορικά με τις παρακάτω ιδιότητες: 
α) την πνευματική ιδιοκτησία, β) την εμπορευσιμότητα, 
ιδιότητες τις οποίες οποίες μελετάμε παρακάτω.
◊fn{◊figref["linux"]}
◊fn{◊figref["napster"]}


Υπάρχουν πολλά είδη δικαιωμάτων πνευματικής ιδιοκτησίας, 
όπως το εμπορικό σήμα, η πατέντα και η πνευματική ιδιοκτησία. 
Τα περισσότερα έργα λογισμικού αντιμετωπίζονται όπως τα λογοτεχνικά βιβλία 
και έχουν πνευματική ιδιοκτησία, αν και υπάρχουν περιπτώσεις 
στο λογισμικό της διεπαφής ανθρώπου και υπολογιστή, 
στις οποίες έχει γίνει μία προσπάθεια για τη δημιουργία πατέντας. 
Για παράδειγμα, στα τέλη της δεκαετίας του 1980, 
η Apple προσπάθησε να προστατεύσει το Γραφικό Περιβάλλον Εργασίας  
απέναντι στον ανταγωνισμό της Microsoft. 
Επειδή το λογισμικό δεν είναι ούτε βιβλίο αλλά ούτε και βιομηχανικό αντικείμενο, 
τα υπάρχοντα είδη πνευματικής ιδιοκτησίας ίσως να μην του ταιριάζουν. 
Άλλωστε, αυξάνονται οι περιπτώσεις για τις οποίες το λογισμικό δίνεται 
με άδεια ανοικτού κώδικα ή παρέχει κάποια Διεπαφή Προγραμματισμού Εφαρμογών 
και στη συνέχεια ο δημιουργός αναζητεί αμοιβή 
μέσα από την πώληση της τεχνογνωσίας του. 
Όσο χαρακτηριστική είναι η περίπτωση αυτοδημιούργητων ιδιοκτητών
◊em{κλειστού κώδικα} όπως ο Bill Gates της Microsoft, 
άλλο τόσο ενδιαφέρουσα είναι η περίπτωση του Linus Torvalds
με τα ανοικτού κώδικα Linux, ο οποίος επέλεξε να δώσει δωρεάν 
τον καρπό της προσπάθειάς του. Και στις δύο περιπτώσεις 
είχαμε τη δημιουργία μιας πολύ μεγάλης βιομηχανίας και πολλών θέσεων εργασίας, 
παρόλο που η προσέγγιση του καθενός ήταν διαμετρικά αντίθετη.


Η εμπορευσιμότητα ενός αγαθού ή μιας υπηρεσίας εξαρτάται από πολλούς παράγοντες, 
αλλά ο σημαντικότερος είναι η δυνατότητα που υπάρχει για εύκολη γεωγραφική διανομή. 
Το λογισμικό, το οποίο ξεκίνησε ως μέρος του υλικού και στη συνέχεια έγινε δίσκος 
που αγοραζόταν από τα ράφια του λιανεμπορίου, σταδιακά, 
έχει μετατραπεί σε μια υπηρεσία διαθέσιμη στο διαδίκτυο. Στην ίδια συζήτηση 
έχει ενδιαφέρον να αναφερθούμε και στη δουλειά του προγραμματιστή λογισμικού, 
αλλά και στις δυνατότητες καθώς και στους κινδύνους από την εμπορευσιμότητα 
αυτής της εργασίας. Για παράδειγμα, μια υπηρεσία στον ιστό είναι διαθέσιμη παντού, 
πράγμα που σημαίνει ότι τελικά θα πρέπει να ανταγωνιστεί αντίστοιχες προσπάθειες 
από όπου και αν προέρχονται, είτε από τις τεχνολογικά ανεπτυγμένες χώρες, 
είτε από τις χώρες με το εξειδικευμένο εργατικό δυναμικό χαμηλού κόστους. 
Πέρα από τις ευκαιρίες για μια διευρυμένη αγορά, μέσα σε αυτό 
το παγκοσμιοποιημένο πλαίσιο επαγγελματικής δραστηριότητας, 
είναι μάλλον αφελές να κρατάμε κλειστή τη διεπαφή με ένα λογισμικό, 
αφού μέσα σε ένα μικρό σχετικά χρονικό διάστημα κάποιος μπορεί να φτιάξει 
κάτι παρόμοιο ή κάτι καλύτερο. Μια περισσότερο αποτελεσματική στρατηγική 
είναι να κάνουμε διαθέσιμο τον πηγαίο κώδικα ελπίζοντας σε συνεισφορές 
για τη βελτίωσή του και ταυτόχρονα να μαθαίνουμε από τις διαδράσεις 
που κάνουν οι χρήστες. Έτσι, θα βελτιώνουμε την υπηρεσία και, κυρίως,
θα αυξάνουμε τη γνώση που έχουμε για το τι συνιστά ανά πάσα στιγμή 
μια χρήσιμη και επιθυμητή υπηρεσία, το οποίο είναι και το ζητούμενο 
για ένα σχετικά βιώσιμο ανταγωνιστικό πλεονέκτημα.

Από την άλλη πλευρά, το λογισμικό λειτουργεί παρόμοια 
με τη μηχανή εσωτερικής καύσης και τη βιομηχανική ρομποτική αναφορικά 
με την αυτοματοποίηση της ανθρώπινης δραστηριότητας. Η αυτοματοποίηση θεωρείται, 
συνήθως, αρετή, αφού επιτρέπει στον άνθρωπο να ασχοληθεί 
με κάτι διαφορετικό από τις μηχανικές, επίπονες και επαναλαμβανόμενες διεργασίες. 
Στην πράξη, η αυτοματοποίηση επέτρεψε τη μετάβαση από την αγροτική στη βιομηχανική εποχή 
και έπειτα στην εποχή των υπηρεσιών. Η άλλη όψη του νομίσματος, όμως, 
περιγράφει μια επίπονη περίοδο μετάβασης από τη μια εποχή στην επόμενη. 
Όπως οι μηχανές εσωτερικής καύσης διευκόλυναν την εργασία και 
αύξησαν την παραγωγικότητα κατά τη μετάβαση από την αγροτική 
στη βιομηχανική εποχή και όπως η ρομποτική και ο αυτοματισμός μείωσαν 
στη συνέχεια την ανάγκη για ανθρώπινη εργασία στα εργοστάσια, 
έτσι και το λογισμικό διάδρασης, με τον ίδιο τρόπο, έρχεται να αυτοματοποιήσει 
πάρα πολλές εργασίες οι οποίες γίνονταν με τη μεσολάβηση ανθρώπων 
στη βιομηχανία των υπηρεσιών (π.χ. τράπεζες, ασφάλειες, ταξίδια, κτλ.). 
Αν η ιστορία είναι ένας σωστός οδηγός, τότε θα πρέπει να αναζητήσουμε 
την επόμενη βιομηχανική επανάσταση ανάμεσα στις δυνατότητες 
που μας προσφέρει η κατασκευή της διάδρασης για νέες υπηρεσίες και
αγαθά, τα οποία με τη σειρά τους θα ορίσουν μια νέα αγορά.

Στη βιομηχανική εποχή (19ος αιώνας), όταν οι μηχανές αντικατέστησαν 
το μεγαλύτερο μέρος της ανθρώπινης χειρωνακτικής εργασίας, 
σε πρώτη φάση δημιούργησαν στρατιές ανέργων, σε δεύτερη φάση, όμως, 
τα προϊόντα ορισμένων δημιουργικών ανθρώπων που βασίστηκαν στις μηχανές 
(π.χ. αεροπλάνο, αυτοκίνητο κ.ά.) δημιούργησαν νέους κλάδους εργασίας και 
ανθρώπινης δραστηριότητας, αθροιστικά πολύ μεγαλύτερους από αυτούς που 
αρχικά κατέστρεψαν. Για παράδειγμα, τόσο η βιομηχανία του τουρισμού
όσο και η αύξηση της οικονομικής δραστηριότητας με τη συγκέντρωση 
των ανθρώπων στις πόλεις, ήταν παράπλευρες ωφέλειες του αεροπλάνου και
του αυτοκινήτου, αντίστοιχα.

Είναι αλήθεια ότι το πρώτο κύμα διάχυσης του ΗΥ, με πρωταγωνιστή 
τον επιτραπέζιο ΗΥ, κατάφερε να αυτοματοποιήσει ένα πολύ μεγάλο μέρος 
της εργασίας γραφείου, με αποτέλεσμα την απώλεια θέσεων εργασίας 
στον πυρήνα της οικονομίας των υπηρεσιών. Σε αναλογία με 
τη βιομηχανική εποχή, η ενσωμάτωση και η διάχυση του ΗΥ 
στην καθημερινότητα με νέα προϊόντα και υπηρεσίες ενδέχεται 
να δημιουργήσει αθροιστικά περισσότερες θέσεις εργασίας 
από εκείνες που χάθηκαν, αρκεί να βρεθούν οι δημιουργικοί 
και καταρτισμένοι κατασκευαστές της διάδρασης, οι οποίοι 
θα οραματιστούν και θα υλοποιήσουν αυτούς τους νέους κλάδους 
της ανθρώπινης δραστηριότητας.

Η κατασκευή της διάδρασης δεν είναι πανάκεια και σίγουρα 
δεν είναι λύση σε σημαντικά προβλήματα που έχουν να κάνουν 
με τη φτώχεια και την υγεία. Από την άλλη πλευρά, 
η κατασκευή της διάδρασης είναι σίγουρα μια λύση συμβατή 
με την πολύ σημαντική ανάγκη που αφορά τη δυνατότητά μας 
να οραματιστούμε και να δημιουργήσουμε ένα διαφορετικό και 
νέο επίπεδο ανθρώπινης δραστηριότητας σε σημαντικούς τομείς 
όπως είναι η εργασία, ο πολιτισμός, και η εκπαίδευση. 
Τέλος, είναι σίγουρα μία από τις λίγες λύσεις που έχουμε 
για να θέσουμε σε λειτουργία τον εκδημοκρατισμό των ψηφιακών 
μέσων σχεδίασης και παραγωγής, τα οποία έχουν τη δυνατότητα 
να περάσουν την οικονομία στο επόμενο στάδιο μετά 
τη βιομηχανία των υπηρεσιών γραφείου, στην εποχή 
της δημιουργίας φαντασιακών μηχανών πέρα από 
την προσομοίωση του φυσικού και βιολογικού κόσμου.

![](extras-ch01.txt){.include}