#lang pollen

◊chapter{Μοντέλα}

◊epigraph["dyson-models"]

◊include["abs-models"]



◊section{Ο υπολογιστής ως εταίρος}

◊figure["eliza-chat-bot"]

◊figure["microsoft-bob"]

Το όραμα για διεπαφές φυσικής γλώσσας
έχει διατυπωθεί από πολύ νωρίς με μια υπόθεση
στην τελευταία δημοσίευση του Alan Turing,
σύμφωνα με την οποία η ανταλλαγή μηνυμάτων με έναν υπολογιστή
μπορεί να καθορίσει το επίπεδο νοημοσύνης του υπολογιστή.
Εξίσου πιθανό, βέβαια, είναι ο χρήστης να συμπεριφέρεται έτσι
ώστε η δική του νοημοσύνη να φαίνεται μικρότερη 
από αυτήν του υπολογιστή. Για παράδειγμα,
το δημοφιλές ρομπότ ψυχανάλυσης ELIZA λειτουργεί σε
ένα μικρό πεδίο συζήτησης και μπορεί να πείσει τους χρήστες
να μιλήσουν για τα προσωπικά τους σε μια μηχανή
και τελικά να νιώσουν καλύτερα. Αυτό δεν αποδεικνύει τόσο
τη δυνατότητα να έχουμε έξυπνους υπολογιστές όσο
τη δυνατότητα ή την ευκολία να πιστέψουμε αυτήν την ιδέα.
Παράλληλα με την ανάπτυξη των τεχνολογιών διάδρασης,
αναπτύσσεται με πολύ μεγαλύτερους ρυθμούς,
ο κλάδος της Τεχνητής Νοημοσύνης, στον οποίο
η διάδραση δεν έχει μεγάλη σημασία, αφού
τα συστήματα αυτά σχεδιάζονται με συμβολικούς τρόπους
ή με τη μηχανική μάθηση, προκειμένου να λειτουργούν αυτόνομα.
Οι τεχνικές που έχει αναπτύξει ο κλάδος της Τεχνητής Νοημοσύνης
είναι μερικές φορές χρήσιμες ως υποσυστήματα διάδρασης,
αλλά γίνονται λιγότερο χρήσιμες μέχρι και άγονες,
όταν παρουσιάζονται με την τεχνική του ανθρωπομορφισμού.
◊fn{◊figref["eliza-chat-bot"]}
◊fn{◊figref["microsoft-bob"]}

Η αντίληψη του υπολογιστή ως μιας έξυπνης και αυτόνομης οντότητας 
εμφανίστηκε για πρώτη φορά στη λογοτεχνία και στις ταινίες επιστημονικής φαντασίας 
όπου οι δημιουργοί φαντάζονταν έναν υπολογιστή με ανθρώπινα στοιχεία διάδρασης. 
Αυτός ο ανθρωπομορφισμός της διάδρασης ανθρώπου και υπολογιστή 
μπορεί να πάρει διάφορες μορφές ή χαρακτηριστικά, τα οποία συνδέουμε με την ανθρώπινη παρουσία, 
όπως πρόσωπο, ομιλία, σώμα, συναίσθημα, κοινή λογική. 
Η περιοχή της Τεχνητής Νοημοσύνης προσπάθησε να δώσει πρακτικές λύσεις στα παραπάνω, 
αλλά τα αποτελέσματά της έχουν μόνο περιορισμένη χρησιμότητα και σε πολύ καλά ορισμένες εφαρμογές. 
Για παράδειγμα, η αναγνώριση γραφής και ομιλίας είναι πλέον εμπορικά διαθέσιμες 
ύστερα από περισσότερα από σαράντα χρόνια έρευνας και αποτυχημένων εμπορικών προϊόντων. 
Στην πράξη, όμως, δεν είναι όσο χρήσιμη τη φαντάστηκαν οι δημιουργοί της επιστημονικής φαντασίας, 
ούτε τόσο πρακτική όσο τη σχεδίασαν οι επιστήμονες της Τεχνητής Νοημοσύνης, 
αφού στις περισσότερες περιπτώσεις η διάδραση γίνεται με συσκευές εισόδου και επιπρόσθετες διεπαφές 
που πρέπει να μάθει να χρησιμοποιεί ο χρήστης.


Ο αυτοματισμός είναι μια εκδοχή της διάδρασης ανθρώπου και υπολογιστή, στην οποία οι ενέργειες του χρήστη, 
η διεπαφή του υπολογιστή ή ακόμη και οι ανάγκες του χρήστη εξάγονται δυναμικά από τον υπολογιστή, 
ο οποίος μπορεί επιπλέον να λαμβάνει αποφάσεις με βάση ορισμένους κανόνες. 
Ο αυτοματισμός που προσφέρει ένας υπολογιστής μπορεί να διευκολύνει και τη διάδραση με τον άνθρωπο. 
Για παράδειγμα, μια λίστα με εφαρμογές μπορεί να ταξινομηθεί ανάλογα με το ποιες χρησιμοποιούμε συχνότερα. 
Φυσικά, αυτό σημαίνει ότι το αντίστοιχο μενού θα είναι πιθανόν διαφορετικό κάθε φορά που το ζητάει ο χρήστης, 
πράγμα που ίσως δημιουργεί, εκτός από διευκόλυνση, και μια ασυνέπεια απέναντι στη συνήθεια 
του να βρίσκουμε τα πράγματα εκεί που τα αφήσαμε.
◊fn{◊figref["adaptive-menus"]}
Αν και ο αυτοματισμός έχει αποδειχτεί πολύ χρήσιμος σε πολλές εφαρμογές των υπολογιστών, 
στην περίπτωση της διάδρασης, η χρήση του αυτοματισμού θέλει προσοχή, 
κυρίως, επειδή θα πρέπει να αξιολογηθεί απέναντι στον χρήστη, 
και όχι μόνο απέναντι σε κάποιες λειτουργικές και φαινομενικά αντικειμενικές προδιαγραφές.



Παράλληλα με τους ερευνητές της Τεχνητής Νοημοσύνης που προσπαθούν να κωδικοποιήσουν 
την ανθρώπινη λογική και συμπεριφορά σε έναν υπολογιστή, 
οι ερευνητές της Ανθρώπινης Επικοινωνίας διαπιστώνουν ότι στην πράξη 
οι ανθρώπινες αντιδράσεις κατά τη διάδραση με υπολογιστές και μέσα επικοινωνίας 
δεν έχουν διαφορά από τις αντιδράσεις κατά τη διάδραση με άλλους ανθρώπους και φυσικά αντικείμενα. 
Η διαπίστωση αυτή δημιούργησε μια σειρά από ερευνητικές και εμπορικές απόπειρες 
στην κατεύθυνση του ανθρωπομορφισμού και του σκευομορφισμού. 
Το αρχικό κίνητρο σε όλες αυτές τις προσπάθειες είναι η δημιουργία 
μιας περισσότερο οικείας και ◊em{φιλικής} διάδρασης με τον άνθρωπο. 
Στην πορεία, η φιλική διεπαφή της δεκαετίας του 1990 έδωσε τη θέση της 
στην πειστική διεπαφή της δεκαετίας του 2000, 
όταν οι σχεδιαστές προσπάθησαν να δημιουργήσουν διεπαφές 
που θα βοηθούσαν τους χρήστες να αλλάξουν συμπεριφορά.
◊fn{◊cite["fogg2003persuasive"]} 
Για παράδειγμα, μια εφαρμογή που καταγράφει τα βήματα και την απόσταση 
που διανύουμε καθημερινά με τα πόδια μπορεί να περιέχει τη στατιστική αποτύπωση των επιδόσεών μας 
και επιπλέον μια ανθρωπόμορφη διεπαφή που να μας παροτρύνει 
ή ακόμη και να μας επικρίνει (ανάλογα με το ψυχολογικό προφίλ του χρήστη) για τις επιδόσεις μας, 
έτσι ακριβώς όπως θα έκανε ένας φίλος ή ένας προσωπικός γυμναστής.
◊fn{◊figref["relational-agent"]}

◊figure["adaptive-menus"]

◊figure["relational-agent"]

Ίσως μια από τις πιο αποτυχημένες εισαγωγές νέου προϊόντος διάδρασης ανθρώπου και υπολογιστή 
να ήταν η προσπάθεια της Microsoft να δώσει μια πιο φιλική διάδραση στις εφαρμογές της με το Microsoft Bob
και το σχετικό Microsoft Office Clip. 
Αν και η ιδέα του ανθρωπομορφισμού βασιζόταν ήδη σε πολυετή επιστημονική έρευνα,
◊fn{◊cite["reeves1996media"]}
και παρά το ότι είχαν γίνει πολλές δοκιμές με χρήστες στα αρχικά στάδια του προϊόντος, 
τελικά η αποδοχή από το ευρύ κοινό ήταν από μικρή έως αρνητική.


Εκ των υστέρων, μια πιθανή εξήγηση αυτής της έλλειψης αποδοχής είναι ότι τουλάχιστον στη δεκαετία του 1990 
οι περισσότεροι επιτραπέζιοι υπολογιστές χρησιμοποιούνταν ακόμη κυρίως στην εργασία 
και γι' αυτό η έννοια της φιλικότητας μέσω του ανθρωπομορφισμού δεν είχε μεγάλη σημασία για τους χρήστες τους. 
Μπορεί να τους φαινόταν ακόμη και ενοχλητική, καθώς προσπαθούσαν να συγκεντρωθούν 
για να εργαστούν στον επεξεργαστή κειμένου και ξαφνικά, στην οθόνη του τερματικού τους, 
τους έπιανε κουβέντα ένας σκύλος! Σε δεύτερη ανάγνωση, η περίπτωση του Microsoft Bob είναι και μια προειδοποίηση 
ότι οι τεχνικές της ανθρωποκεντρικής σχεδίασης δεν είναι ασφαλείς, όχι επειδή είναι λάθος τεχνικές, 
αλλά, κυρίως, επειδή έχουν ως στόχο να ικανοποιήσουν ανθρώπινες ανάγκες που είναι από ασαφείς μέχρι ρευστές.


Οι έξυπνοι πράκτορες είναι μια αυτοματοποιημένη εκδοχή της διάδρασης με τον υπολογιστή. 
Ένας τρόπος να οριστούν οι έξυπνοι πράκτορες είναι να οριστούν ως το συμπλήρωμα του απευθείας χειρισμού. 
Όπως δηλαδή έχουμε τον απευθείας χειρισμό για να εκτελέσουμε μια διεργασία στον υπολογιστή, 
έτσι έχουμε και τους έξυπνους πράκτορες που μπορούν να εκτελέσουν αυτήν τη διεργασία για λογαριασμό μας. 
Από τη μια πλευρά, ο απευθείας χειρισμός δίνει στον χρήστη τη δυνατότητα να πάρει αποφάσεις, 
αλλά από την άλλη πλευρά υπάρχει ένα όριο στην πληροφορία που μπορεί να επεξεργαστεί ο χρήστης. 
Επιπλέον, σίγουρα υπάρχουν πολλές αποφάσεις που ως παρόμοιες 
ή τουλάχιστον έχοντας κάποιες ιδιότητες που είναι παρόμοιες, 
θα μπορούσαν να λαμβάνονται από έναν έξυπνο πράκτορα που εκπροσωπεί τον χρήστη. 
Αν και σε πρώτη ανάγνωση φαίνεται ότι οι έξυπνοι πράκτορες είναι το αντίθετο του απευθείας χειρισμού, 
εντούτοις είναι περισσότερο γόνιμο να αντιμετωπίζουμε αυτές τις δύο βασικές φιλοσοφίες διάδρασης ως συμπληρωματικές. 
Για παράδειγμα, ο χρήστης με απευθείας χειρισμό δείχνει στον υπολογιστή 
ότι κάποια από τα ηλεκτρονικά μηνύματα του είναι άχρηστα, 
ενώ άλλα είναι χρήσιμα για την εργασία του, 
κατά συνέπεια, ο έξυπνος πράκτορας, την επόμενη φορά που θα δει ένα μήνυμα, θα μπορέσει να το μεταφέρει στον σωστό φάκελο 
χωρίς επιπλέον ενέργειες από την πλευρά του χρήστη. Στην πράξη, αυτά τα συστήματα έχουν βελτιωθεί πάρα πολύ 
και στις περισσότερες περιπτώσεις κάνουν λιγότερα λάθη από τον άνθρωπο, 
όμως σε κάθε περίπτωση, για όποια λάθη κάνουν δεν φέρουν ευθύνη, 
κι αυτό μπορεί να είναι σημαντικό σε κάποιες εφαρμογές.


Όταν η μεταφορά γίνεται ιδιαίτερα αναπαραστατική σε ένα γραφικό περιβάλλον, 
τότε  μιλάμε για σκευομορφισμό, όπως για παράδειγμα πολλές εφαρμογές στις πρώτες εκδόσεις του iPhone,
οι οποίες μοιάζουν με αντικείμενα (π.χ. μικρόφωνο για την εγγραφή ηχητικών σημειώσεων) 
ή προσομοιώνουν οπτικά την υφή υλικών, όπως π.χ. μέταλλο, ύφασμα, κτλ. 
Αν και το αρχικό iPhone ήταν από τις πιο δημοφιλείς συσκευές με τεχνικές σκευομορφισμού στην έξοδο προς τον χρήστη, 
σίγουρα δεν ήταν η πρώτη. Στη δεκαετία του 1990, 
η σταδιακή μετατροπή και διανομή της μουσικής με συμπιεσμένα αρχεία τύπου MP3 
δημιούργησε την ανάγκη για ευέλικτες εφαρμογές εκτέλεσης των αρχείων MP3 στον υπολογιστή και ανάμεσα σε αυτές 
οι πιο δημοφιλείς ήταν εκείνες που επέτρεπαν στον χρήστη να αλλάξει την εμφάνιση της εφαρμογής (skinning), 
με πιο αντιπροσωπευτικό παράδειγμα την εφαρμογή Winamp. 
Η χρήση της μεταφοράς και του σκευομορφισμού δεν έχει από μόνη της πάντα θετικά αποτελέσματα. 
Για παράδειγμα, στις αρχές της δεκαετίας του 1990, 
το λειτουργικό σύστημα Magic Cap για τον κινητό υπολογισμό 
εμφάνιζε στην οθόνη ένα γραφείο με οικεία αντικείμενα, 
όπως το τηλέφωνο-φαξ, το ημερολόγιο, το σημειωματάριο, τη λίστα επαφών, 
τα εισερχόμενα και εξερχόμενα μηνύματα, το αρχείο, κτλ. 
Η χρήση της μεταφοράς στην περίπτωση του Magic Cap δεν σταματούσε στο γραφείο, 
αλλά συνεχιζόταν με τη μετακίνηση του χρήστη σε δωμάτια, από τα οποία είχε πρόσβαση σε διαφορετικές λειτουργίες. 
Αν και είναι δύσκολο έως αδύνατο να διακρίνουμε τα προβλήματα, 
καμία από τις παραπάνω μορφές της διεπαφής με τον χρήστη δεν είχε την αποδοχή των χρηστών, 
παρόλο που εφάρμοζαν κάποιους από τους κανόνες της φιλικής για τον άνθρωπο σχεδίασης, 
όπως είναι η μεταφορά και ο σκευομορφισμός.


Επιπλέον, με την ανάπτυξη του κινητού και διάχυτου υπολογισμού, στις αρχές της δεκαετίας του 2000, 
η διάδραση έκανε το μεγάλο βήμα πέρα από το πλαίσιο της εργασίας και του γραφείου. 
Ειδικά για την περίπτωση του διάχυτου υπολογισμού, όπου έχουμε πολλούς υπολογιστές 
διαφόρων μορφών φορετών στον χρήστη ή διάχυτων στο περιβάλλον, 
η νέα θεώρηση της διάδρασης βασίστηκε στις φιλοσοφικές θεωρίες για την ενσώματη διάδραση, 
οι οποίες περιγράφουν την ανθρώπινη σκέψη, την αντίληψη και τη δράση 
ως έννοιες στενά συνδεδεμένες με την ύπαρξη και τις ιδιότητες του ανθρώπινου σώματος. 
Οι υπολογιστές, πλέον, εκτός από την κινητή μορφή τους, 
μπορούν να φορεθούν και καταγράψουν βιομετρικά στοιχεία του χρήστη τους, όπως κινήσεις και σφυγμό. 
Παράλληλα με τη σταδιακή έμφαση στη συνολική φύση του ανθρώπου, 
μια μεγάλη μερίδα του επιστημονικού και εμπορικού κόσμου 
συνεχίζει να αναζητεί τη χρησιμότητα του υπολογιστή στον αυτοματισμό, 
όπου η διάδραση γίνεται αντιληπτή ως επικοινωνία με έναν έξυπνο βοηθό.

◊section{Εργαλείο}

◊figure["superpaint-toolbox"]

◊figure["macpaint"]


Αρχικά, τόσο οι πρώτοι κεντρικοί-υπολογιστές και οι μίκρο-υπολογιστές όσο και ο επιτραπέζιος υπολογιστής 
θεωρήθηκαν εργαλεία για τη διευκόλυνση των ανθρώπινων εργασιών. Για παράδειγμα, 
ο υπολογιστής μπορούσε να βοηθήσει τον χρήστη στον υπολογισμό της τροχιάς ενός διαστημοπλοίου, 
στη σύνταξη μιας γραπτής αναφοράς, στη σχεδίαση μιας κατασκευής,
◊fn{◊cite["mccullough1998abstracting"]} 
στην επεξεργασία μιας εικόνας.
◊fn{◊figref["superpaint-toolbox"]}
◊fn{◊figref["macpaint"]}
Με τη διάδοση του δικτύου Internet και την αύξηση της ισχύος (ταχύτητα, μνήμη, γραφικά) 
σε προσιτούς οικονομικά υπολογιστές αλλά και σε νέες μορφές, 
π.χ. φορητός, παιχνιδομηχανή, έξυπνο κινητό τηλέφωνο, κτλ.
μια νέα γενιά εφαρμογών διασκέδασης και επικοινωνίας ήρθε στο προσκήνιο, 
η οποία  απαιτούσε μια διαφορετική θεώρηση της διάδρασης πέρα από τη χρησιμότητα και την ευχρηστία. 
Για παράδειγμα, ψυχαγωγικές εφαρμογές όπως τα βιντεοπαιχνίδια έχουν σκοπό να διασκεδάσουν τον χρήστη 
και σε πολλές περιπτώσεις ο στόχος είναι να δυσκολέψουν τον χρήστη παρά να τον διευκολύνουν, 
αφού αυτή η προσέγγιση, στις σωστές δόσεις, θα ενισχύσει την εμβύθιση στην ψυχαγωγική δραστηριότητα.

Η αρχική εφαρμογή της τεχνολογίας των υπολογιστών
ήταν στην αυτοματοποίηση της ανθρώπινης εργασίας υπολογισμού πινάκων
για την τροχιά πυραύλων, κάτι που άλλαξε με τον χρονοδιαμοιρασμό.
Αυτή η θεμελίωση της περιοχής δημιούργησε την αντίστοιχη κατεύθυνση
και θεώρηση των υπολογιστών ως μηχανές δεδομένων
που βοηθάνε στη διαδικασία παραγωγής λογαριθμικών πινάκων.
Σύμφωνα με την αρχική θεώρηση, οι υπολογιστές είναι μηχανές,
σαν αυτές που υπάρχουν σε άλλες παραγωγικές διαδικασίες.
Οι μηχανές αυτές, αφού κατασκευαστούν πολύ προσεκτικά,
στη συνέχεια απαιτούν περιστασιακή μόνο παρέμβαση από τον άνθρωπο
κυρίως σε περίπτωση δυσλειτουργίας.
Ο ρόλος μιας υπολογιστικής μηχανής είναι να λαμβάνει μια είσοδο δεδομένων
και να δίνει μια έξοδο δεδομένων,
μέσα από μια αυστηρά προγραμματισμένη διεργασία,
σε αναλογία με τις βιομηχανικές διαδικασίες που μετασχηματίζουν υλικά.
Οι κεντρικοί πρωταγωνιστές αυτής της θεώρησης είναι η IBM,
καθώς και μια ομάδα ανθρώπων στο MIT μέχρι τη δεκαετία του 1960.
Η IBM θεωρεί τον υπολογισμό ως μια βιομηχανική υπηρεσία
που τιμολογείται με τον χρόνο εκτέλεσης ενός προγράμματος,
το οποίο λαμβάνει μια είσοδο δεδομένων και, μετά την εκτέλεση
μιας δέσμης προγραμμάτων, δίνει μια έξοδο δεδομένων
χωρίς την ενδιάμεση παρέμβαση κάποιου χειριστή.
Σε σχέση με αυτό το μοντέλο λειτουργίας,
η ιδέα ότι ένας χρήστης ή ακόμη και ένα σύνολο χρηστών,
αλληλεπιδρούν χωρίς να υπάρχει ένα δεδομένο πλάνο,
σε πραγματικό χρόνο, με ένα τόσο ακριβό μηχάνημα,
είναι πολύ μεγάλη σπατάλη.
Πράγματι, ακόμη και οι ίδιοι οι υποστηρικτές του χρονοδιαμοιρασμού
βασίζονται στην παραδοχή ότι κατά μέσο όρο κάθε χρονική στιγμή
ελάχιστοι χρήστες θα κάνουν ενεργή χρήση των υπολογιστικών πόρων.

Οι υποστηρικτές του χρονοδιαμοιρασμού, βασιζόμενοι στον νόμο του Moore,
ο οποίος προβλέπει τη μείωση του κόστους και, κυρίως, τον μετασχηματισμό
από τον υπολογισμό δεδομένων προς την κατεύθυνση
της διάδρασης με την πληροφορία για τις δουλειές του γραφείου,
θεώρησαν τον υπολογιστή ως εργαλείο στη διάθεση κάθε χρήστη.
Η εμφάνιση του Sketchpad από τον Ivan Sutherland
και των πρώτων λειτουργικών συστημάτων χρονοδιαμοιρασμού,
όπως το CTSS κατά τη δεκαετία του 1960,
έδωσε ώθηση στη θεώρηση των υπολογιστών ως εργαλεία
που επεκτείνουν τη δυνατότητα των ανθρώπων
να εργάζονται με την πληροφορία.
Πράγματι, ένας υπολογιστής χρονοδιαμοιρασμού
επιτρέπει την διάδραση σε πραγματικό χρόνο με πολλούς χρήστες,
οι οποίοι ενδέχεται να εκτελούν διαφορετικά προγράμματα.
Ο J.C.R. Licklider ήταν ο βασικός ενορχηστρωτής
αυτής της προσπάθειας μετασχηματισμού των υπολογιστών
από μηχανές παραγωγής σε διαδραστικά εργαλεία.
Για αυτόν τον σκοπό, χρηματοδότησε μια σειρά από έρευνες
με κεντρικό ρόλο τον χρονοδιαμοιρασμό και τη δικτύωση.
Αυτά που μετά το 2000 θεωρούνται θεμελιώδη για τις περισσότερες
εφαρμογές των υπολογιστών, εκείνη την εποχή
συνάντησαν όχι μόνο δυσκολίες αλλά και την άρνηση ομάδων και οργανισμών.
Ειδικά η IBM, χρειάστηκε να πιεστεί από τους πελάτες και
τους ανταγωνιστές της, όπως η DEC με τη δημοφιλή σειρά PDP,
για να προσφέρει και αυτή ένα σύστημα χρονοδιαμοιρασμού,
αφού στο επιχειρηματικό της μοντέλο
δεν υπήρχε η έννοια του χρήστη που αλληλεπιδρά σε πραγματικό χρόνο.
Ακόμη και μετά από είκοσι χρόνια, στις αρχές της δεκεατίας του 1980,
όταν η ΙΒΜ αναγκάζεται, υπό την πίεση των δημοφιλών μικρο-υπολογιστών
και των νέων εφαρμογών γραφείου, όπως το λογιστικό φύλλο εργασίας VisiCalc,
να δημιουργήσει τον προσωπικό της υπολογιστή,
θα αναθέσει σε εξωτερικούς προμηθευτές την ανάπτυξη του λογισμικού,
αφού η διάδραση σε πραγματικό χρόνο είναι κάτι ξένο.

◊figure["vi-editor"]

◊figure["unreal-blueprints"]

Οι άνθρωποι έμαθαν από τα πρώτα στάδια του επιτραπέζιου υπολογιστή
με γραφική διεπαφή τη δεκαετία του 1980
να τον βλέπουν ως εργαλείο, και αυτή η αντίληψη
παραμένει ισχυρή και σήμερα κατά τη χρήση του σε εργασιακά περιβάλλοντα.
Ως εξελιγμένο εργαλείο, ο ΗΥ με επεξεργαστή κειμένου
επιτρέπει στον χρήστη να προετοιμάσει ένα κείμενο σε ψηφιακή μορφή,
η οποία είναι πιο ευέλικτη στις αλλαγές, στην αποθήκευση και στη μεταφορά
σε σχέση με μια φυσική σελίδα που τυπώνεται στην παραδοσιακή γραφομηχανή
ή που γράφεται με ένα μολύβι.
Φυσικά υπάρχουν και σύνθετες περιπτώσεις,
στις οποίες πολλά εργαλεία συμπληρώνουν το ένα το άλλο
για να επιτελέσουν μια πολύπλοκη δραστηριότητα.
Για παράδειγμα, ο προγραμματισμός υπολογιστών
βασίζεται συνήθως στη χρήση ενός απλού επεξεργαστή κειμένου
και μιας σειράς από βοηθητικά προγράμματα υπολογιστή,
τα οποία υποστηρίζουν την προετοιμασία, τον έλεγχο και την τελική εκτέλεση
του νέου προγράμματος. Ο προγραμματιστής του υπολογιστή
αντιλαμβάνεται και χρησιμοποιεί τα παραπάνω ως εργαλεία
για να κάνει τη δουλειά του, που είναι η κατασκευή
ή η επισκευή ενός προγράμματος στον υπολογιστή.
◊fn{◊figref["vi-editor"]}
◊fn{◊figref["unreal-blueprints"]}

Η πρωταρχική και για πολλά χρόνια κυρίαρχη αντίληψη του υπολογιστή ως εργαλείου μπορεί να εντοπιστεί 
στα πρώτα στάδια της δημιουργίας και εξέλιξης της γραφικής επιτραπέζιας επιφάνειας εργασίας 
από την ερευνητική ομάδα του Xerox PARC. Η ανθρωποκεντρική μελέτη των διεργασιών του χρήστη 
βασίστηκε στην παρατήρηση, στις συνεντεύξεις, και στην ανάλυση της εργασίας 
που πραγματοποιείται στους εκδοτικούς οργανισμούς, οι οποίοι ήταν οι βασικοί πελάτες της εταιρείας Xerox 
κατά τη δεκαετία του 1970. Οι διεργασίες που εκτελεί αυτή η πολύ καλά ορισμένη ομάδα χρηστών 
π.χ. γλωσσική επιμέλεια, γραφικά, σελιδοποίηση, διαχείριση της παραγωγής του εντύπου, 
αποτέλεσαν το σημείο αναφοράς για την κατασκευή της διάδρασης, 
η οποία οργανώθηκε πάνω στη γραφική επιφάνεια εργασίας,
π.χ. φάκελοι, εργαλεία, καλάθι αχρήστων, κτλ.
ως βασική μεταφορά της εργασίας που κάνουν οι χρήστες.
◊fn{◊figref["xerox-gypsy"]}
◊fn{◊figref["desktop"]}
Αν και η επιφάνεια εργασίας αποδείχθηκε στην πορεία εξαιρετικά ευέλικτη 
και προσαρμόσιμη στις τεχνολογικές εξελίξεις, ταυτόχρονα, αυτό το αρχικό πλαίσιο δημιουργίας της, 
ως εργαλείο για εκδοτικές εργασίες, παρέμεινε ο βασικός περιορισμός που δημιουργεί την ανάγκη 
για μια διαφορετική αντίληψη της κατασκευής της διάδρασης, 
τουλάχιστον σε διαφορετικά πλαίσια ανθρώπινης δραστηριότητας, όπως η ψυχαγωγία.


Εκτός από τις διεργασίες της προετοιμασίας και της σελιδοποίησης μιας γραπτής αναφοράς, 
οι οποίες γίνονται τόσο από ερασιτέχνες όσο και από επαγγελματίες χρήστες ΗΥ, 
μια ακόμη δημοφιλής εφαρμογή της διάδρασης είναι η διαδικασία της σχεδίασης που εφαρμόζουν οι μηχανικοί. 
Από τις αρχές της δεκαετίας του 1980 όλες οι κατηγορίες μηχανικών 
άρχισαν να χρησιμοποιούν τον υπολογιστή αντί του σχεδιαστηρίου 
για να ετοιμάσουν κτίρια, δρόμους, γέφυρες, αεροσκάφη, μηχανές, αντικείμενα, και ηλεκτρικά κυκλώματα. 
Στην πράξη, η σχεδίαση με υπολογιστή είναι πολύ πιο αποδοτική, 
ειδικά για τη σχεδίαση αντικειμένων που είναι παρόμοια με άλλα υπάρχοντα ή μοιράζονται κάποια κοινά μοτίβα. 
Επιπλέον, το βασικό πλεονέκτημα είναι ότι η χρήση ΗΥ επιτρέπει τη γρήγορη αναίρεση μιας αλλαγής 
και την ασφαλή εξερεύνηση εναλλακτικών κατευθύνσεων. Επίσης, ένα ακόμη πλεονέκτημα της διαδραστικής σχεδίασης 
είναι ότι επιτρέπει την εύκολη αποθήκευση και τον διαμοιρασμό, 
στοιχεία απαραίτητα στις περισσότερες συνεργατικές δραστηριότητες σχεδίασης. Από την άλλη πλευρά, 
από τη στιγμή που η διαδραστική σχεδίαση λειτουργεί μόνο στο στενό και καλά ορισμένο πλαίσιο 
ενός προγράμματος διάδρασης στον υπολογιστή, δυσκολεύει τη σχεδίαση αντικειμένων που δεν έχουν υπάρξει ακόμη.  
Ως προς τον αυτοσχεδιασμό και τη φαντασία, η διαδραστική σχεδίαση είναι ακόμα ένα περιοριστικό εργαλείο, 
αν τη συγκρίνει κανείς με το μολύβι και το χαρτί στα χέρια ενός έμπειρου χρήστη.

◊figure["xerox-gypsy"]

◊figure["desktop"]

Η εμπορική σημασία του υπολογιστή ως εργαλείο φαίνεται στην περίπτωση του ηλεκτρονικού εμπορίου, 
το οποίο σε πολύ σύντομο χρονικό διάστημα άλλαξε τον τρόπο πώλησης και διανομής 
πολλών κατηγοριών τυποποιημένων προϊόντων και, κυρίως, υπηρεσιών. Η πανάρχαια συνήθεια 
της μετάβασης στην αγορά για την προμήθεια προϊόντων και υπηρεσιών μετασχηματίζεται 
σε μια διαδραστική εμπειρία στον υπολογιστή. Ο υπολογιστής ως εργαλείο επιλογής προϊόντων 
και ως εργαλείο πληρωμής μειώνει τη σημασία του τυπωμένου χρήματος,
καθώς η συναλλαγή πραγματοποιείται λογιστικά ανάμεσα στους λογαριασμούς του προμηθευτή και του πελάτη. 
Οι επιπτώσεις αυτές είναι πολύ σημαντικές ειδικά στην περίπτωση που τα ίδια τα αγαθά είναι ψηφιακά, 
όπως είναι η μουσική και οι ταινίες.


Η προτίμηση που δείχνουν οι χρήστες διαδραστικών συστημάτων στην ηλεκτρονική μορφή αγοράς 
και χρηματικής συναλλαγής δημιουργεί μια σειρά από πρωτοφανείς επιπτώσεις. 
Ειδικά στην περίπτωση της παροχής υπηρεσιών χωρίς τη μεταβίβαση κάποιου απτού προϊόντος, 
π.χ. αγορά αεροπορικών εισιτηρίων, κράτηση σε ξενοδοχείο, ψηφιακό ψυχαγωγικό περιεχόμενο, 
όπως μουσική, ταινίες, παιχνίδια, το ηλεκτρονικό εμπόριο αποδείχτηκε πιο αποτελεσματικό από το φυσικό, 
τόσο για τους χρήστες όσο και για τους παρόχους της υπηρεσίας. Στις περιπτώσεις όπου 
η μετάβαση στο ηλεκτρονικό εμπόριο υπήρξε καθολική, το αποτέλεσμα ήταν η καταστροφή 
πολλών επιμέρους ενδιάμεσων, π.χ. δισκοπωλεία, τουριστικοί πράκτορες κ.ά. Επομένως, 
βλέπουμε ότι η χρήση του υπολογιστή ως εργαλείου μπορεί να είναι μια απλή βελτιστοποίηση 
μιας διεργασίας που ήδη κάνουμε, π.χ. συγγραφή κειμένου, αλλά μπορεί και να έχει σημαντικές επιπτώσεις 
σε επαγγέλματα και ανθρώπινες δραστηριότητες που παύουν να υπάρχουν, επειδή, δεν χρειάζονται πλέον, 
αφού γίνονται πολύ πιο αποτελεσματικά με τον προγραμματισμό της διάδρασης ανθρώπου και υπολογιστή, 
π.χ. αγορά αεροπορικού εισιτηρίου.


Η αντίληψη του υπολογιστή ως εργαλείο παραμένει κυρίαρχη και στην εποχή της μετάβασης 
από τον επιτραπέζιο στον κινητό και διάχυτο υπολογισμό. Για παράδειγμα, 
ένα έξυπνο κινητό τηλέφωνο συνοδεύεται, συνήθως, από μια ψηφιακή φωτογραφική μηχανή, 
δηλαδή από ένα εργαλείο αποτύπωσης εικόνων. Οι ψηφιακές φωτογραφικές μηχανές επικράτησαν,
επειδή, εκτός από την οικειότητα που έχουμε αναπτύξει στη χρήση των βασικών λειτουργιών των έξυπνων κινητών 
και την ευχέρεια του να τα έχουμε πάντα μαζί μας, παρέχουν μια σειρά από επιπλέον λειτουργίες,
χάρη στις δυνατότητες του έξυπνου κινητού τηλεφώνου, π.χ. αισθητήρας θέσης, κίνησης, φίλτρα, δικτύωση, κτλ. 
Αυτές οι δυνατότητες κάνουν την ενσωματωμένη φωτογραφική μηχανή ακόμη πιο χρήσιμη και εύχρηστη, 
π.χ. για τη δημιουργία πανοραμικής φωτογραφίας. Όπως με τα κινητά τηλέφωνα που έχουν και φωτογραφική μηχανή, 
έτσι και οι φορετοί υπολογιστές και τα έξυπνα ρολόγια που περιέχουν αισθητήρες κίνησης και βιομετρικών στοιχείων,
μετατρέπουν ένα εργαλείο που έδινε ρυθμό με βάση τον κοινώς αποδεκτό χρόνο της Γης
σε εργαλείο που μετράει περισσότερες παραμέτρους, π.χ. ώρες ύπνου, βήματα,
και μπορεί να δώσει ρυθμό με βάση το βιολογικό σύστημα του κάθε ανθρώπου χωριστά. Συμπερασματικά, 
η αντίληψη του υπολογιστή ως εργαλείου παραμένει δημοφιλής, ίσως περισσότερο από ποτέ, 
καθώς η χρήση του διαχέεται σε όλο και πιο πολλές ανθρώπινες δραστηριότητες. Ταυτόχρονα, 
ο υπολογιστής αποκτά νέους ρόλους. Πέρα από εργαλείο, γίνεται και μέσο επικοινωνίας, 
και αυτός ο νέος ρόλος του ίσως να είναι και ο πιο σημαντικός από την πλευρά του ατόμου 
ως μέρους μια κοινότητας ανθρώπων.

◊section{Μέσο επικοινωνίας}

◊figure["bbs"]

◊figure["xerox-portholes"]

Οι εφαρμογές επικοινωνίας και συνεργασίας μέσω υπολογιστή είναι μια μεγάλη περιοχή,
την οποία ερευνά το πεδίο των κοινωνικών και συνεργατικών συστημάτων. 
Ειδικά οι εφαρμογές επικοινωνίας μέσω υπολογιστή απέκτησαν μεγάλη σημασία τόσο στην εργασία, π.χ. email
όσο και στην καθημερινή ζωή και τη διασκέδαση, π.χ. τόποι δημόσιων συζητήσεων, δικτυακά παιχνίδια ρόλων. 
Αυτό το βήμα συνοδεύτηκε από την ανάγκη για μια νέα θεώρηση της φιλοσοφίας της διάδρασης 
ως μέσου επικοινωνίας.
◊fn{◊cite["rheingold2000virtual"]} 
Επιπλέον, η θεώρηση της διάδρασης ως μέσου επικοινωνίας δίνει έμφαση στη συμμετοχή των χρηστών 
στην παραγωγή περιεχομένου και υπηρεσιών, τα οποία κατά τη δεκαετία του 2000 
έγιναν ο κυρίαρχος τρόπος διάδρασης με τους υπολογιστές, ειδικά στο διαδίκτυο. 
Η σημασία των υπολογιστών ως μέσου επικοινωνίας γίνεται ακόμη πιο εμφανής κατά τη δεκαετία του 2010, 
όταν το κοινωνικό δίκτυο Facebook, καθώς και τα έξυπνα κινητά τηλέφωνα γίνονται το πρώτο, 
και πολλές φορές το μόνο, σημείο επαφής των περισσότερων χρηστών με τους υπολογιστές.
◊fn{◊figref["bbs"]}
◊fn{◊figref["xerox-portholes"]}

Η ανθρωπιστική θεώρηση της διάδρασης δεν έχει καθιερωθεί,
αλλά έχει υποδεχτεί στην ομάδα της πολλές συμπληρωματικές συνεισφορές,
οι οποίες την έχουν επεκτείνει προς την κοινωνική διάδραση.
Μια από τις σημαντικές θεωρήσεις της διάδρασης εμπνέεται από το θέατρο,
όπου οι άνθρωποι παίζουν ρόλους και συνεργάζονται. Με αυτόν τον τρόπο,
ένα σύστημα διάδρασης μπορεί να θεωρηθεί ως μια συνεργατική αναπαράσταση.
◊fn{◊cite["laurel2013computers"]}
Και σε αυτήν τη περίπτωση, όπως στην απλή διάδραση,
η έμφαση βρίσκεται περισσότερο στην επαύξηση της συλλογικής νοημοσύνης, 
παρά στην προσομοίωση της φυσικής συνεργασίας.
Στην πράξη, όμως, φαίνεται ότι έχει επικρατήσει η αντίληψη
πως οι άνθρωποι πρέπει να επικοινωνούν και να συνεργάζονται
μέσω των υπολογιστών, όπως το κάνουν και στην πραγματικότητα.
Το αποτέλεσμα είναι πως οι αντίστοιχες εφαρμογές συνεργασίας
εστιάζουν μόνο στη μεταφορά του προσώπου και της φωνής,
όπως ακριβώς η επεξεργασία ενός εγγράφου εστιάζει μόνο
στο πώς θα φαίνεται όταν θα τυπωθεί στο φυσικό χαρτί.
Μια περισσότερο ανθρωπιστική σχεδίαση της επικοινωνίας
θα μπορούσε να προσθέτει νέες δυνατότητες αντίληψης,
αντί για την ψηφιακή προσομοίωση των φυσικών καναλιών επικοινωνίας.

◊figure["videoplace"]

◊figure["media-space"]

Μια από τις πιο δημοφιλείς εφαρμογές των πρώτων συστημάτων χρονοδιαμοιρασμού
ήταν η ηλεκτρονική αλληλογραφία. Οι περισσότεροι χρήστες
ήταν συνδεδεμένοι ταυτόχρονα ή με μικρή χρονική διαφορά σε τηλέτυπους,
με τους οποίους μπορούσαν να επικοινωνούν ασύγχρονα, αλλά πυκνά.
Αν και αυτοί οι χρήστες ήταν, συνήθως, σε σχετικά κοντινή γεωγραφική απόσταση,
επέλεγαν να επικοινωνήσουν με αυτόν τον τρόπο,
γιατί αυτός ο τρόπος είχε το πλεονέκτημα της ασύγχρονης επικοινωνίας
και όχι γιατί ήταν μια ανάγκη που δεν είχε εναλλακτική.
Η ηλεκτρονική αλληλογραφία έγινε ακόμη πιο δημοφιλής
στα τέλη της δεκαετίας του 1960, όταν το ARPANET
άρχισε να συνδέει τους λίγους διαθέσιμους υπολογιστές μεταξύ τους.
Η διάδραση με τον υπολογιστή αποκτάει έναν νέο χαρακτήρα,
ο οποίος εκτός από εργαλείο γίνεται και μέσο επικοινωνίας.
◊fn{◊figref["media-space"]}
Ο τεχνολογικός μετασχηματισμός προς τη δικτύωση
και τη διάδραση σε μεγαλύτερη κλίμακα δεν ήταν προτεραιότητα για όλους.
Για παράδειγμα, η ομάδα της τεχνητής νοημοσύνης στο ΜΙΤ
δεν έβλεπε τη σημασία της ευρύτερης δικτύωσης, αφού ο σκοπός της
δεν ήταν να μιλάνε οι άνθρωποι μεταξύ τους, αλλά με έξυπνες μηχανές.
Από την άλλη πλευρά,
η ίδια ομάδα δημιούργησε την ιδέα του ανοιχτού διαμοιρασμού,
κυρίως ως αντίδραση στο σχετικά πολύπλοκο, λόγω ασφάλειας MULTICS.
Στα τέλη της δεκαετίας του 1960,
δημιούργησαν ένα απλό σύστημα χρονοδιαμοιρασμού, το ITS,
το οποίο αρχικά δεν έκανε έλεγχο πρόσβασης χρήστη
και αποτέλεσε τη φιλοσοφική πλατφόρμα
για τις μελλοντικές κοινότητες ανοιχτού λογισμικού.
◊fn{◊cite["markoff2005dormouse"]}

Οι καλλιτέχνες ήταν από τους πρώτους που χρησιμοποίησαν τον υπολογιστή ως εργαλείο για να δημιουργήσουν. 
Όμως η πιο σημαντική συνεισφορά τους στην εξέλιξη της χρήσης του υπολογιστή ήταν ότι τον χρησιμοποίησαν 
ως μέσο για το έργο τους. Για παράδειγμα, η Brenda Laurel, με υπόβαθρο στις θεατρικές σπουδές,
αναγνωρίζει τη δυνατότητα των υπολογιστών να λειτουργούν ως σκηνή, στην οποία οι χρήστες μπορούν να παίζουν ρόλους 
και να αυτοσχεδιάζουν. Αυτή η αντίληψη έρχεται να συμπληρώσει την αντίληψη του υπολογιστή ως εργαλείου 
που σχεδιάζεται με στόχο να ικανοποιήσει καλά ορισμένες ανθρώπινες ανάγκες και δραστηριότητες. Επίσης, 
ο Myron Krueger κατασκεύασε για πρώτη φορά, στα μέσα της δεκαετίας του 1970, 
τη διάδραση ανθρώπου και υπολογιστή με έμφαση στην παρουσία του ανθρώπινου σώματος. 
Με αυτόν τον τρόπο, η κατανόηση της διάδρασης με τον υπολογιστή απελευθερώνεται 
από τη μέχρι τότε αντίληψή της ως εργαλείο και αρχίζει να γίνεται αντιληπτή και ως μέσο επικοινωνίας,
το οποίο συνδέει τους ανθρώπους είτε άμεσα μεταξύ τους είτε έμμεσα από την πληροφορία 
που μπορούμε συλλογικά να αναπαραστήσουμε στον υπολογιστή. Για παράδειγμα, το σύστημα Videoplace
◊fn{◊figref["videoplace"]}
χρησιμοποιεί κάμερες και προβολείς, έτσι ώστε να μεταφέρει ολόκληρο το ανθρώπινο σώμα 
μέσα σε ένα περιβάλλον τεχνητής πραγματικότητας.
◊fn{◊cite["krueger1991artificial"]}

◊figure["skype-video-call"]

◊figure["second-life"]

Η αρχική αντίληψη που έχουν οι περισσότεροι άνθρωποι για τη διάδραση 
και η οποία στη συνέχεια καθορίζει έμμεσα μια σειρά από άλλες αντιλήψεις και σχεδιαστικές επιλογές 
είναι αυτή της ◊em{ένας προς έναν} επικοινωνίας ανάμεσα σε άνθρωπο και υπολογιστή. 
Αν και η ένας προς έναν διάδραση ανθρώπου και υπολογιστή αποτελεί βασικό συστατικό κάθε σύνθετης μορφής διάδρασης, 
δεν βρίσκεται πάντα στο επίκεντρο του ενδιαφέροντος. Στον επιτραπέζιο υπολογιστή, 
όπου έχουμε ένα πληκτρολόγιο και ένα ποντίκι, η διάδραση ανάμεσα στον άνθρωπο και τον υπολογιστή είναι ένας προς έναν. 
Σε αυτό το πλαίσιο έχει δημιουργηθεί και έχει ωριμάσει η περιοχή της διάδρασης ανθρώπου και υπολογιστή. 
Καθώς, όμως, οι υπολογιστές άρχισαν να δικτυώνονται, είτε στον ίδιο χώρο είτε σε μεγάλες γεωγραφικές αποστάσεις 
και διαφορετικές χρονικές ζώνες, δημιουργήθηκε η ανάγκη να μελετήσουμε και να κατασκευάσουμε τη διάδραση 
που συμβαίνει ανάμεσα σε ανθρώπους οι οποίοι συνεργάζονται από απόσταση και σε διάφορους τομείς, 
όπως στην εργασία, τη διασκέδαση, την εκπαίδευση και την καθημερινή ζωή.
◊fn{◊figref["skype-video-call"]}
◊fn{◊figref["second-life"]}


Τα Συνεργατικά Συστήματα έγιναν γνωστά ως επιστημονική περιοχή στα τέλη της δεκαετίας του 1980, 
αλλά η συνεργασία και η επικοινωνία μέσω υπολογιστή είχε ήδη ξεκινήσει. Στα τέλη της δεκαετίας του 1970, 
η μεγάλη διάδοση των πρώτων οικονομικών προσωπικών υπολογιστών και των μόντεμ 
που επέτρεπαν την ψηφιακή μετάδοση δεδομένων μέσα από τις αναλογικές τηλεφωνικές γραμμές, 
δημιούργησε τα πρώτα Bulletin Board Systems (BBS). Τα BBS ήταν ένα είδος δημόσιας συζήτησης, 
όπου οι χρήστες μπορούσαν να  έχουν μια σύγχρονη ή ασύγχρονη συζήτηση, να αναρτήσουν ανακοινώσεις, 
και να μοιραστούν αρχεία. Την ίδια περίοδο, αντίστοιχα συστήματα συνεργατικού λογισμικού, 
βασισμένα σε μικρο-υπολογιστές και κεντρικούς υπολογιστές 
αναπτύχθηκαν για εταιρείες με σκοπό τη διευκόλυνση της επαγγελματικής συνεργασίας.


Η ερευνητική περιοχή της Συνεργασίας Ανθρώπων μέσω Υπολογιστών θεωρείται η πρώτη και ίσως η πιο σημαντική 
συγγενής περιοχή της Διάδρασης ανθρώπου και υπολογιστή. Επομένως, ένα μεγάλο μέρος της θεωρίας, 
των μεθόδων και των τεχνικών που χρησιμοποιούν είναι κοινές ή έστω παρόμοιες. Υπάρχει, όμως, 
τουλάχιστον μία σημαντική διαφορά που επιβάλλει την αντιμετώπιση των Κοινωνικών και Συνεργατικών Συστημάτων 
ως ξεχωριστή περιοχή. Ενώ στη διάδραση ανθρώπου και υπολογιστή εστιάζουμε, συνήθως, την προσοχή μας 
κατά τον προγραμματισμό και την αξιολόγηση του συστήματος στη διάδραση ανάμεσα σε έναν άνθρωπο και έναν υπολογιστή,
στα Κοινωνικά και Συνεργατικά Συστήματα η βασική μονάδα ανάλυσης είναι η διάδραση ανάμεσα σε μια ομάδα
τουλάχιστον δύο ανθρώπων, που συμβαίνει μέσω ενός τουλάχιστον υπολογιστή. Το πιο απλό και δημοφιλές παράδειγμα 
από την περιοχή των Συνεργατικών Συστημάτων είναι το Facebook, ένα σύστημα 
που επιτρέπει την επικοινωνία και τη συνεργασία ομάδων ανθρώπων.


Η σημασία των Κοινωνικών και Συνεργατικών συστημάτων πέρασε από τις εταιρείες στην ευρύτερη κοινωνία, 
και από την εργασία στην καθημερινότητα, με την ανάπτυξη των κοινωνικών δικτύων 
μετά τα μισά της δεκαετίας του 2000. Εκείνη την περίοδο, δημιουργήθηκαν πολλά κοινωνικά δίκτυα, 
όπου ο κάθε χρήστης περιέγραφε την προσωπικότητα και τις προτιμήσεις του 
και έκανε εικονικούς δεσμούς φιλίας με άλλους χρήστες. Ανάμεσα στα πολλά κοινωνικά δίκτυα, 
το Facebook ήταν εκείνο που γνώρισε τη μεγαλύτερη αποδοχή, 
με περισσότερο από ένα δισεκατομμύριο εγγεγραμμένους χρήστες στις αρχές της δεκαετίας του 2010. 
Οι βασικές δραστηριότητες των χρηστών του Facebook είναι η ενημέρωση της τρέχουσας κατάστασής τους, 
η δημόσια ή ιδιωτική συζήτηση, και η ανάρτηση φωτογραφιών. 
Καθώς ο κύριος όγκος της δραστηριότητας στο διαδίκτυο μετατοπίστηκε από την υπηρεσία του ιστού 
και την ανάρτηση ιστοσελίδων, στα δίκτυα κοινωνικής δικτύωσης, 
αντίστοιχα παρατηρούμε και μια μεταβολή στο είδος της διάδρασης των νέων εφαρμογών, 
οι οποίες επιβάλλεται να έχουν πλέον και μια κοινωνική διάσταση.



![](extras-ch05.txt){.include}

