#lang pollen

◊chapter{Ιστοσελίδα και συνοδευτικό περιεχόμενο}

◊epigraph["picasso-do"]

Αν και φτάσατε στην τελευταία σελίδα, το βιβλίο αυτό δεν τελειώνει εδώ,
αλλά συνεχίζεται στη συνοδευτική ηλεκτρονική του έκδοση, η οποία
περιέχει πολυμεσικό και διαδραστικό περιεχόμενο, όπως είναι
θεματικές διαφάνειες και τα χρονολόγια. Επίσης, σκόπιμα το
βιβλίο δεν περιέχει μια σειρά από ενότητες όπως οι ασκήσεις και οι
εργασίες, γιατί αυτές βρίσκονται στην ιστοσελίδα, έτσι ώστε να μπορούν
να ενημερώνονται συνέχεια: [https://pibook.epidro.me](https://pibook.epidro.me)