#lang racket/base

(provide quotes)

(define quotes
  (hash
   "elytis-invent"
   (hash 'caption " Δεν στηρίζομαι στα σύμβολα των αρχαίων μύθων, αλλά στην εσωτερική λειτουργία που οδήγησε στην γέννηση των μύθων αυτών. "
         'person " Odysseas Elytis ")

   "holt-learning"
   (hash 'caption " Η μάθηση δεν είναι το αποτέλεσμα της διδασκαλίας, αλλά το αποτέλεσμα της δραστηριότητας του μαθητή. "
         'person " John Holt ")

   "kay-archetypes"
   (hash 'caption " O Leonardo da Vinci δεν μπορούσε να εφεύρει ούτε έναν κινητήρα για κάποιο από τα οχήματά του. Μπορεί να ήταν ο εξυπνότερος άνθρωπος στην εποχή του, αλλά γεννήθηκε στη λάθος εποχή. Η εξυπνάδα του δεν μπορούσε να υπερβεί την εποχή του."
         'person " Alan Kay")

   "kay-art"
   (hash 'caption " Όπως η τέχνη θεωρήθηκε ως μίμηση της ζωής, έτσι και οι τέχνες των υπολογιστών μπορούν να θεωρηθούν ως η μίμηση της ίδιας της δημιουργίας "
         'person " Alan Kay")

   "kay-software"
   (hash 'caption " Οι κατασκευαστές που σχεδιάζουν προσεκτικά το λογισμικό τους φτιάχνουν και το δικό τους υλικό."
         'person " Alan Kay")

   "lanier-instrument"
   (hash 'caption " Αν υπάρχει ένα προηγούμενο στην ανθρώπινη εμπειρία που να δείχνει πώς θα πρέπει να μοιάζει ένας υπολογιστής, αυτό είναι το μουσικό όργανο, μια επινόηση με την οποία μπορείς να διερευνήσεις ένα τεράστιο εύρος δυνατοτήτων μέσω μιας διεπαφής που συνδέει το μυαλό με το σώμα σου."
         'person " Jaron Lanier")

   "mcluhan-technology"
   (hash 'caption " Δεν ξέρω ποιος ανακάλυψε το νερό, αλλά σίγουρα δεν ήταν ένα ψάρι "
         'person " Marshall McLuhan ")

   "olsen-computers"
   (hash 'caption " Δεν βλέπω τον λόγο για τον οποίο κάποιος θα ήθελε να έχει έναν προσωπικό υπολογιστή στο σπίτι του. "
         'person " Ken Olsen")

   "watson-computers"
   (hash 'caption " Εκτιμώ πως υπάρχει μια αγορά για συνολικά πέντε υπολογιστές στις ΗΠΑ."
         'person " Thomas Watson ")

   "victor-definition"
   (hash 'caption " Ο προγραμματισμός είναι ένας τρόπος σκέψης, όχι μια μηχανιστική δεξιότητα. Το να μάθεις τους βρόγχους for δεν σημαίνει πως μαθαίνεις να προγραμματίζεις, όπως δεν σημαίνει πως μαθαίνεις να ζωγραφίζεις μαθαίνοντας για τα μολύβια."
         'person " Bret Victor")

   "buxton-method"
   (hash 'caption " Κάνοντας σωστά τη σωστή σχεδίαση."
         'person " Bill Buxton")

   "feynman-understand"
   (hash 'caption " Μπορώ να κατανοήσω μόνο αυτό που μπορώ να φτιάξω."
         'person " Ρίτσαρντ Φάινμαν")

   "dyson-models"
   (hash 'caption " Το σπουδαίο έργο του Einstein είχε προέλθει από φυσική διαίσθηση και όταν ο Einstein σταμάτησε να δημιουργεί, ήταν επειδή έπαψε να σκέφτεται με συγκεκριμένες φυσικές εικόνες και έγινε χειριστής εξισώσεων."
         'person " Freeman Dyson")

   "licklider-augmentation"
   (hash 'caption " Ελπίζουμε ότι, σε όχι πάρα πολλά χρόνια, τα ανθρώπινα μυαλά και οι υπολογιστικές μηχανές θα συνδεθούν πολύ στενά μεταξύ τους, και ότι η συνεργασία που θα προκύψει θα σκέφτεται όπως δεν έχει σκεφτεί ποτέ ο ανθρώπινος εγκέφαλος και θα επεξεργάζεται τα δεδομένα με τρόπο που δεν έχουν πλησιάσει οι μηχανές διαχείρισης της πληροφορίας που γνωρίζουμε σήμερα."
         'person " J. C. R. Licklider")

   "picasso-do"
   (hash 'caption " Συνέχεια προσπαθώ να κάνω αυτό που δεν μπορώ, έτσι ώστε κάποια στιγμή να μπορώ να το κάνω."
         'person " Πάμπλο Πικάσο")

   "aristotle-learning"
   (hash 'caption " Τα πράγματα που πρέπει να κάνεις, τα μαθαίνεις κάνοντάς τα."
         'person " Αριστοτέλης")
   ))
