#lang racket/base

(provide figures)

(define figures
  (hash
   "acme-editor"
   (hash 'image_url "/images/acme-editor.png"
         'caption "Η σταδιακή μετάβαση των συστημάτων που βασίζονταν στο UNIX όπως το Plan9 από την γραμμή εντολών προς την κατεύθυνση μιας γραφικής διεπαφής, δημιουργήσε και την ανάγκη για μια ανάλογη διεπαφή με τον επεξεργαστή κειμένου που παραμένει βασικό εργαλείο του συστήματος. Ο ACME εμπνέεται από το σύστημα Oberon και συνθέτει μια γραφική διεπαφή που βασίζεται κυρίως στο κείμενο και σε εντολές που ενεργοποιούνται με ακόρντα από το ποντίκι πάνω στο κείμενο. "
         'title "Επεξεργαστής κειμένου ACME "
         'license_text "Wikimedia ")

   "action-adventure"
   (hash 'image_url "/images/action-adventure.png"
         'caption ""
         'title "Action Adventure "
         'license_text "")

   "active-badge"
   (hash 'image_url "/images/active-badge.jpg"
         'caption "Το Active Badge είναι από τα πρώτα συστήματα εντοπισμού θέσης σε εσωτερικό χώροι και εφευρέθηκε για να μελετηθούν θέματα αυτοματισμού, συνεργασίας, και ιδιωτικότητας. Εκπέμπει υπέρυθρα σήματα τα οποία επιτρέπουν στους αποδέκτες των τοπικών υποδομών να εντοπίσουν το σημείο που βρίσκεται ο χρήστης εντός του κτιρίου, έτσι ώστε να ενεργοποιηθούν συμπεριφορές που βασίζονται στην επίγνωση του χωρικού πλαισίου του χρήστη."
         'title "Επίγνωση χωρικού πλαισίου με το Active Badge"
         'license_text "Deutsches Museum")

   "adaptive-menus"
   (hash 'image_url "/images/adaptive-menus.png"
         'caption "Οι χρήστες προτιμούν τα στατικά μενού ή τα μενού που μπορούν να αλλάξουν μόνοι τους, ενώ δεν προτιμούν ούτε έχουν καλή επίδοση με ένα μενού που αλλάζει αυτόματα ανάλογα με τη συχνότητα χρήσης."
         'title "Δυναμικά εξατομικευμένα μενού επιλογών "
         'license_text "Microsoft")

   "adventure-videogame"
   (hash 'image_url "/images/adventure-videogame.png"
         'caption "Το πρώτο βιντεοπαιχνίδι περιπέτειας εμπνέεται από τα επιτραπέζια παιχνίδια ρόλου αλλά δεν έχει καθόλου γραφικά και βασίζεται σε περιγραφές κειμένου και σε διάδραση με την γραμμή εντολών για την είσοδο και την έξοδο με τον χρήστη. Αυτή η απλή διεπαφή δεν εμπόδισε το βιντεοπαιχνίδι να γίνει δημοφιλές και κυρίως να επηρεάσει την δημιουργία άλλων παρόμοιων που πρόσθεσαν γραφικά και επιπλέον παίκτες, έτσι ώστε να δημιουργηθεί μια νέα κατηγορία διαδραστικής λογοτεχνίας και αφήγησης. "
         'title "Colossal Cave Adventure "
         'license_text "Wikimedia")

   "altair-teletype"
   (hash 'image_url "/images/altair-teletype.jpg"
         'caption "O Altair θεωρείται ο πρώτος δημοφιλής μικρο-υπολογιστής και ήταν διαθέσιμος σε οικονομικό κιτ, το οποίο ο χρήστης συναρμολογούσε μόνος του, και στη συνέχεια θα έπρεπε να αγοράσει και τα σχετικά περιφεριακά, εισόδου και εξόδου, όπως ο τηλέτυπος για την είσοδο και την έξοδο κειμένου,  τα οποία κόστιζαν ακόμη περισσότερο. Ήταν όμως πολύ πιο προσιτός από τους μινι-πολογιστές εκείνης της εποχής και επιπλέον ήταν διαθέσιμος με την επίσης προσιτή γλώσσα προγραμματισμού BASIC. "
         'title "Altair και Τηλέτυπος "
         'license_text "wikimedia")

   "amaya-web-editor"
   (hash 'image_url "/images/amaya-web-editor.jpg"
         'caption "Η εφαρμογή Amaya παρέχει ολοκληρωμένη πρόβαση στον παγκόσμιο ιστό, όχι μόνο ως φυλλομετρητής, αλλά, κυρίως, ως ένα περιβάλλον επεξεργασίας εγγράφων για δημοσίευση. Αποτελεί την δεύτερη προσπάθεια μετά την εφαρμογή WorldWideWeb (Nexus) για μια συμετοχική πρόσβαση στην πληροφορία που βρίσκεται στον παγκόσμιο ιστό."
         'title "Επεξεργασία ιστοσελίδων με τον φυλλομετρητή Amaya"
         'license_text "Wikipedia")

   "android-emulator"
   (hash 'image_url "/images/android-emulator.png"
         'caption "Ο εξομοιωτής για τις κινητές συσκευές με λειτουργικό σύστημα Android, εκτός από την εξομοίωση της επεξεργασίας των δεδομένων, περιλαμβάνει και μια προσομοίωση κάποιων κουμπιών και διαδράσεων, που, συνήθως, έχουν τα έξυπνα κινητά."
         'title "Εξομοιωτής συσκευής Android "
         'license_text "")

   "animated-hand"
   (hash 'image_url "/images/animated-hand.png"
         'caption "Η μοντελοποίηση αντικειμένων από τον πραγματικό κόσμο στον υπολογιστή αρχικά γινόταν σε συνδυασμό με αναλογικά μέσα, όπως το φιλμ για την καταγραφή των διαδοχικών εικόνων, αλλά σταδιακά μεταφέρθηκε στον υπολογιστή. Η μοντελοποίηση με κινούμενα γραφικά για το ανθρώπινο χέρι από τον μαθητή του Ivan Sutherland Edwin Catmull θεωρείται η αφετηρία που τελικά οδήγησε στις ψηφιακές ταινίες. "
         'title "Γραφικά με κίνηση για ένα μοντέλο του ανθρώπινου χεριού "
         'license_text "Wikipedia")

   "app"
   (hash 'image_url "/images/ui-sdk.png"
         'caption "Οι πρώτες εφαρμογές επεξεργασίας εικόνας είχαν τη δική τους γραφική διεπαφή με τον χρήστη, αφού το κυρίαρχο λειτουργικό σύστημα της εποχής MS-DOS δεν είχε ακόμη γραφική διεπαφή, με αποτέλεσμα να υπάρχει μεγάλη ασυνέπεια ακόμη και σε οριζόντιες λειτουργίες (π.χ., παράθυρα, αποθήκευση, κτλ.) ανάμεσα στις διαφορετικές εφαρμογές."
         'title "Βιβλιοθήκη προγραμματισμού διεπαφής χρήστη "
         'license_text "")

   "apple-i-computer"
   (hash 'image_url "/images/apple-i-computer.jpg"
         'caption ""
         'title "Apple I"
         'license_text "Wikipedia")

   "apple-lisa"
   (hash 'image_url "/images/apple-lisa.jpg"
         'caption "Το σύστημα Apple Lisa κατασκευάστηκε με στόχο την αγορά γραφείου και ήταν το πρώτο σύστημα της εταιρίας με γραφικό περιβάλλον εργασίας. Αν και απέτυχε εμπορικά, οι τεχνολογίες διάδρασης ενσωματώθηκαν στον Apple Macintosh. "
         'title "Apple Lisa 1983"
         'license_text "Apple")

   "apple-macintosh"
   (hash 'image_url "/images/apple-macintosh-1984.jpg"
         'caption "Η πρώτη εμπορική επιτυχία για τη γραφική επιφάνεια εργασίας ήρθε με τον υπολογιστή Apple Macintosh, ο οποίος θεωρείται εγγονός του Xerox Star, γιος του Apple Lisa και ο βασικός πρόγονος για όλες τις σύγχρονες γραφικές επιφάνειες εργασίας, όπως τα Microsoft Windows 95. O Macintosh κατάφερε να συνθέσει και να βελτιώσει πολλές πτυχές της διεπαφής με τον χρήστη και να τις προσφέρει σε μια μορφή και με μια λειτουργία που αποτελούν σημεία αναφοράς για τις επόμενες δεκαετίες."
         'title "Apple Macintosh 1984"
         'license_text "wikimedia")

   "apple-mouse"
   (hash 'image_url "/images/apple-mouse.jpg"
         'caption ""
         'title "Ποντίκι με ένα μόνο πλήκτρο"
         'license_text "CC-BY-SA 3.0 ")

   "apple-newton"
   (hash 'image_url "/images/apple-newton.jpg"
         'caption "Πολύ πριν την επιτυχία του iPad, το Apple Newton προσπάθησε να προσφέρει εύχρηστη διάδραση σε κινητή μορφή για μαθητές και εργαζόμενους, βασιζόμενο στη φυσική διάδραση της γραφής, η οποία, όμως, εκείνη την εποχή δεν είχε την αναγκαία ακρίβεια."
         'title "Αpple Newton"
         'license_text "DAVIDSDIEGO")

   "apple-watch"
   (hash 'image_url "/images/apple-watch.png"
         'caption "Το έξυπνο ρολόϊ της Apple ξεκίνησε ως συνοδευτικό του έξυπνου κινητού τηλεφώνου, το οποίο αρχικά ήταν συνοδευτικό του προσωπικού υπολογιστή, αλλά σταδικά και τα δύο αποκτούν μεγαλύτερη αυτονομία στην λειτουργία τους. Με το έξυπνο ρολόϊ η διάδραση μεταφέρεται πλέον από το χέρι πάνω στο σώμα του χρήστη, ενώ για την πλοήγηση στις λειτουργίες χρησιμοποιείται μια εκδοχή του τροχού κύλισης, ο οποίος είχε αρχικά χρησιμοποιηθεί στο iPod."
         'title "Apple Watch"
         'license_text "Wikimedia")

   "apple2"
   (hash 'image_url "/images/apple2.jpg"
         'caption "Ο δεύτερος μικρο-υπολογιστής της Apple ήταν άμεσα διαθέσιμος σε μια καλαίσθητη συσκευασία βιομηχανικού σχεδιασμού με πληκτρολόγιο και είχε εισόδους και εξόδους για πολλά διαφορετικά περιφερειακά, όπως δίσκοι και οθόνη. Μπορούσε να συνδεθεί σε τηλεόραση και να αποθηκεύσει προγράμματα σε ένα μαγνητόφωνο κασέτας ήχου, οπότε το κόστος ήταν χαμηλό και έγινε αμέσως δημοφιλής, ενώ έμεινε σε παραγωγή για περισσότερα από δεκαπέντε χρόνια."
         'title "Apple II "
         'license_text "Apple")

   "architecture-model"
   (hash 'image_url "/images/architecture-model.jpg"
         'caption "Η σχεδίαση ενός πρωτοτύπου με σκοπό τον αρχικό, γρήγορο και οικονομικό, έλεγχο της διάδρασης είναι ανάλογη με την κατασκευή προσχεδίων και μακέτας από τους αρχιτέκτονες μηχανικούς."
         'title "Αρχιτεκτονική Μακέτα "
         'license_text "")

   "arduino-ide"
   (hash 'image_url "/images/arduino-ide.png"
         'caption "Ο προγραμματισμός νέων διεπαφών με τον χρήστη ήταν μια εξειδικευμένη εργασία, η οποία απαιτούσε γνώσεις τόσο υλικού όσο και λογισμικού υπολογιστών. Το ολοκληρωμένο περιβάλλον ανάπτυξης του Arduino περιλαμβάνει βιβλιοθήκες και γλώσσα προγραμματισμού που μοιάζουν με την δημοφιλή C, τα οποία κρύβουν τις λεπτομέρειες του υλικού και επιτρέπουν στον κατασκευαστή να εστιάσει στις νέες λειτουργίες που σχεδιάζει."
         'title "Περιβάλλον προγραμματισμού για μικροελεκτή Arduino "
         'license_text "Arduino")

   "arduino-lilypad"
   (hash 'image_url "/images/arduino-lilypad.jpg"
         'caption "Το Arduino Lilypad σχεδιάστηκε έτσι ώστε να διευκολύνει το ράψιμό του σε υφάσματα και να είναι συμβατό με την πλατφόρμα του Arduino. Με αυτόν τον τρόπο, οι σχεδιαστές μπορούν χρησιμοποιήσουν εξοπλισμό και δεξιότητες που ήδη έχουν με εφαρμογή σε ρούχα και αξεσουάρ όπως τσάντες, γάντια, παπούτσια, και καπέλα."
         'title "Arduino Lilypad"
         'license_text "")

   "arduino-shield"
   (hash 'image_url "/images/arduino-shield.jpg"
         'caption "Η επέκταση με shields επιτρέπει στο βασικό Arduino να αποκτήσει νέες δυνατότητες εισόδου (π.χ., joystick) και εξόδου."
         'title "Arduino Shield"
         'license_text "")

   "arduino-uno"
   (hash 'image_url "/images/arduino-uno.jpg"
         'caption "Υπάρχουν πάρα πολλά είδη Arduino, τα οποία εξυπηρετούν διαφορετικές ανάγκες, ανάλογα με την υπολογιστική ισχύ και το μέγεθος, άλλα όλη η σειρά αυτών των μικροελεγκτών έχει σχεδιαστεί με βασικό στόχο τη γρήγορη κατασκευή πρωτοτύπων διάδρασης, τα οποία βασίζονται σε νέες καινοτόμες συσκευές εισόδου και εξόδου."
         'title "Arduino Uno"
         'license_text "Arduino")

   "ascii-art"
   (hash 'image_url "/images/ascii-art.png"
         'caption "Το διαχρονικό και δημοφιλές τερματικό κειμένου έχει απλή κατασκευή και δεν υποστηρίζει γραφικά, αλλά αυτό δεν εμποδίζει την προσομοίωση των γραφικών μέσω της κατάλληλης διευθέτησης των χαρακτήρων κειμένου. Η τεχνική αυτή εφαρμόστηκε αρχικά στους εκπυπωτές γραμμής που ήταν το πρώτο τερματικό εξόδου για την επικοινωνία με τον χρήστη, αλλά έγινε δημοφιλής από τις δικτυακές κοινότητες επικοινωνίας."
         'title "Προσομοίωση γραφικών σε τερματικού κειμένου"
         'license_text "BY-SA-4.0")

   "aspen-movie-map"
   (hash 'image_url "/images/aspen-movie-map.jpg"
         'caption "Το Aspen Movie Map ήταν μια επίδειξη των δυνατοτήτων που προσέφεραν τα πολυμέσα και η διάδραση στους υπολογιστές με εφαρμογή στον πολιτισμό, καθώς επέτρεπε την εικονική περιήγηση στο γραφικό χωριό Aspen στο Colorado. Για την συλλογή των δεδομένων χρησιμοποιήθηκε μια κάμερα πάνω σε ένα αμάξι, ενώ για την πλοήγηση στην πληροφορία ο χρήστης είχε στην διάθεση του πολλές οθόνες με συμπληρωματικά μοντέλα, όπως είναι ο γεωγραφικός χάρτης, τα μοντέλα τριών διαστάσεων, και οι εικόνες."
         'title "Πολυμεσική και χαρτογραφική πλοήγηση "
         'license_text "MIT Media Lab")

   "asteroids"
   (hash 'image_url "/images/asteroids.png"
         'caption "Το Asteroids ήταν μια πολύ μεγάλη εμπορική επιτυχία που ξεπέρασε ακόμη και το Space Invaders της προηγούμενης χρονιάς, από το οποίο δανειζόταν την ιδέα των εχθρικών διαστημοπλοίων, στην οποία προσθέτει τη καινοτομία των αστεροειδών. Τα χειριστήρια του Moon Lander χρησιμοποιούνται και εδώ με τη διαφορά ότι το ένα κουμπί είναι για τον πυροβολισμό αντί για την δυνατή ώθηση. Επίσης, χρησιμοποιεί την ίδια ακριβώς μηχανή διανυσματικών γραφικών του Moon Lander, ενώ οι πρώτες εκδόσεις του βασίζονται και στην ίδια ακριβώς πλακέτα υλικού, στην οποία γίνονται μετατροπές για να προλάβουν τη μεγάλη ζήτηση για αυτό το βίντεοπαιχνίδι, έναντι του προκατόχου του."
         'title "Asteroids Arcade "
         'license_text "Wikipedia")

   "atari-2600"
   (hash 'image_url "/images/atari-2600.jpg"
         'caption "Σε αντίθεση με τους πρώτους μικρο-υπολογιστές εκείνης της χρονιάς, η κονσόλα της Atari εστιάζει μόνο στη διασκέδαση με βιντεοπαιχνίδια, τα οποία αγοράζονται όπως τα βιβλία και οι δίσκοι και φορτώνονται με εξωτερικές κάρτες μνήμης ανάγνωσης. Αντί για πληκτρολόγιο, έχει μοχλό, για τον έλεγχο των χαρακτήρων στα βιντεοπαιχνίδια. Ο βιομηχανικός σχεδιασμός ταιριάζει με αυτόν της τηλεόρασης, με την οποία συνδέεται ως συσκευή εξόδου και, με τη βοήθεια του βιντεοπαιχνιδιού Space Invaders, δημιουργεί μια νέα κατηγορία διαδραστικού υπολογιστή. "
         'title "Atari 2600 "
         'license_text "Wikipedia")

   "atkinson-profile"
   (hash 'image_url "/images/atkinson-profile.jpg"
         'caption "Ο Bill Atkinson ήταν βασικός συντελεστής σε σημαντικά προϊόντα όπως τα Apple Lisa και Macintosh, καθώς και το Apple Paint, για το οποίο κατασκεύασε τη διάδραση με τα μενού και τις παλέτες εργαλείων. Η συνεισφορά του αποτυπώνεται καλύτερα στο Hypercard, το οποίο έδωσε για πρώτη φορά τη δυνατότητα σε απλούς χρήστες να φτιάξουν τις δικές τους εφαρμογές πολυμέσων και υπερκειμένου."
         'title "Bill Atkinson "
         'license_text "Bill Atkinson ")

   "atm-affective"
   (hash 'image_url "/images/atm-affective.png"
         'caption "Τα πειράματα με εναλλακτικές διαρρυθμίσεις των πλήκτρων σε ένα απλό τραπεζικό ATM έδειξαν ότι ακόμη και αν δεν υπάρχει ουσιαστική διαφορά στην πραγματική απόδοση της διάδρασης, οι χρήστες αντιλαμβάνονται κάποια διαφορά, η οποία μπορεί να ερμηνευθεί από τη σκοπιά της αισθητικής."
         'title "Αισθητική και ευχρηστία "
         'license_text "ACM")

   "augmentation-typewriter"
   (hash 'image_url "/images/augmentation-typewriter.jpg"
         'caption "Η επαύξηση της ανθρώπινης σκέψης με τη συνδρομή κάποιου εργαλείου είναι μια πολύ δυνατή ιδέα, αλλά, ταυτόχρονα, είναι κάπως δύσκολο να την μοιραστούμε γιατί δεν υπάρχουν πολλά πετυχημένα παραδείγματα. Για αυτόν τον σκοπό, ο Douglas Engelbart συνήθιζε να κάνει ένα πείραμα ως αναλογία, στο οποίο ζητούσε από τους συνομιλητές του να γράψουν το ίδιο κείμενο με μια γραφομηχανή, με ένα στυλό, και, τέλος, με ένα στυλό δεμένο με ένα τούβλο. "
         'title "Επαύξηση της ταχύτητας συγγραφής κειμένου "
         'license_text "Doug Engelbart Institute ")

   "baby-duck-syndrome"
   (hash 'image_url "/images/baby-duck-syndrome.jpg"
         'caption "Όπως οι μικρές πάπιες ακολουθούν όποιον δουν πρώτα λίγο καιρό μετά την γέννηση τους, έτσι και οι χρήστες διαδραστικών συστημάτων αναπτύσουν μια οικειότητα με ένα από τα πρώτα συστήματα που έμαθαν να χρησιμοποιούν και πλέον είναι αρνητικοί απέναντι σε βελτιωμένα ή εναλλακτικά συστήματα. "
         'title "Το σύνδρομο της μικρής πάπιας "
         'license_text "wikimedia")

   "basic-language"
   (hash 'image_url "/images/basic-language.png"
         'caption ""
         'title "BASIC και μίκρο-υπολογιστές"
         'license_text "wikimedia")

   "bbc-micro"
   (hash 'image_url "/images/bbc-micro.jpg"
         'caption "To Βρετανικό κρατικό τηλεοπτικό δίκτυο BBC πιστό στο όραμα του να προσφέρει εκπαιδευτικά προγράμματα για όλες τις βαθμίδες εκπαίδευσης και με όλα τα διαθέσιμα μέσα επικοινωνίας, χρηματοδότησε την κατασκευή ενός μικροϋπολογιστή που θα ήταν διαθέσιμος σε όλα τα σχολεία πρωτοβάθμιας εκπαίδευσης μαζί με συνοδευτικά βιβλία, λογισμικό και τηλεοπτικά προγράμματα. "
         'title "BBC Micro "
         'license_text "")

   "bbs"
   (hash 'image_url "/images/bbs.png"
         'caption "Τα δημοφιλή συστήματα συνεργασίας των χρηστών μέσω υπολογιστή είναι τόσο παλιά όσο και οι πρώτοι οικιακοί μίκρο-υπολογιστές με δυνατότητα δικτύωσης μέσω τηλεφώνου, όπου η συνεργασία γινόταν με τα BBS."
         'title "Bulletin Board System "
         'license_text "blogtoexpress ")

   "bell-nomograph"
   (hash 'image_url "/images/bell-nomograph.png"
         'caption "Ο ερευνητής της επιστήμης των υπολογιστών Gordon Bell έφτιαξε το 2002 ένα διάγραμμα που δείχνει πόσο διαφορετικοί είναι οι υπολογιστές και τα δημογραφικά των χρηστών ανάλογως τη δεκαετία που εμφανίστηκαν. Επιπλέον, δείχνει πως οι χρήσεις του υπολογιστή διαφέρουν και πως με εξαίρεση τα πρώτα μηχανήματα τα πιο σύγχρονα συστήματα δεν χρησιμοποιούνται τόσο για υπολογισμούς, όσο για άλλες χρήσεις, όπως είναι η πληροφόρηση, η επικοινωνία, και η ψυχαγωγία."
         'title "Το νομογράφημα του Gordon Bell "
         'license_text "")

   "blit-terminal"
   (hash 'image_url "/images/blit-terminal.jpg"
         'caption "Το πρώτο τερματικό γραφικών για το UNIX με έμπνευση από το Xerox Alto οργανώνει την οθόνη εικονοστοιχείων σε παράθυρα που μπορούν να προβάλλουν έναν εξομοιωτή τερματικού για την σύνδεση με έναν μίνι-υπολογιστή, ή γραφικές εφαρμογές, τα οποία αλληλεπιδρούν με το πληκτρολόγιο και το ποντίκι. Καθώς το UNIX τότε δεν ήταν ευρέως διαθέσιμο και τα περισσότερα προγράμματα βασίζονταν στην γραμμή εντολών που είχε από την αρχή, τελικά τα γραφικά χρησιμοποιούνται κυρίως για την οργάνωση πολλών τερματικών κειμένου."
         'title "Τερματικό γραφικών Blit "
         'license_text "")

   "book-making"
   (hash 'image_url "/images/book-making.jpg"
         'caption ""
         'title "Κατασκευή του βιβλίου σε τερματικό "
         'license_text "Konstantinos Chorianopoulos ")

   "breakout"
   (hash 'image_url "/images/breakout.png"
         'caption "Το βιντεοπαιχνίδι Breakout πήρε έμπνευση από το Pong, το οποίο παίζεται με δύο παίκτες και στη θέση του δεύτερου παίκτη έβαλε σειρές από τουβλάκια που σπάνε, καθώς ο παίκτης τα χτυπάει με την μπάλα. Εκτός από τη διασκέδαση και την έμπνευση που έδωσε για τη δημιουργία νέων συστημάτων διάδρασης, αποτελεί σημείο αναφοράς για τη μετάβαση από τα βιντεοπαιχνίδια προσομοίωσης της πραγματικότητας σε ένα περισσότερο αφαιρετικό νέο είδος τέχνης. "
         'title "Breakout "
         'license_text "Wikimedia")

   "buck"
   (hash 'image_url "/images/buck.png"
         'caption "Στη φάση της μετάβασης από τα αρχικά προσχέδια σε λειτουργικά πρωτότυπα υπάρχει πολύ μεγάλη ασάφεια αναφορικά με το λογισμικό και το υλικό, ειδικά στις περιπτώσεις που έχουμε νέες συσκευές, όπως ένα έξυπνο κινητό ή άλλες συσκευές διάχυτου υπολογισμού. Το πρωτότυπο υψηλής πιστότητας τύπου Buck γεφυρώνει αυτήν την μετάβαση με τη δημιουργική επαναχρησιμοποίηση υλικού και λογισμικού που ήδη υπάρχει, ακόμη και αν αυτά δεν θα είναι ίδια στο τελικό προϊόν, αρκεί να είναι αντιπροσωπευτικά της διάδρασης."
         'title "Buck prototype "
         'license_text "")

   "c64-demoscene"
   (hash 'image_url "/images/c64-demoscene.jpg"
         'caption "Η προσιτή τιμή του μικρο-υπολογιστή Commodore 64 τον έκανε δημοφιλή σε περισσότερο από δέκα εκατομύρια χρήστες, οι οποίοι, εκτός από την αγορά λογισμικού και περιφερειακών, δημιούργησαν μια κοινότητα ερασιτεχνικής δημιουργίας και ανταλλαγής προγραμμάτων και παιχνιδιών, που διατηρήθηκε ως μέρος της ψηφιακής κουλτούρας και μετά την απόσυρση αυτού του μοντέλου. "
         'title "Commodore64 demoscene "
         'license_text "Wikimedia ")

   "cad"
   (hash 'image_url "/images/cad.jpg"
         'caption "Μετά την επεξεργασία κειμένου, καθώς οι υπολογιστές είχαν γίνει ήδη αρκετά γρήγοροι για να επεξεργάζονται και να απεικονίζουν γραφικά, μεταφέρθηκαν στον υπολογιστή και οι διαδικασίες της σχεδίασης και της επεξεργασίας εικόνας. Τα νέα πλεονεκτήματα ήταν η ευκολία στις αλλαγές και η παραμετροποίηση πάνω σε έτοιμα μοτίβα."
         'title "Σχεδίαση Γραφικών με Υπολογιστή "
         'license_text "")

   "canon-cat-mockup"
   (hash 'image_url "/images/canon-cat-mockup.jpg"
         'caption "Το φυσικό υπόδειγμα για το Canon Cat ονομάστηκε έτσι μάλλον γιατί δεν χρειαζόταν ποντίκι για την διάδραση και επιπλέον έμοιαζε με μια γάτα που κάθεται δίπλα σε έναν συγγραφέα που θα γράψει το επόμενο δημιούργημα του με μια συσκευή εστιασμένη σε αυτόν τον σκοπό, χωρίς λειτουργικό σύστημα, εφαρμογές, και αρχεία που δυσκολεύουν τον χρήστη."
         'title "Φυσικό υπόδειγμα για το Canon Cat"
         'license_text "wikimedia")

   "canon-cat"
   (hash 'image_url "/images/canon-cat.jpg"
         'caption ""
         'title "Canon Cat"
         'license_text "wikimedia")

   "canvas"
   (hash 'image_url "/images/canvas.jpg"
         'caption "Ο εντοπισμός μιας ανθρώπινης ανάγκης βασίζεται σε μια αρχική υπόθεση, η οποία αλλάζει συνέχεια μέσα από επαναληπτικές δοκιμές με τους πιθανούς αποδέκτες και η οποία περιλαμβάνει μια περιγραφή όλων των παραγόντων που επηρεάζουν την παραγωγή και διανομή της νέας υπηρεσίας. Η κατασκευή της διάδρασης επηρεάζει τον χρήστη και απαιτεί κάποιες επιχειρηματικές προδιαγραφές, οι οποίες με την σειρά τους επηρεάζουν την σχεδίαση."
         'title "Χαρτογράφηση επιχειρηματικών μοντέλων "
         'license_text "")

   "card-puncher"
   (hash 'image_url "/images/card-puncher.jpg"
         'caption "Τα συστήματα διάτρησης κάρτας υπάρχουν από τον 19ο αιώνα, με βασικές εφαρμογές τον προγραμματισμό και την αποθήκευση δεδομένων για μηχανήματα πλεξίματος και αναπαραγωγής μουσικής, οπότε υπήρχε η τεχνογνωσία για την προσαρμογή τους ως συσκευές εισόδου στους πρώτους κεντρικούς ηλεκτρονικούς υπολογιστές. "
         'title "Μηχάνημα διάτρησης κάρτας "
         'license_text "wikimedia")

   "cern-line-mode-browser"
   (hash 'image_url "/images/cern-line-mode-browser.png"
         'caption "Η αρχική πειραματική εφαρμογή περιήγησης και επεξεργασίας εγγράφων στον παγκόσμιο ιστό είχε ήδη δημιουργηθεί για τους υπολογιστές NeXT, αλλά δεν ήταν εφικτό να μεταφερθεί και να εκτελεστεί στα δημοφιλή επιτραπέζια συστήματα εκείνης της εποχής. Για αυτόν τον σκοπό αναπτύχθηκε μια απλούστερη εκδοχή για τον περιηγητή μόνο για την γραμμή εντολών, η οποία θεωρείται μια καθολική και διαχρονική διεπαφή με τον χρήστη. Επιπλέον, η εφαρμογή βασίζεται στην βιβλιοθήκη προγραμματισμού libwww, η οποία θα αποτελέσει σημείο αναφοράς για την δημιουργία πολλών μελλοντικών περιηγητών του παγκόσμιου ιστού, όπως ο NCSA Mosaic."
         'title "Ο πρώτος περιηγητής ιστοσελίδων για την γραμμή εντολών"
         'license_text "CC-BY-SA 4.0")

   "cern-www-editor"
   (hash 'image_url "/images/cern-www-editor.png"
         'caption "Η εφαρμογή WorldWideWeb (Nexus) παρέχει τόσο πλοήγηση όσο και επεξεργασία των εγγράφων στον παγκόσμιο ιστό. Κατασκευάστηκε στο σύστημα NeXT, το οποίο είχε πολυμεσικές και αντικειμενοστραφείς δυνατότητες και χρειάστηκε να περάσουν αρκετά χρόνια ώστε να δημιουργηθούν παρόμοιες εφαρμογές για τα πιο δημοφιλή επιτραπέζια συστήματα τις δεκαετίας του 1990."
         'title "Η πρώτη εφαρμογή για τον παγκόσμιο ιστό "
         'license_text "Tim Berners Lee ")

   "chat-bot"
   (hash 'image_url "/images/chat-bot.jpg"
         'caption "Η μεγάλη αποδοχή και η οικειότητα που ανέπτυξαν οι χρήστες με τις εφαρμογές ανταλλαγής μηνυμάτων σε κινητές συσκευές έδωσε την ευκαιρία για την εισαγωγή εφαρμογών που χρησιμοποιούν τον διάλογο ως βασική διεπαφή με τον χρήστη, ο οποίος αντί να συμπληρώσει μια φόρμα, μπορεί να κάνει έναν διάλογο ώστε να αγοράσει για παράδειγμα ένα εισιτήριο. "
         'title "Chat bot "
         'license_text "")

   "children-alto"
   (hash 'image_url "/images/children-alto.png"
         'caption ""
         'title "Παιδιά με το Xerox Alto"
         'license_text "the PARC Library")

   "chorded-input"
   (hash 'image_url "/images/chorded-input.jpg"
         'caption "Το πληκτρολόγιο ακόρντων επιτρέπει την είσοδο 31 διαφορετικών κωδικών που καλύπουν όλο το λατινικό αλφάβητο ή μπορούν να αντιστοιχούν σε τροπικές κεντολές. Σε συνδυασμό με μια αποδοτική συσκευής επιλογής στόχων στην οθόνη, δεν υπάρχει ανάγκη για το παραδοσιακό πληκτρολόγιο, ειδικά για τη συχνή διεργασία της απλής επεξεργασίας έτοιμου κειμένου. Αν και είχε ήδη χρησιμοποιηθεί στο παρελθόν στον τηλέτυπο και στην συντομογραφία, ο συνδυασμός με το ποντίκι έχει το εργονομικό πλεονέκτημα ότι ο χρήστης δεν χρειάζεται να μετακινήσει τα χέρια του. "
         'title "Επεξεργασία κειμένου και εντολές με ακόρντα "
         'license_text "Wikipedia ")

   "chorded-keyboard"
   (hash 'image_url "/images/chorded-keyboard.jpg"
         'caption "Το πληκτρολόγιο ακόρντων χρησιμοποιήθηκε στο σύστημα NLS για την επιλογή εντολών σε συνδυασμό με το ποντίκι που οδηγούσε ένα σημείο στην οθόνη γραφικών. Αν και είχε ήδη χρησιμοποιηθεί στο παρελθόν στον τηλέτυπο και στην συντομογραφία, ο συνδυασμός με μια δεύτερη συσκευή εισόδου όπως το ποντίκι έχει το εργονομικό πλεονέκτημα ότι ο χρήστης δεν χρειάζεται να μετακινήσει τα χέρια του. "
         'title "Πληκτρολόγιο ακόρντων "
         'license_text "Wikipedia ")

   "classroom"
   (hash 'image_url "/images/classroom.jpg"
         'caption "Ο τρόπος που είναι οργανωμένη μια αίθουσα διδασκαλίας συνήθως ανταποκρίνεται στον τρόπο που είναι οργανωμένη η οικονομική παραγωγή, οπότε διαπιστώνουμε ότι η ιεραρχικά δομημένη, παραδοσιακή αίθουσα διδασκαλίας αντικατοπτρίζει το τρέχον μοντέλο οργάνωσης της παραγωγής, που όμως σήμερα βρίσκεται σε μεταβατικό στάδιο."
         'title "Χωρική οργάνωση σχολικής αίθουσας "
         'license_text "")

   "colobot"
   (hash 'image_url "/images/colobot.png"
         'caption "Το εκπαιδευτικό βιντεοπαιχνίδι Colobot στοχεύει στην διδασκαλία αντικειμενοστραφών γλωσσών προγραμματισμού όπως είναι η C++ και η Java με τρόπο διασκεδαστικό. Για τον σκοπό αυτό ο χρήστης πρέπει να προγραμματίσει ρομπότ που εκτελούν εργασίες αυτόνομα ή σε συνεργασία. Η αρχική έμπνευση για αυτό το λογισμικό έρχεται από το Robot Odyssey με την διαφορά ότι ο χρήστης προγραμματίζει σε γλώσσα υψηλού επιπέδου, αντί για την λογική των ηλεκτρονικών κυκλωμάτων. "
         'title "Colobot"
         'license_text "")

   "commodore-pet"
   (hash 'image_url "/images/commodore-pet.jpg"
         'caption "Ο Commodore PET ανήκει στους μικρούπολογιστές με βασικό τρόπο διάδρασης την γλώσσα BASIC, αλλά θεωρείται και ο πρώτος ολοκληρωμένος προσωπικός υπολογιστής, γιατί ήταν διαθέσιμος σε ενιαία μορφή, με ενσωματωμένο κασετόφωνο στην αρχική έκδοση. Όπως οι πρώτοι κεντρικοί υπολογιστές, έτσι και ο PET, χρησιμοποιήθηκε για την εκτέλεση και ανάπτυξη βίντεοπαιχνιδιών.  "
         'title "Commodore Pet"
         'license_text "Classic Computers ")

   "computer-lab"
   (hash 'image_url "/images/computer-lab.jpg"
         'caption "Η προσιτή τιμή των πρώτων μικρουπολογιστών επέτρεψε την διάδοση τους σε πολλά σπίτια, αλλά και σχολεία, όπου δημιουργήθηκε ένας διακριτός χώρος για τις εκπαιδευτικές δραστηριότητες που γίνονταν μαζί με τον υπολογιστή. Η έννοια του εργαστηρίου υπολογιστών διατηρεί ακόμη και στην σύγχρονη εποχή των προσωπικών φορητών υπολογιστών την αξία της, αφού υπάρχουν μορφές υπολογιστές, όπου κάποιοι δεν θέλουν ή δεν μπορούν να έχουν πρόσβαση. "
         'title "Σχολικό εργαστήριο υπολογιστών "
         'license_text "")

   "cpm"
   (hash 'image_url "/images/cpm.png"
         'caption "Το πρώτο λειτουργικό σύστημα για μίκρο-υπολογιστές έγινε αμέσως πολύ δημοφιλές γιατί επέτρεπε στους προγραμματιστές να αναπτύξουν τις εφαρμογές τους ανεξάρτητα από τις αρχιτεκτονικές λεπτομέρειες της συμβολικής γλώσσας μηχανής. Το CPM βασιζόταν σε ένα ξεχωριστό επίπεδο BIOS, ώστε να διαχωρήσει το λογισμικό του συστήματος διαχείρισης αρχείων από τις λεπτομέρειες του υλικού συστήματος εισόδου και εξόδου."
         'title "Control Program for Microcomputers "
         'license_text "Wikepdia")

   "crowdsourcing"
   (hash 'image_url "/images/crowdsourcing.jpg"
         'caption "Η διάδραση σε μεγάλη κλίμακα μπορεί να χρησιμοποιηθεί για να λύσει δύσκολα προβλήματα, τα οποία οι υπολογιστές δεν μπορούν να τα αντιμετωπίσουν από μόνοι τους, όπως είναι η αναγνώριση αντικειμένων σε μια φωτογραφία."
         'title "Πληθοπορισμός "
         'license_text "Carnegie Mellon University")

   "damocles-sword"
   (hash 'image_url "/images/damocles-sword.jpg"
         'caption "Tο Σπαθί του Δαμοκλή θεωρείται μια θεμελιώδης τεχνολογία για τη δημιουργία της εικονικής πραγματικότητας, όπου τα γραφικά στην οθόνη ακολουθούν την κίνηση του κεφαλιού. Το αρχικό σύστημα βασιζόταν στην προβολή βίντεο από μια βιντεοκάμερα που βρισκόταν στη βάση ενός ελικοπτέρου έτσι ώστε να διευκολύνει την προσγείωση σε δύσκολες συνθήκες."
         'title "Γραφικά που ακολοθούν την κίνηση του βλέματος "
         'license_text "Ivan Shutherland")

   "dartmouth-basic"
   (hash 'image_url "/images/dartmouth-basic.jpg"
         'caption ""
         'title "Dartmouth Basic "
         'license_text "Dartmouth ")

   "dataland"
   (hash 'image_url "/images/dataland.jpg"
         'caption "Στο ερευνητικό έργο Spatial Data Management System η πλοήγηση σε πολυμεσική πληροφορία μπορεί να γίνει με μια μεταφορά που βασίζεται στην πλοήγηση στο φυσικό περιβάλλον με την προσθήκη της δυνατότητας μεγέθυνσης και μιας ιεαραρχικής οργάνωσης των δεδομένων. Ο χρήστης πλοηγείται με τα ενσωματωμένα σε μια καρέκλα χειριστήρια και χρησιμοποιεί συμπληρωματικές οθόνες, οι οποίες μπορούν να μεγενθύνουν και να εφαρμόσουν εργαλεία πάνω στα πολυμεσικά δεδομένα."
         'title "Χωρική διεπαφή Dataland "
         'license_text "MIT Media Lab")

   "defender-arcade"
   (hash 'image_url "/images/defender-arcade.jpg"
         'caption "Το βιντεοπαιχνίδι Defender είχε μια από τις πρώτες δημοφιλείς τεχνολογίες πλευρικής κίνησης του αεροσκάφους σε ψηφιακό χώρο που εκτείνεται πέρα από το μέγεθος της οθόνης. Για τον χειρισμό του αεροσκάφους χρησιμοποιήθηκε ένας μοχλός με κίνηση μόνο κάθετη, ενώ είχε ξεχωριστό πλήκτρο για την ώθηση, έτσι ώστε να είναι περισσότερο οικείο με την εμπειρία χρήσης των Space War, Space Invaders."
         'title "Defender "
         'license_text "")

   "desktop-interaction-history-future"
   (hash 'image_url "/images/desktop-interaction-history-future.png"
         'caption "Η διαχρονική αξία της διάδρασης αποτυπώνεται στην περίπτωση του επιτραπέζιου υπολογιστή, ο οποίος -αν και έχει εξελιχθεί τεχνολογικά σε πολλές τάξεις μεγέθους- στον προγραμματισμό της διάδρασης έχει παραμείνει παρόμοιος, επειδή ο άνθρωπος δεν άλλαζει το ίδιο γρήγορα και εύκολα με τις μηχανές."
         'title "Η τεχνολογική εξέλιξη των επιτραπέζιων υπολογιστών "
         'license_text "")

   "desktop"
   (hash 'image_url "/images/desktop.jpg"
         'caption "Ο επιτραπέζιος υπολογιστής καθορίζει έμμεσα με τη μορφή του ένα συγκεκριμένο πλαίσιο χρήσης και αντίστοιχα τις εφαρμογές και τις διαδικασίες του χρήστη, οι οποίες, συνήθως, σχετίζονται με το περιβάλλον του γραφείου και την αξία της παραγωγικότητας."
         'title "Επιτραπέζιος Υπολογισμός "
         'license_text "Xerox")

   "deutsch-limit"
   (hash 'image_url "/images/deutsch-limit.png "
         'caption "Οι οπτικές γλώσσες προγραμματισμού έχουν προσελκύσει πολλές προσπάθειες ανάπτυξης και βελτίωσης, αλλά υποφέρουν από το πρόβλημα της πυκνότητας της πληροφορίας. Πράγματι, μια συμβατική επιτραπέζια οθόνη δεν μπορεί να απεικονίσει περισσότερα από πενήντα οπτικά αντικείμενα, το οποίο αναφέρεται ως φράγμα του Deutsch, ο οποίος το παρατηρήσε σε μια παρουσίαση ενός νέου εργαλείου οπτικού προγραμματισμού. "
         'title "Το φράγμα Deutsch στις οπτικές γλώσσες προγραμματισμού"
         'license_text "Public Domain")

   "digital-desk"
   (hash 'image_url "/images/digital-desk.jpg"
         'caption "Το σύστημα Digital Desk δημιουργήθηκε είχε στόχο να φέρει πάνω στο τραπέζι τις δυνατότητες διάδρασης μεταξύ του ψηφιακού και φυσικού κόσμου, ακριβώς δηλαδή, το αντίθετο από την κατεύθυνση που ακολουθεί ο επιτραπέζιος υπολογισμός με την γραφική επιφάνεια εργασίας."
         'title "Ψηφιακά επαυξημένο γραφείο "
         'license_text "University of Cambridge")

   "doom-construction-kit"
   (hash 'image_url "/images/doom-construction-kit.png"
         'caption "Το βιντεοπαιχνίδι Doom ήταν ένα από τα πρώτα δημοφιλή βιντεοπαιχνίδια που επέτρεψαν τις προσθήκες και τις αλλαγές στις πίστες μέσω ανοιχτών αρχείων. Αν και οι περισσότερες εταιρείες λογισμικού προστάτευαν τόσο τον κώδικα όσο και τα δεδομένα των εφαρμογών τους, η πρωτοβουλία αυτή ενθάρρυνε τη δημιουργία μιας κοινότητας κατασκευής εργαλείων και αρχείων για την υποστήριξη του βιντεοπαιχνιδιού."
         'title "Επεξεργαστής χαρτογραφίας για το βιντεοπαιχνίδι Doom "
         'license_text "MIT License ")

   "double-click"
   (hash 'image_url "/images/double-click.jpg"
         'caption "Η δημιουργία των παραθύρων που καλύπτει το ένα το άλλο δημιούργησε την ανάγκη για έναν διακριτό τρόπο ανοίγματος και κλεισίματος ενός παραθύρου. Με το μόνο κλικ ο χρήστης φέρνει ένα παράθυρο στο μπροστά μέρος της οθονης και με το διπλό κλικ το ανοίγει ή το κλείνει στην μπάρα στο κάτω μέρος της οθόνης. "
         'title "Διπλό κλίκ "
         'license_text "")

   "dtp"
   (hash 'image_url "/images/dtp.jpg"
         'caption "Η επεξεργασία ενός κειμένου ή η προετοιμασία μιας γραπτής αναφοράς με εικόνες είναι από τις πιο δημοφιλείς και διαχρονικές εργασίες που διευκολύνονται από τη χρήση υπολογιστή και από το κατάλληλο λογισμικό. Αρχικά γινόταν με συστήματα που βασίζονταν μόνο στον τηλέτυπο και στις εργασίες δέσμης, αλλά τελικά έγινε δημοφιλές με τα συστήματα γραφικής διεπαφής και σελιδοποίησης σε πραγματικό χρόνο."
         'title "Ψηφιακή Τυπογραφία "
         'license_text "")

   "dvorak-keyboard"
   (hash 'image_url "/images/dvorak-keyboard.png"
         'caption "Η επίτευξη της ευχρηστίας δεν είναι η μόνη απόλυτη αξία, καθώς μια συσκευή διάδρασης επηρεάζεται από πολλούς ακόμη παράγοντες, όπως από την αισθητική, το κόστος αλλά και από τη συνήθεια, η οποία είναι η κύρια αιτία για το ότι το πιο συνηθισμένο πληκτρολόγιο για τον επιτραπέζιο υπολογιστή δεν είναι το πιο εύχρηστο. Η οργάνωση των πλήκτρων κάτω από τα δάκτυλα στο πληκτρολόγιο Dvorak έχει γίνει έτσι, ώστε τα πιο συχνά γράμματα να βρίσκονται πιο κοντά στα δάκτυλα."
         'title "Πληκτρόλογιο Dvorak"
         'license_text "Public domain ")

   "dynabook-mockup"
   (hash 'image_url "/images/dynabook-mockup.jpg"
         'caption "Η κατασκευή ενός φυσικού υποδείγματος με χαρτόνι για το όραμα του Dynabook επιτρέπει στον σχεδιαστή να πειραματιστεί με την εργονομία της συσκευής. Η διαδικασία της κατασκευής εκτός από τις διαστάσεις και τον όγκο επιτρέπει την εξερεύνηση και του βάρους βάζοντας συμπαγές μολύβι μέσα στο κουτί. Στα επόμενα στάδια της κατασκευής το κουτί μπορεί σταδιακά να φτιαχτεί με άλλα υλικά και να περιλαμβάνει κάποιες από τις συσκευές εισόδου και εξόδου."
         'title "Φυσικό υπόδειγμα για το Dynabook"
         'license_text "wikimedia")

   "dynabook-sketch"
   (hash 'image_url "/images/dynabook-sketch.png"
         'caption ""
         'title "Προσχέδιο οράματος για το Dynabook"
         'license_text "wikimedia")

   "dynabook-spacewar"
   (hash 'image_url "/images/dynabook-spacewar.jpg"
         'caption "Η βασική εφαρμογή που οδήγησε τον σχεδιασμό του Dynabook ήταν το βιντεοπαιχνίδι Spacewar, το οποίο εκείνη την εποχή ήταν σημείο αναφοράς για όλους τους ερευνητές που είχαν πρόσβαση σε έναν κεντρικό υπολογιστή. Όπως ακριβώς οι ερευνητές υλοποιούσαν, έπαιζαν και έκαναν μετατροπές στον πηγαίο κώδικα του Spacewar, έτσι και οι χρήστες του Dynabook θα μπορούσαν να έχουν πρόσβαση σε ένα νέο μέσο επικοινωνίας και έκφρασης. "
         'title "Παιδιά παίζουν το Spacewar στο Dynabook "
         'license_text "Alan Kay")

   "easter-egg"
   (hash 'image_url "/images/easter-egg.png"
         'caption "Σε μια εποχή που το λογισμικό κατασκευάζεται και μοιράζεται είτε ανώνυμα, είτε κάτω από το λογότυπο μιας μεγάλης εταιρειάς, ο σχεδιαστής του Atari Adventure επιλέγει να κάνει δημόσια την ταυτότητα του σε ένα ένα κρυφό δωμάτιο του παιχνιδιού. Η τεχνική αυτή θα χρησιμοποιηθεί στο εξής από πολλούς κατασκευαστές λογισμικού ακόμη και πέρα από την ψυχαγωγία, όχι τόσο για την ταυτότητα τους, αλλά για πρόσθετες λειτουργίες ή απλά ως αστείο.  "
         'title "Easter Egg "
         'license_text "")

   "eclipse-ide"
   (hash 'image_url "/images/eclipse-ide.png"
         'caption "Ένα δημοφιλές περιβάλλον ανάπτυξης ανοικτού κώδικα είναι το Eclipse, το οποίο χρησιμοποιεί την επιτραπέζια γραφική διεπαφή για να ολοκληρώσει σε μια εφαρμογή χρήσιμα εργαλεία, όπως είναι ο επεξεργαστής κειμένου, η αυτόματη μορφοποίηση και η συμπλήρωση κώδικα, ο αποσφαλματωτής και η υποστήριξη για διαφορετικές γλώσσες προγραμματισμού. Η αρχική διευκόλυνση που παρέχουν τα ολοκληρωμένα περιβάλλοντα ανάπτυξης περιορίζει την ευελιξία, ενώ παρόμοια λειτουργικότητα είναι εφικτή με χειροκίνητο τρόπο σε απλά εργαλεία όπως τα Vim, GNU Emacs."
         'title "Ολοκληρωμένο περιβάλλον ανάπτυξης Eclipse "
         'license_text "Eclipse Public License ")

   "ed-editor"
   (hash 'image_url "/images/ed-editor.jpg"
         'caption "Ο επεξεργαστής κειμένου ED λειτουργεί σε επίπεδο γραμμής, γιατί αναπτύχθηκε σε ένα περιβάλλον χρήστη, στο οποίο η βασική συσκευή εισόδου και εξόδου είναι ο τηλέτυπος. Αν και δεν είναι εύχρηστος, παραμένει, από τη δημιουργία του συστήματος UNIX, ο βασικός επεξεργαστής κειμένου, καθώς είναι απλός στην υλοποίηση και συμβατός με τις γλώσσες προγραμματισμού σε γραμμή εντολών. "
         'title "Επεξεργαστής κειμένου γραμμής ED "
         'license_text "Wikimedia ")

   "electrocular"
   (hash 'image_url "/images/electrocular.jpg"
         'caption "Η προβολή βίντεο πάνω σε έναν διάφανο φακό που βρίσκεται στερεωμένος σε ένα κράνος πιλότου ελικοπτέρου χρησιμοποιήθηκε από τον στρατό για να διευκολύνει την προσγείωση ελικοπτέρων με τη βοήθεια κάμερας, σε δύσκολες συνθήκες. Αυτό το σύστημα επεκτάθηκε τα επόμενα χρόνια ώστε, αντί για βίντεο, να προβάλει γραφικά, τα οποία μετασχηματίζονταν ανάλογα με την κίνηση του κεφαλιού."
         'title "Electrocular "
         'license_text "ARPA")

   "electronics"
   (hash 'image_url "/images/electronics.jpg"
         'caption "Η κατασκευή ηλεκτρονικών κυκλωμάτων είναι μια εξειδικευμένη εργασία και απαιτεί ειδικές δεξιότητες, αλλά υπάρχουν πολλά εργαλεία που μειώνουν τα εμπόδια χρήσης αυτής της τεχνολογίας υλικού, ακόμη και για αρχάριους χρήστες."
         'title "Εύχρηστα ηλεκτρονικά κυκλώματα με χαρτί και αυτοκόλητα "
         'license_text "")

   "elements"
   (hash 'image_url "/images/elements.jpg"
         'caption "Τα διαφορετικά επίπεδα και οι ζώνες σχεδίασης της εμπειρίας του χρήστη παρέχουν μια άριστη επισκόπηση της σύνθεσης των θεμάτων της διάδρασης με τα θέματα του περιεχομένου."
         'title "Εμπειρία του χρήστη και πολυμέσα "
         'license_text "")

   "eliza-chat-bot"
   (hash 'image_url "/images/eliza-chat-bot.jpg"
         'caption "Το διαδραστικο σύστημα ELIZA βασίζεται στον διάλογο με τον χρήστη σε φυσική γλώσσα και έγινε πολύ δημοφιλές με ένα σενάριο, στο οποίο ο υπολογιστής παριστάνει τον ψυχολόγο. Αν και δημιουργήθηκε για να δείξει τους περιορισμούς στην κατανόηση της φυσικής γλώσσας από τους υπολογιστές, πολλοί χρήστες προτίμησαν να πιστέψουν ότι μιλάνε με κάποιον που τους καταλαβαίνει. "
         'title "ELIZA chat bot "
         'license_text "wikimedia")

   "emacs-ide"
   (hash 'image_url "/images/emacs-ide.png"
         'caption "Ο επεξεργαστής κειμένου GNU Emacs επιτρέπει την επέκτασή του με τη γλώσσα προγραμματισμού LISP και οργανώνει τα δεδομένα σε παράλληλους αποθηκευτικούς χώρους, οι οποίοι μπορούν να εμφανίζονται επιλεκτικά στην οθόνη του χρήστη. Με αυτόν τον τρόπο, έχουν αναπτυχθεί επεκτάσεις για πολλές εφαρμογές, όπως η ηλεκτρονική αλληλογραφία, η πλοήγηση στην πληροφορία και η κατασκευή λογισμικού σε ολοκληρωμένο περιβάλλον ανάπτυξης. "
         'title "Ολοκληρωμένο περιβάλλον ανάπτυξης σε Emacs "
         'license_text "Wikipedia ")

   "emulators"
   (hash 'image_url "/images/emulators.jpg"
         'caption "Ο εξομοιωτής σε ένα σύγχρονο γραφικό περιβάλλον μπορεί να εκτελέσει το λογισμικό για ένα παλιότερο γραφικό περιβάλλον, το οποίο με τη σειρά του μπορεί να εκτελέσει έναν εξομοιωτή για ένα ακόμη παλιότερο σύστημα με γραμμή εντολών. Με αυτόν τον τρόπο, μπορούμε να εξομοιώσουμε ένα παλιότερο σύστημα ακόμη και αν δεν έχουμε εξομοιωτή για αυτό, αρκεί να έχουμε για μια σειρά από ενδιάμεσα συστήματα. Το ιδανικό είναι να εκμεταλλευτούμε αυτήν την τεχνική για νέα συστήματα και όχι μόνο για την αναβίωση των παλιότερων."
         'title "Εξομοιωτές παλαιότερων συστημάτων "
         'license_text "wikimedia")

   "engelbart-mouse"
   (hash 'image_url "/images/engelbart-mouse.jpg"
         'caption "Το αρχικό πρωτότυπο για το ποντίκι είναι ακριβώς το ίδιο μορφολογικά με τις αντίστοιχες συσκευές που παράγονται με μεγάλη επιτυχία πενήντα χρόνια μετά, αν και, φυσικά, έχουν βελτιωθεί πολλές επιμέρους λειτουργικές ιδιότητές του. Οι δύο τροχοί κύλισης δεν επιτρέπουν τη διαγώνια κίνηση, αλλά αυτό δεν είναι μεγάλο πρόβλημα, αφού η χρήση του εστιάζεται, κυρίως, στην επεξεργασία κειμένου. Η συσκευή αυτή είναι μια σημαντική καινοτομία γιατί διαφέρει σημαντικά από παρόμοιες συσκευές και γιατί επέτρεψε τη διεξαγωγή πειραμάτων, τα οποία απέδειξαν την υπεροχή του έναντι των εναλλακτικών συσκευών εισόδου. "
         'title "Αρχικό υπόδειγμα για το ποντίκι "
         'license_text "Wikipedia ")

   "engelbart-profile"
   (hash 'image_url "/images/engelbart-profile.jpg"
         'caption "Το έργο του Douglas Engelbart θεμελίωσε τη συνεργατική και διαδραστική χρήση των πληροφοριακών συστήματων, αλλά το όραμα για την επαύξηση της ανθρώπινης νοημοσύνης με πολύπλοκα συστήματα διάδρασης αντικαταστάθηκε από τη βολικότητα της καθημερινής ευχρηστίας. "
         'title "Douglas Engelbart "
         'license_text "Doug Engelbart Institute ")

   "exams"
   (hash 'image_url "/images/exams.jpg"
         'caption "Η παραδοσιακή πρακτική των γραπτών εξετάσεων με κλειστά βιβλία είναι το αντίθετο της σύγχρονης κοινωνικής και οικονομικής πρακτικής όπου προσπαθούμε να μοιραστούμε όσο γίνεται περισσότερα από αυτά που ξέρουμε με στόχο τη συνεισφορά σε ένα σύνολο γνώσης και έργου."
         'title "Γραπτή ανταγωνιστική εξέταση μαθήματος "
         'license_text "")

   "facebook1"
   (hash 'image_url "/images/facebook1.jpg"
         'caption "Μία από τις αρχικές εκδοχές του κοινωνικού δικτύου Facebook δεν διέφερε πολύ από ένα απλό σύστημα βάσης δεδομένων με προφίλ χρηστών."
         'title "Αρχική έκδοση του thefacebook "
         'license_text "Facebook")

   "facebook2"
   (hash 'image_url "/images/facebook2.jpg"
         'caption "Μερικά χρόνια μετά την πρώτη έκδοσή του, η βασική ιδέα του Facebook παραμένει η ίδια, ενώ οι αλλαγές ακολουθούν το πνεύμα της εποχής (π.χ., ομοιόμορφη πρόσβαση σε οθόνες διαφορετικού μεγέθους responsive web design) και νέες λειτουργίες προστίθενται (π.χ., παιχνίδια, εφαρμογές, ειδήσεις, σελίδες για εταιρείες, κτλ.) για να κρατήσουν τους χρήστες όσο περισσότερη ώρα γίνεται στην υπηρεσία."
         'title "Τα κοινωνικά δίκτυα ως πλατφόρμες "
         'license_text "")

   "fitts-comparison"
   (hash 'image_url "/images/fitts-comparison.png"
         'caption ""
         'title "Συγκριτικές δοκιμές επιδόσεων για συσκευές εισόδου "
         'license_text "")

   "fitts-law"
   (hash 'image_url "/images/fitts-law.png"
         'caption ""
         'title "Ο νόμος του Fitts"
         'license_text "Wikimedia ")

   "frob-atari-apple2"
   (hash 'image_url "/images/frob-atari-apple2.jpg"
         'caption "Για την κατασκευή του λογισμικού της κονσόλας βιντεοπαιχνιδιών Atari 2600 μπορούσε να χρησιμοποιηθεί ο πολύ διαφορετικός οικειακός υπολογιστής Apple 2, ο οποίος ήταν συνδεδεμένος με την κάρτα ανάγνωσης της κονσόλας. Ο ρόλος του υπολογιστή ανάπτυξης σε αυτήν την περίπτωση είναι πολύ περιορισμένος, γιατί έχει διαφορετικές δυνατότητες γραφικών, αλλά μπορεί να χρησιμοποιηθεί για την συγγραφή του κώδικα και την αποσφαλμάτωση."
         'title "Κατασκευή λογισμικού για διαφορετικό υπολογιστή"
         'license_text "")

   "gem2"
   (hash 'image_url "/images/gem2.png"
         'caption ""
         'title "Η επιφάνεια εργασίας GEM "
         'license_text "wikimedia")

   "genesys"
   (hash 'image_url "/images/genesys.jpg"
         'caption "To σύστημα οπτικού προγραμματισμού Genesys απευθύνεται σε σχεδιαστές γραφικών κίνησης, οπότε βασίζεται στην οικεία για αυτούς πένα και σε λογισμικό σχεδίασης αντικειμένων. Παρουσιάζει καινοτόμες λειτουργίες διάδρασης, όπως είναι η χειρονομία για τη σχεδίαση μιας τροχιάς κίνησης, όπου εκτός από την ίδια την τροχιά καταγράφεται και ο ρυθμός. "
         'title "Genesys "
         'license_text "MIT")

   "geolocation-simulation"
   (hash 'image_url "/images/geolocation-simulation.png"
         'caption "Το iOS SDK περιλαμβάνει τη δυνατότητα προσομοίωσης της γεωγραφικής θέσης του χρήστη, γιατί η θέση του πάνω στον χάρτη είναι σημαντική είσοδος για πολλές κινητές εφαρμογές, οι οποίες μπορούν να αλλάξουν την πληροφορία στην οθόνη και να στείλουν ειδοποιήσεις."
         'title "Προσομοίωση γεωγραφικής θέσης "
         'license_text "Apple")

   "github-contributions"
   (hash 'image_url "/images/github-contributions.png"
         'caption "Η αναγνώριση της σχετικής συνεισφοράς σε ένα συνεργατικό έργο έχει μεγάλη σημασία, γιατί τα περισσότερα έργα και οι περισσότερες επαγγελματικές δραστηριότητες της σύγχρονης οικονομίας είναι συνεργατικά. Αντίστοιχα, οι ατομικές επιδόσεις σε επιμέρους μαθήματα δεν δίνουν μια αντιπροσωπευτική εικόνα των δεξιοτήτων ενός εκπαιδευόμενου."
         'title "Συνεισφορές σε κοινό έργο στο Github "
         'license_text "Github")

   "github-profile"
   (hash 'image_url "/images/github-profile.png"
         'caption "Το προφίλ ενός χρήστη στο αποθετήριο πηγαίου κώδικα δίνει μια εποπτική εικόνα της ποιότητας και της ποσότητας της συνεισφοράς του σε συνεργατικά έργα και μπορεί να αποτελέσει μοντέλο για τη βελτίωση της πιστοποίησης που δίνουν τα μαθήματα και οι σχολές."
         'title "Προφίλ χρήστη στο Github "
         'license_text "Github")

   "gmail-beta"
   (hash 'image_url "/images/gmail-beta.png"
         'caption "Στο λογισμικό διάδρασης η έννοια της έκδοσης βήτα (beta) έχει χάσει την αρχική της σημασία, με πιο χαρακτηριστικό παράδειγμα το Google Mail, το οποίο έφερε την ετικέτα βήτα για περισσότερο από πέντε χρόνια και ενώ είχε ήδη περισσότερα από εκατό εκατομμύρια χρήστες."
         'title "Βήτα έκδοση δικτυακού λογισμικού Gmail"
         'license_text "")

   "google-now"
   (hash 'image_url "/images/google-now.jpg"
         'caption "Οι έξυπνοι πράκτορες για τη διάδραση με τον χρήστη δεν είχαν μεγάλη αποδοχή όταν ήταν μέρος της σουίτας εφαρμογών γραφείου με το Microsoft ClipIt, όμως με την εισαγωγή τους στα έξυπνα κινητά τηλέφωνα μπορούν να φανούν περισσότερο χρήσιμοι καθώς έχουν περισσότερες πληροφορίες για το πλαίσιο δραστηριότητας του χρήστη, όπως την τοποθεσία, το ημερολόγιο, κρατήσεις για γεγονότα και μετακινήσεις, κτλ."
         'title "Έξυπνοι πράκτορες με επίγνωση πλαισίου "
         'license_text "")

   "google-search-weather"
   (hash 'image_url "/images/google-search-weather.png"
         'caption "Η καθιέρωση και η αποτελεσματικότητα της μηχανής αναζήτησης πληροφοριών οδήγησε στην σταδιακή ενσωμάτωση των πιο συχνών και τυποποιημένων αναζητήσεων σε μορφή μικρών εφαρμογών ως μέρος των αποτελεσμάτων αναζήτησης, έτσι ώστε ο χρήστης αντί να ανοίγει μια νέα εφαρμογή για τον καιρό να μπορεί να ανακτήσει αλλά και να εξερευνήσει τις επιμέρους παραμέτρους του καιρού στην σελίδα της αναζήτησης. "
         'title "Αυτόματη αναζήτηση στον καιρό "
         'license_text "")

   "google_assistant"
   (hash 'image_url "/images/google.jpg"
         'caption ""
         'title "Διάδραση με φυσική γλώσσα "
         'license_text "Creative Commons Attribution 2.0 Generic (CC BY 2.0)")

   "google_search_engine"
   (hash 'image_url "/images/google_search_engine.png"
         'caption "Η επιτυχία της μηχανής αναζήτησης της Google αποτελεί χαρακτηριστικό παράδειγμα της νέας φιλοσοφίας για την απλότητα των εφαρμογών στην αλληλεπίδραση με το χρήστη."
         'title "Μηχανή αναζήτησης Google "
         'license_text "")

   "grail-flow"
   (hash 'image_url "/images/grail-flow.jpg"
         'caption "Το πρώτο περιβάλλον οπτικού προγραμματισμού GRAIL (GRaphical Input Language) απευθύνεται σε επαγγελματίες, οι οποίοι δεν γνωρίζουν να γράφουν κώδικα, αλλά γνωρίζουν άριστα την ροή εργασίας της δουλειάς τους, οπότε μπορούν να την περιγράψουν σε ένα ευέλικτο διάγραμμα ροής στον υπολογιστή."
         'title "GRAIL οπτικός προγραμματισμός "
         'license_text "RAND")

   "hackathon"
   (hash 'image_url "/images/hackathon.jpg"
         'caption "Οι διαγωνισμοί τύπου hackathon ξεκίνησαν από τις εταιρείες νέας τεχνολογίας ως ένας τρόπος να παροτρύνουν το προσωπικό τους και εξωτερικούς συνεργάτες να αναπτύξουν έργα πολύ διαφορετικών κατευθύνσεων, αλλά στην πορεία έχουν αναδειχθεί και σε έναν αποτελεσματικό τρόπο προσλήψεων και δημιουργίας ομάδων."
         'title "Διαγωνισμός κατασκευαστικής καινοτομίας "
         'license_text "")

   "hackerspace"
   (hash 'image_url "/images/hackerspace.jpg"
         'caption "Η οργάνωση του μαθήματος και ειδικά της αίθουσας διδασκαλίας μπορεί να γίνει σύμφωνα με τις πρακτικές των hacker/makerspace."
         'title "hackerspace"
         'license_text "")

   "hand-occlusion"
   (hash 'image_url "/images/hand-occlusion.png"
         'caption "Η άμεση διάδραση με συσκευές αφής έχει το μειονέκτημα ότι το χέρι ή τα δάκτυλα μπορεί να καλύπτουν τον στόχο (ή το αντικείμενο) που θέλουμε να επιλέξουμε ή και να μετακινήσουμε, φαινόμενο γνωστό ως occlusion (έμφραξη), εκτός αν αυτό είναι αρκετά μεγάλο ή χρησιμοποιηθούν τεχνικές που αναιρούν το occlusion."
         'title "Παρεμπόδιση του στόχου από το χέρι "
         'license_text "Fair use")

   "handspring-buck"
   (hash 'image_url "/images/handspring-buck.jpg"
         'caption "Στην φάση της μετάβασης από τα αρχικά προσχέδια σε λειτουργικά πρωτότυπα υπάρχει πολύ μεγάλη ασάφεια αναφορικά με το λογισμικό και υλικό ειδικά στις περιπτώσεις που έχουμε νέες συσκευές, όπως ένα έξυπνο κινητό ή άλλες συσκευές διάχυτου υπολογισμού. Το πρωτότυπο υψηλής πιστότητας τύπου Buck γερυφώνει αυτήν την μετάβαση με την δημιουργική επαναχρησιμοποίηση υλικού και λογισμικού που ήδη υπάρχει, ακόμη και αν αυτά δεν θα είναι ίδια στο τελικό προϊόν, αρκεί να είναι αντιπροσωπευτικά της διάδρασης. "
         'title "Λειτουργικό πρωτότυπο για το Handspring "
         'license_text "")

   "hipmunk"
   (hash 'image_url "/images/hipmunk.png"
         'caption "Η επιλογή αεροπορικού εισιτηρίου ήταν μια σχετικά δύσκολη δουλειά όταν ο ταξιδιωτικός πράκτορας άκουγε τις ανάγκες του χρήστη και του έδινε επιλογές κοντά στις προτιμήσεις του. Σήμερα αποδεικνύεται ευκολότερο για τον τελικό χρήστη να έχει μια εύχρηστη διαδραστική επισκόπηση των επιλογών του."
         'title "hipmunk"
         'license_text "")

   "home-programming"
   (hash 'image_url "/images/home-programming.png"
         'caption "Οι πρώτοι προσωπικοί υπολογιστές της δεκαετίας του 1970 δεν είχαν κάποιο γραφικό περιβάλλον για το λειτουργικό σύστημα, αντίθετα είχαν γραμμή εντολών καθώς και έναν μεταγλωττιστή ως βασική διάδραση με τον χρήστη, με αποτέλεσμα μια ολόκληρη γενιά που μεγάλωσε με αυτούς τους υπολογιστές να έχει αποκτήσει μεγάλη οικειότητα με τις γλώσσες προγραμματισμού και την ανάπτυξη προσωπικών εφαρμογών ως βασικό τρόπο διάδρασης με τους προσωπικούς υπολογιστές."
         'title "Προγραμματισμός στο σπίτι ως χόμπυ "
         'license_text "wikimedia")

   "html-app"
   (hash 'image_url "/images/html-app.png"
         'caption ""
         'title "Λογισμικό εφαρμογών στον παγκόσμιο ιστό "
         'license_text "")

   "human-centered-design"
   (hash 'image_url "/images/human-centered-design.jpg"
         'caption "Ο κύκλος της ανθρωποκεντρικής σχεδίασης θεωρεί δεδομένο ότι οι ανθρώπινες ανάγκες είναι ένας κινούμενος στόχος, αλλά για πρακτικούς λόγους, ένα στιγμιότυπο της τρέχουσας σχεδίαση κλειδώνει και βγαίνει ως μία έκδοση."
         'title "Ανθρωποκεντρικός σχεδιασμός "
         'license_text "")

   "human-computers"
   (hash 'image_url "/images/human-computers.jpg"
         'caption "Από τον 17ο αιώνα και μέχρι τη δεκαετία του 1950 ο όρος υπολογιστής αναφέρεται σε έναν άνθρωπο που κάνει υπολογισμούς για να ετοιμάσει τριγωνομετρικούς και λογαριθμικούς πίνακες, οι οποίοι χρησιμοποιούνταν ευρέως στη ναυτική πλοήγηση. Με την εμφάνιση των πρώτων ηλεκτρονικών και, λίγο αργότερα, ψηφιακών υπολογιστών, η χρήση του όρου άλλαξε και αναφέρεται πλέον σε συσκευές και όχι σε ανθρώπους. "
         'title "Οι πρώτοι υπολογιστές ήταν άνθρωποι "
         'license_text "NASA ")

   "hypercard-layout"
   (hash 'image_url "/images/hypercard-layout.png"
         'caption "Το πρόγραμμα Hypercard της Apple χρησιμοποιούσε την απλή μεταφορά της στοίβας με κάρτες, και των αντικειμένων πάνω σε αυτές, και περιλάμβανε πολλές δυνατότητες σε απλή μορφή (όπως πολυμέσα, υπερμέσα και μια γλώσσα προγραμματισμού χρήστη), οι οποίες επέτρεψαν την ευέλικτη προσαρμογή του από τους τελικούς χρήστες σε πολλά πεδία, όπως σε παρουσιάσεις, στην κατασκευή διαδραστικών πρωτοτύπων και σε βίντεο παιχνίδια."
         'title "Αρχιτεκτονική της πληροφορίας στο Hypercard"
         'license_text "Apple")

   "hypercard-multimedia"
   (hash 'image_url "/images/hypercard-multimedia.jpg"
         'caption "Οι πολυμεσικές εφαρμογές με σκοπό την εκπαίδευση και την ψυχαγωγία έγιναν πολύ δημοφιλείς στις αρχές της δεκαετίας του 1990, ταυτόχρονα με την διάθεση των πρώτων πολυμεσικών επιτραπέζιων υπολογιστών και πριν την διάδοση του παγκόσμιου ιστού. Η ανάπτυξη των πολυμεσικών εφαρμογών γινόταν με φιλικά εργαλεία συγγραφής που βασίζονταν στο Apple Hypercard, τα οποία σταδιακά προσαρμόστηκαν από τους οπτικούς δίσκους στην διανομή μέσω ευρυζωνικού διαδικτύου, χωρίς όμως να αλλάξουν τα βασικά μοτίβα της κατασκευής. "
         'title "Πολυμεσικές εφαρμογές "
         'license_text "")

   "hypercard-notes"
   (hash 'image_url "/images/hypercard-notes.png"
         'caption "Η κατασκευή εφαρμογών με το Hypercard ήταν ένας συνδυασμός από διαφάνειες σταθερής διάστασης σε γραμμική ροή, που συνδυαζόταν με συνδέσεις ανάμεσα στα επιμέρους αντικείμενα των διαφανειών, καθώς και με διάδραση με την γλώσσα προγραμματισμού Hypertalk. Με αυτόν τον τρόπο, οι χρήστες έφτιαξαν πολλές διαφορετικές προσωπικές εφαρμογές για δικούς τους σκοπούς, όπως σημειώσεις που ήταν οργανωμένες με τον τρόπο που βολεύει τον κάθε χρήστη. "
         'title "Εφαρμογές Hypercard"
         'license_text "")

   "hypermedia"
   (hash 'image_url "/images/hypermedia.png"
         'caption "Τη δεκαετία του 2000 ο κυρίαρχος τρόπος διάδρασης με τους υπολογιστές μεταφέρθηκε στον παγκόσμιο ιστό, ο οποίος παρουσίασε μια μεγάλη δυνατότητα προσαρμογής σε πολλά διαφορετικά πεδία εφαρμογής, από σύστημα αρχειοθέτησης επιστημονικών δημοσιεύσεων τη δεκαετία του 1990, στο ηλεκτρονικό εμπόριο και τα ιστολόγια της δεκαετία του 2000, σε γενική πλατφόρμα εκτέλεσης εφαρμογών τη δεκαετία του 2010."
         'title "Υπερμέσα και υπερκείμενο "
         'license_text "")

   "hyperpad"
   (hash 'image_url "/images/hyperpad.jpg"
         'caption "To Hyperpad είναι μια αντιγραφή του Hypercard, με τη σημαντική διαφορά ότι είναι σχεδιασμένο να λειτουργεί στο περιορισμένο περιβάλλον της οθόνης κειμένου του λειτουργικού συστήματος MSDOS. Αν και δεν έχει τη δυνατότητα για μια πλήρη γραφική διεπαφή που βασίζεται στο ποντίκι, χρησιμοποιεί τα πλήκτρα πλοήγησης και οπτικοποιεί κουμπιά και γραφικά με χρήση κειμένου. Η πιο σημαντική του συνεισφορά είναι η χρήση μιας απλής γλώσσας προγραμματισμού που επιτρέπει στους χρήστες να επαυξήσουν τις δυνατότητες της γραμμής εντολής του MSDOS και να φτιάξουν τη δικιά τους σύνθεση εφαρμογών και διαδικασιών που ταιριάζουν στις ανάγκες τους. "
         'title "Κατασκευή εφαρμογών MSDOS με το Hyperpad "
         'license_text "")

   "ibm-pc"
   (hash 'image_url "/images/ibm-pc.jpg"
         'caption "Ο επιτραπέζιος υπολογιστής IBM PC ήταν μια μεγάλη εμπορική επιτυχία σε μια πολύ ανταγωνιστική αγορά από έναν οργανισμό που είχε συνηθίσει να δουλεύει μόνο με κεντρικούς υπολογιστές και κυρίως με εταιρικούς πελάτες και όχι τους τελικούς χρήστες. Τα βασικά συστατικά της επιτυχίας του ήταν η εξαιρετική ποιότητα κατασκευής ειδικά για το πληκτρολόγιο και η μεγάλη διαθεσιμότητα λογισμικού για πολλές διαφορετικές χρήσεις."
         'title "Προσωπικός υπολογιστής της IBM "
         'license_text "Wikimedia ")

   "ibm2471"
   (hash 'image_url "/images/ibm2471.jpg"
         'caption "Ο τυλέτυπος σταδιακά βελτιώθηκε για να είναι πιο γρήγορος και αξιόπιστος στην σύνδεση με κεντρικούς υπολογιστές, ενώ προστέθηκε και η δυνατότητα ανάγνωσης και εγγραφής από διάτρυτες κάρτες και ταινία. Οι πρώτες γλώσσες προγραμματισμού και τα πρώτα λειτουργικά συστήματα αναπτύχθηκαν με αυτές τις συσκευές, μέχρι και το 1970, οπότε σταδιακά έδωσαν την θέση τους στα τερματικά με οθόνη. "
         'title "Τηλέτυπος IBM 2471 "
         'license_text "")

   "ical"
   (hash 'image_url "/images/ical.png"
         'caption "Οι πρώτες εκδόσεις του δημοφιλούς iOS είχαν πολλές εφαρμογές που έμοιαζαν οπτικά με τα αντίστοιχα αντικείμενα του πραγματικού κόσμου, αλλά στην πορεία άλλαξαν προς περισσότερο αφαιρετικές αναπαραστάσεις οι οποίες συνήθως είναι και περισσότερο λειτουργικές υπό την προϋπόθεση ότι ο χρήστης δεν είναι αρχάριος."
         'title "Σκευομορφισμός και μεταφορές από τον πραγματικό κόσμο "
         'license_text "")

   "icons-document"
   (hash 'image_url "/images/icons-document.jpg"
         'caption "Η αναπαράσταση φυσικών αντικειμένων με μικρά αντιπροσωπευτικά εικονίδια είναι ένα βασικό συστατικό της επιτυχίας της προσομοίωσης του φυσικού γραφείου στην οθόνη του επιτραπέζιου υπολογιστή. Από την διδακτορική διατριβή του David Smith πέρασαν στο Xerox Star και από εκεί στο Macintosh, πριν καθιερωθούν σε όλες τις πλατφόρμες με λίγες εξαιρέσεις όπως είναι το Oberon."
         'title "Εικονίδια εγγράφων στην επιφάνεια εργασίας"
         'license_text "wikimedia")

   "igoefinger"
   (hash 'image_url "/images/igoefinger.png"
         'caption "Ο Tom Igoe έχει σχεδιάσει μια (όχι ιδιαιτέρως κολακευτική) εικόνα για το πως ένας επιτραπέζιος υπολογιστής με διάδραση που βασίζεται στην επιφάνεια εργασίας βλέπει τον χρήστη."
         'title "Ο άνθρωπος από την πλευρά ενός επιτραπέζιου υπολογιστή "
         'license_text "")

   "input-comparison"
   (hash 'image_url "/images/input-comparison.png"
         'caption "Η συσκευή εισόδου ποντίκι αρχικά δεν είχε κάποιο προφανές πλεονέκτημα σε σχέση με παρόμοιες συσκευές εισόδου, όπως ο μοχλός και τα πλήκτρα κατεύθυνσης, τα οποία ήταν ήδη διαθέσιμα στην αγορά και οικεία στους χρήστες. Έπρεπε να γίνουν συγκριτικές δοκιμές απόδοσης, για να διαπιστωθεί ποια ήταν τελικά περισσότερο κατάλληλη για την επιλογή κειμένου στην οθόνη, το οποίο αποτελετούσε τότε τη βασική ανάγκη ."
         'title "Συσκευές εισόδου για επιλογή κειμένου "
         'license_text "Elsevier")

   "input-device-taxonomy"
   (hash 'image_url "/images/input-device-taxonomy.png"
         'caption "Οι σχεδιαστές έχουν προσπαθήσει να οργανώσουν τις πολλές διαθέσιμες συσκευές εισόδου σε κατηγορίες, ώστε να διευκολύνουν τόσο την κατανόηση τους, όσο και τον σχεδιασμό νέων συσκευών εισόδου."
         'title "Ταξινόμηση συσκευών εισόδου "
         'license_text "")

   "interactive-whiteboard"
   (hash 'image_url "/images/interactive-whiteboard.jpg"
         'caption "Η μετατροπή του παραδοσιακού σχολικού μαυροπίνακα κιμωλίας σε ψηφιακό πίνακα είναι μια τεχνολογία που επιτρέπει στον χρήστη να αλληλεπιδράσει με την πληροφορία σε μια μεγάλη και απτική οθόνη. Η τεχνολογία αυτή αρχικά βασίστηκε στα διαθέσιμα επιτραπέζια λειτουργικά συστήματα, ενώ και οι εφαρμογές απλά προσομοιώνουν τις παραδοσιακές διαδράσεις του μαυροπίνακα χωρίς να προσφέρουν σημαντική επαύξηση της διδασκαλίας. "
         'title "Διαδραστικός πίνακας στην εκπαίδευση "
         'license_text "")

   "iphone-buck"
   (hash 'image_url "/images/iphone-buck.jpg"
         'caption "Το λογισμικό διάδρασης με τον χρήστη συνήθως κατασκευάζεται σε αρκετά υψηλό επίπεδο ώστε να είναι σχετικά ανεξάρτητο από τις λεπτομέρειες του υλικού στο τελικό τερματικό χρήστη, οπότε στα τελευταία στάδια της κατασκευής είναι σύνηθες να έχουμε υλικό που τουλάχιστον μορφολογικά λίγο μοιάζει με την τελική εμπορική συσκευή του χρήστη, ειδικά όταν αυτή είναι η πρώτη έκδοση όπως το πρώτο iPhone. "
         'title "iPhone buck "
         'license_text "")

   "iphone-jobs"
   (hash 'image_url "/images/iphone-jobs.jpg"
         'caption "Η εισαγωγή του πρώτου iphone αποτελεί σημείο αναφοράς, καθώς, μέσα σε λιγότερο από δέκα χρόνια, περισσότεροι άνθρωποι θα είχαν μια παρόμοια κινητή συσκευή με οθόνη αφής ως βασικό σύστημα καθημερινής διάδρασης, παρά τον παραδοσιακό επιτραπέζιο υπολογιστή, ο οποίος θα κρατήσει τη θέση του περισσότερο ως υπολογιστής ανάπτυξης. "
         'title "Apple iPhone "
         'license_text "Wikimedia ")

   "ipod-click-wheel"
   (hash 'image_url "/images/ipod-click-wheel.jpg"
         'caption "Η πρώτη γενιά iPod εισάγει έναν νέο τρόπο πλοήγησης σε μεγάλες λίστες (μενού) αρχείων μουσικής, τον περιστρεφόμενο τροχό. Ταυτόχρονα, λειτούργησε ως δούρειος ίππος για τη σταδιακή εισαγωγή και την εξοικείωση των χρηστών με κινητές συσκευές διάδρασης, οι οποίες συνδέονται με τον προσωπικό υπολογιστή. Στις επόμενες γενιές iPod οι σχεδιαστές κρατήσαν τον τρόχο και τον βελτίωσαν μεταφέροντας πάνω του τα προηγουμένως διακριτά κουμπιά μενού, παύσης, και επόμενο/προηγούμενο. Επίσης, τόσο το τροχός όσο και τα κουμπιά δουλεύουν πλέον με αισθητήρα αφής, με το συνολικό αποτέλεσμα να είναι οπτικά πιο απλό για τον χρήστη, αλλά και να απαιτεί λιγότερες κινήσεις μεγαλύτερης ακρίβειας από τα δάκτυλα του."
         'title "Τροχός πλοήγησης iPod "
         'license_text "Wikimedia ")

   "ipod_1g"
   (hash 'image_url "/images/ipod_1g.png"
         'caption "Η πρώτη γενιά iPod εισάγει έναν νέο τρόπο πλοήγησης σε μεγάλες λίστες (μενού) αρχείων μουσικής, τον περιστρεφόμενο τροχό. Ταυτόχρονα, λειτούργησε ως δούρειος ίππος για τη σταδιακή εισαγωγή και την εξοικείωση των χρηστών με κινητές συσκευές διάδρασης, οι οποίες συνδέονται με τον προσωπικό υπολογιστή."
         'title "iPod πρώτης γενιάς"
         'license_text "Apple")

   "ipod_classic"
   (hash 'image_url "/images/ipod_classic.png"
         'caption "Στις επόμενες γενιές iPod οι σχεδιαστές κρατήσαν τον τρόχο και τον βελτίωσαν μεταφέροντας πάνω του τα προηγουμένως διακριτά κουμπιά μενού, παύσης, και επόμενο/προηγούμενο. Επίσης, τόσο το τροχός όσο και τα κουμπιά δουλεύουν πλέον με αισθητήρα αφής, με το συνολικό αποτέλεσμα να είναι οπτικά πιο απλό για τον χρήστη, αλλά και να απαιτεί λιγότερες κινήσεις μεγαλύτερης ακρίβειας από τα δάκτυλα του."
         'title "iPod με τροχό κύλισης"
         'license_text "")

   "ipod_touch_2g"
   (hash 'image_url "/images/ipod_touch_2g.png"
         'caption "Το iPod touch καλύπτεται πλέον από οθόνη και δεν έχει τον τροχό κύλησης και τα κουμπιά πλοήγησης, τα οποία πλέον έχουν αντικατασταθεί από λειτουργίες λογισμικού διάδρασης που εμφανίζονται δυναμικά πάνω στην οθόνη αφής. Συνολικά είναι μια συσκευή που πλησιάζει ένα πλήρες iPhone αφού διαθέτει πολυαπτική διεπαφή, ασύρματη σύνδεση στο δίκτυο και δυνατότητα λήψης (download) νέων εφαρμογών. Του λείπει μόνο η δυνατότητα τηλεφωνικών κλήσεων."
         'title "iPod με οθόνη αφής"
         'license_text "")

   "irc"
   (hash 'image_url "/images/irc.png"
         'caption ""
         'title "IRC chat"
         'license_text "From Wikimedia Commons, Public Domain Dedication")

   "itunes3"
   (hash 'image_url "/images/itunes3.png"
         'caption "Το iTunes, αν και ξεκίνησε ως μια ταπεινή εφαρμογή εκτέλεσης μουσικών αρχείων και συγχρονισμού τους με το iPod, μετατράπηκε σε δούρειο ίππο για τη μεταφόρτωση εφαρμογών και τον συγχρονισμό με το οικοσύστημα των κινητών συσκευών χρήστη."
         'title "Apple iTunes"
         'license_text "Apple")

   "itv-buck"
   (hash 'image_url "/images/itv-buck.png"
         'caption "Το Buck επιτρέπει την πειστική αξιολόγηση με χρήστες, γιατί οι χρήστες έχουν στα χέρια τους υλικό που μοιάζει πολύ με την τελική συσκευή, ενώ το λογισμικό τρέχει στον επιτραπέζιο ΗΥ, στον οποίο είναι σχετικά εύκολο να κάνουμε τον προγραμματισμό της διάδρασης."
         'title "iTV πρωτότυπο "
         'license_text "")

   "itv-program"
   (hash 'image_url "/images/itv-program.jpg"
         'caption ""
         'title "Επαυξημένο τηλεοπτικό πρόγραμμα "
         'license_text "Wikipedia.org")

   "joss"
   (hash 'image_url "/images/joss.jpg"
         'caption "Το περιβάλλον προγραμματισμού JOSS δεν έκανε διάκριση ανάμεσα στη γλώσσα προγραμματισμού και στο λειτουργικό σύστημα και επηρέασε την έκδοση της BASIC για μικροϋπολογιστές της δεκαετίας του 1980, γιατί βασιζόταν σε μια σύγχρονη αλληλεπίδραση ανθρώπου και υπολογιστή, σε αντίθεση με τα συστήματα εκείνης της εποχής, τα οποία βασίζονταν, κυρίως, σε εργασίες δέσμης. Επίσης, η JOSS δείχνει την κατανόηση της διάδρασης ως μια διαλογική επικοινωνία ανθρώπου-υπολογιστή και ταυτόχρονα αποτυπώνει τον ρόλο των συσκευών διάδρασης σε αυτόν τον διάλογο, που στην περίπτωση της ήταν ο τηλέτυπος."
         'title "JOSS "
         'license_text "Wikimedia ")

   "kay-profile"
   (hash 'image_url "/images/kay-profile.jpg"
         'caption "Ο Alan Kay μετέφερε τον προγραμματισμό με γραφικά σε ένα προσωπικό διαδραστικό σύστημα, το οποίο σε μια εκδοχή του δημιούργησε όλα τα σύγχρονα επιτραπέζια συστήματα. Παράλληλα, ο ίδιος παραμένει με συνέπεια ένας από τους λίγους συνεχιστές της φιλοσοφίας του Douglas Engelbart, με σύγχρονα συστήματα, τα οποία δίνουν έμφαση περισσότερο στις προσωπικές δεξιότητες και στην εκφραστική δύναμη, παρά στην ευχρηστία ως οικειότητα και ευκολία. "
         'title "Alan Kay "
         'license_text "Alan Kay")

   "kickstarter-pebble"
   (hash 'image_url "/images/kickstarter-pebble.png"
         'caption "Το έξυπνο ρολόι pebble κατάφερε να πουλήσει το πρώτο εκατομμύριο κομμάτια το ίδιο γρήγορα με το πρώτο Apple iPod, με τη διαφορά ότι το pebble σχεδιάστηκε από μια μικρή ομάδα και χρηματοδοτήθηκε από χιλιάδες δυνητικούς χρήστες και όχι από επενδυτές που έχουν ως κίνητρο μόνο το κέρδος."
         'title "Χρηματοδότηση από το πλήθος "
         'license_text "Kickstarter")

   "kidsim"
   (hash 'image_url "/images/kidsim.png"
         'caption "Η έκθεση στον προγραμματισμό της διάδρασης από μικρές ηλικίες έχει αναγνωριστεί ως μια σημαντική αξία του ψηφιακού αλφαβητισμού και έχει γίνει μια διαχρονική προσπάθεια να φτιαχτούν οπτικές γλώσσες προγραμματισμού ώστε η διάδραση με τους υπολογιστές να είναι κάτι περισσότερο από μια απλή κατανάλωση έτοιμων εμπειριών. Το KidSim βασίζεται στην οπτική διάδραση με παραδείγματα, όπου ο κώδικας παράγεται αυτόματα, χωρίς κείμενο ή τουβλάκια."
         'title "Λογισμικό κατασκευής προσομοιώσεων για παιδιά"
         'license_text "")

   "kinect"
   (hash 'image_url "/images/kinect.png"
         'caption "Η προσιτή οικονομικά κάμερα βάθους πεδίου Kinect σημείωσε πολύ μεγάλες πωλήσεις τους πρώτους μήνες της παρουσίασης της, αλλά η εμπορική επιτυχία δεν είχε διάρκεια. Αν και η κάμερα κυκλοφόρησε για μια παιχνιδομηχανή, τελικά ήταν πολύ δημοφιλής κυρίως με τους ερευνητές, τους καλιτέχνες, και τους χομπίστες, οι οποίοι απέκτησαν πρόσβαση σε μια εύχρηστη συσκευή που τους επέτρεπε να χρησιμοποιήσουν όλο το σώμα τους και όχι μόνο τα δάχτυλα για την διάδραση. "
         'title "Κάμερα βάθους πεδίου Kinect"
         'license_text "")

   "knowledge-navigator"
   (hash 'image_url "/images/knowledge-navigator.jpg"
         'caption "Στα τέλη της δεκαετίας του 1980 η Apple παρουσίασε ένα βίντεο με μια μεγάλη επιτραπέζια συσκευή αφής, η οποία είχε τη δυνατότητα πολυμέσων, υπερμέσων, καθώς και τηλεδιάσκεψης με βίντεο, τα οποία, όμως, δεν ήταν τεχνολογικά εφικτά τότε.Αυτό δεν εμπόδισε τους σχεδιαστές της διεπαφής να τα φανταστούν, αφού όλη η παρουσίαση ήταν ένα ψηφιακά επεξεργασμένο βίντεο και όχι ένα πραγματικό πρωτότυπο. "
         'title "Apple Knowledge Navigator "
         'license_text "Apple")

   "knuth-fonts"
   (hash 'image_url "/images/knuth-fonts.jpg"
         'caption ""
         'title "Διανυσματικές Γραμματοσειρές "
         'license_text "")

   "kodak-buck"
   (hash 'image_url "/images/kodak-buck.png"
         'caption "Το λειτουργικό υπόδειγμα υψηλής πιστότητας για μια ψηφιακή φωτογραφική μηχανή της Kodak διαφέρει τόσο στο υλικό όσο και στο λογισμικό από το τελικό προϊόν. Αυτή η διαφορά όμως δεν εμποδίζει στους σχεδιαστές να δοκιμάσουν και να αναθεωρήσουν γρήγορα και με ακρίβεια εκδοχές για τη τελική διεπαφή του χρήστη."
         'title "Λειτουργικό υπόδειγμα για μια ψηφιακή φωτογραφική μηχανή "
         'license_text "Kodak")

   "lanier-profile"
   (hash 'image_url "/images/lanier-profile.jpg"
         'caption "Ο Jaron Lanier κατασκεύασε τα πρώτα εμπορικά συστήματα εικονικής πραγματικότητας με στόχο να εξερευνήσει την ανθρώπινη συνείδηση σε φαντασιακά περιβάλλοντα και σε διάδραση με άλλους χρήστες. Εκτός από τη θεμελίωση μιας σημαντικής περιοχής, έχει συμβάλει στη διάδοση μιας ανθρωποκεντρικής τεχνολογικής φιλοσοφίας, η οποία έρχεται σε αντίθεση με το κυρίαρχο αφήγημα της Τεχνητής Νοημοσύνης. "
         'title "Jaron Lanier "
         'license_text "Jaron Lanier")

   "lcd-watch"
   (hash 'image_url "/images/lcd-watch.jpg"
         'caption "Η δημιουργία της οθόνης υγρών κρυστάλων και η ανάγκη για τον έλεγχο της από ένα ολοκληρωμένο κύκλωμα ημιαγωγών οδήγησε την Intel στην εξαγορά των σχετικών τεχνολογιών, καθώς και στην παρουσίαση ρολογιών χειρός, τα οποία τελικά απέτυχαν εμπορικά, αφού δεν είχαν ακόμη την δυνατότητα για περισσότερες λειτουργίες εκτός από το να δείχνουν την ώρα. "
         'title "Ρολόϊ χειρός με ψηφιακή οθόνη "
         'license_text "Intel ")

   "leap-motion"
   (hash 'image_url "/images/leap-motion.png"
         'caption "Τα ανθρώπινα χέρια και ειδικά τα δάκτυλα παρουσιάζουν μεγάλη ευαισθησία και ακρίβεια στην κίνηση και στην αίσθηση, όπως φαίνεται από τον χειρισμό μουσικών οργάνων γενικά, αλλά και ειδικά στις διαχρονικά δημοφιλείς συσκευές διάδρασης, όπως είναι το ποντίκι και η πένα. Η κάμερα του Leap Motion βασίζεται στην καταγραφή του υπέρυθρου φάσματος και στην υπολογιστική όραση, έτσι ώστε να διακρίνει με ακρίβεια την κίνηση των χεριών και των δακτύλων σε μια σχετικά οικονομική συσκευή, που είναι πιο βολική από τα γάντια καταγραφής του παρελθόντος. "
         'title "Leap Motion "
         'license_text "")

   "learntomod"
   (hash 'image_url "/images/learntomod.jpg"
         'caption "Η ευελιξία και η επεκτασιμότητα του Minecraft δεν σταματούν στη δυνατότητα κατασκευής του σκηνικού της δράσης, αλλά επεκτείνονται στη δυνατότητα προγραμματισμού της συμπεριφοράς και στη δημιουργία νέων αντικειμένων."
         'title "Κατασκευή επεκτάσεων στο Minecraft "
         'license_text "LearnToMod ")

   "lifestreams"
   (hash 'image_url "/images/lifestreams.jpg"
         'caption "Η οργάνωση και η αλληλεπίδραση με την πληροφορία σε χρονολογική σειρά παρουσιάστηκε σε μια διεπαφή με τίτλο Lifestreams περισσότερο από μια δεκαετία πριν γίνει ο βασικός τρόπος διάδρασης στα ψηφιακά κοινωνικά μέσα, όπως τα Twitter, Facebook."
         'title "Lifestreams"
         'license_text "Yale")

   "lilith-desktop"
   (hash 'image_url "/images/lilith-desktop.jpg"
         'caption "Το αντίγραφο του Alto ακολουθεί πιστά την οθόνη εικονοστοιχείων σε μορφή πορτραίτου καθώς και την συσκευή εισόδου με το ποντίκι. Το Lilith χρησιμοποιήθηκε στο ΕΤΗ της Ζυρίχης για την διδασκαλία της κατασκευής λογισμικού με νέες τεχνολογίες που βασίζονται στην γλώσσα προγραμματισμού Modula. "
         'title "Επιτραπέζιος υπολογιστής Lilith "
         'license_text "Hansotten ")

   "lilith-modula"
   (hash 'image_url "/images/lilith-modula.jpg"
         'caption "Η εμπειρία της διάδρασης με το Alto εντυπωσίασε τόσο πολύ τον Niklaus Wirth που αποφάσισε να δημιουργήσει ένα παρόμοιο μηχάνημα με την ονομασία Lilith. Ακολούθησε μια λιγότερο δυναμική κατεύθυνση από αυτήν της Smalltalk, με τη δημιουργία της γλώσσας προγραμματισμού Modula, καθώς και με παράθυρα που δεν αλληλοεπικαλύπτονται. "
         'title "Lilith Modula "
         'license_text "Niklaus Wirth ")

   "linc-pc"
   (hash 'image_url "/images/linc-pc.jpg"
         'caption "O LINC (Laboratory INstrument Computer) θεωρείται ο πρώτος προσωπικός υπολογιστής, γιατί σε έναν σχετικά μικρό όγκο περιλαμβάνει μια συσκευή εξωτερικής αποθήκευσης και κυρίως μία οθόνη και ένα πληκτρολόγιο ως σύστημα εξόδου και εισόδου. Σε αντίθεση με τους μεγάλους κεντρικούς υπολογιστές εκείνης της εποχής, ήταν σχεδιασμένος από την αρχή σε συναρμολογούμενη μορφή, οπότε ήταν σχετικά προσιτός σε πολλά ερευνητικά εργαστήρια που είχαν τις δεξιότητες να τον κατασκευάσουν και να τον συντηρήσουν."
         'title "LINC PC "
         'license_text "MIT")

   "line-printer"
   (hash 'image_url "/images/line-printer.jpg"
         'caption "Ο εκτυπωτής γραμμής ήταν για πολλές δεκαετίες η βασική συσκευή εξόδου για έναν κεντρικό υπολογιστή, ενώ χρησιμοποιήθηκε ευρέως και στους πρώτους μίνι υπολογιστές, μέχρι οι ηλεκτρονικές οθόνες να γίνουν προσβάσιμες την δεκαετία του 1970. Καθώς ο εκτυπωτής γραμμής κατασκευάστηκε ως μια γενίκευση της γραφομηχανής, η έμφαση είναι στην εκτύπωση γραμμάτων, αλλά σταδιακά οι εφευρετικοί χρήστες μπόρεσαν να αναπαραστήσουν και εικόνες μέσω του συνδυασμού γραμμάτων και συμβόλων. "
         'title "Εκτυπωτής γραμμής "
         'license_text "Wikipedia ")

   "linux"
   (hash 'image_url "/images/linux.png"
         'caption "Οι δύο βασικές προσεγγίσεις στη διάθεση του λογισμικού είναι αυτή του ανοικτού (π.χ. Linux) και του κλειστού κώδικα (π.χ. Microsoft Windows), οι οποίες εμφανίζονται ως αντίπαλες, αλλά σε κάποιες περιπτώσεις μπορεί να λειτουργούν και συμπληρωματικά, όπως στην περίπτωση του λογισμικού ανοιχτού κώδικα Red Hat Enterprise Linux, το οποίο παρέχεται ως εμπορική υπηρεσία. Το πιο ενδιαφέρον, όμως, είναι ότι μια συλλογική προσπάθεια όπως το Linux, η οποία δεν έχει στόχο το κέρδος, μπορεί και παράγει ένα αποτέλεσμα εφάμιλλο των εμπορικών υπηρεσιών."
         'title "Εμπορική εκμετάλευση ανοιχτού κώδικα"
         'license_text "Ubuntu ")

   "lisa-bootstrapping"
   (hash 'image_url "/images/lisa-bootstrapping.jpg"
         'caption "Η κατασκευή λογισμικού για ένα νέο υλικό υπολογιστή που δεν υπάρχει ακόμη μπορεί να ξεκινήσει με έναν διαθέσιμο υπολογιστή, στον οποίο γίνεται εξομοίωση της αρχιτεκτονικής του νέου συστήματος. Με αυτόν τον τρόπο, ο διαθέσιμος Apple II χρησιμοποιήθηκε για την κατασκευή της γραφικής διεπαφής του Apple Lisa σε μια επαναληπτική διαδικασία, η οποία ξεκίνησε από τα διαθέσιμα εργαλεία που υποστήριζαν μόνο χαρακτήρες κειμένου σε μια μαύρη οθόνη."
         'title "Επαναληπτική ανάπτυξη του Lisa "
         'license_text "Bill Atkinson")

   "logo-graphics"
   (hash 'image_url "/images/logo-graphics.png"
         'caption ""
         'title "Χελώνα γραφικών "
         'license_text "Wikimedia ")

   "logo-robot"
   (hash 'image_url "/images/logo-robot.jpg"
         'caption ""
         'title "Χελώνα ρομπότ "
         'license_text "Seymour Papert")

   "long-tail"
   (hash 'image_url "/images/long-tail.png"
         'caption "Μια καθολική διαπίστωση από την ανάλυση της πραγματικής χρήσης σε δημοφιλή συνεργατικά συστήματα, όπως τα φόρουμ (forum) συζητήσεων, η συγγραφή άρθρων για τη Wikipedia, ο σχολιασμός προϊόντων, κτλ. είναι ότι υπάρχουν πάντα δύο βασικές ομάδες χρηστών, μια πολύ μικρή με πολύ μεγάλη συνεισφορά και μια πολύ μεγάλη με μικρή ποσοτικά συνεισφορά, η οποία όμως δίνει μεγάλη αξία στο συνολικό σύστημα παρέχοντας ποικιλία απόψεων."
         'title "Η μεγάλη ουρά των πολλών και μικρών συνεισφορών σε κοινό έργο "
         'license_text "")

   "lunar-lander-arcade"
   (hash 'image_url "/images/lunar-lander-arcade.png"
         'caption "Η έκδοση για δημόσιες κονσόλες από την Atari με τα διανυσματικά γραφικά αν και ήταν πολύ καινοτομική για την εποχή δεν αποδείχτηκε τόσο δημοφιλής όσο οι εκδόσεις κειμένου, αλλά τελικά αποτέλεσε τη τεχνολογική βάση για το πολύ επιτυχημένο Asteroids. Ο παίκτης έπρεπε να εισάγει νομίσματα για να έχει καύσιμα, τα οποία κατανάλωνε κατά τη προσγείωση, η οποία γινόταν με δύο κουμπιά κατεύθυνσης και άλλα δύο χειριστήρια για τη δύναμη του κινητήρα."
         'title "Lunar Lander Arcade"
         'license_text "Wikipedia")

   "lunar-lander"
   (hash 'image_url "/images/lunar-lander.png"
         'caption "Ένα από τα πιο δημοφιλή βιντεοπαιχνίδια κειμένου της δεκαετίας του 1970 είναι το Lunar Lander, το οποίο είναι εμπνευσμένο από την προσγείωση του πρώτου ανθρώπου στο φεγγάρι. Η αρχική εκδοχή του παιχνιδιού παρουσιάζει με κείμενο την τρέχουσα κατάσταση του διαστημοπλοίου και ο χρήστης δίνει μια τιμή για την ώθηση των πυραύλων, πράγμα εύκολο να υλοποιηθεί στην γλώσσα προγραματισμού BASIC και κάτι που το έκανε ακόμη πιο δημοφιλές για όσους έκαναν τα πρώτα βήματα με τους υπολογιστές εκείνη την εποχή ειδικά σε συστήματα χωρίς γραφικά όπως τα PDP, Altair."
         'title "Lunar Lander "
         'license_text "Wikipedia")

   "macintosh-desktop"
   (hash 'image_url "/images/macintosh-desktop.png"
         'caption "Το λειτουργικό σύστημα του επιτραπέζιου υπολογιστή Macintosh ήταν το πρώτο επιτυχημένο εμπορικό γραφικό περιβάλλον εργασίας και το πρώτο που έδωσε πρόσβαση σε πολλές εφαρμογές λογισμικού, ακόμη και σε χρήστες που δεν είχαν γνώσεις υπολογιστών, χάρη στην ευχρηστία του."
         'title "Γραφική επιφάνεια εργασίας Apple Macintosh"
         'license_text "Apple")

   "macpaint-prototype"
   (hash 'image_url "/images/macpaint-prototype.jpg"
         'caption "Πριν ακόμη κατασκευαστεί το γραφικό περιβάλλον με τα παράθυρα, ο Bill Atkinson ανάπτυξε το λογισμικό ψηφιακής επεξεργασίας εικόνας Sketchpad, το οποίο τρέχει στον αρχικό εξομοιωτή και βοήθησε στον διαχωρισμό του λειτουργικού συστήματος από τις εφαρμογές αλλά και στη σχεδίαση στοιχείων του μελλοντικού γραφικού περιβάλλοντος. "
         'title "Αρχικό MacPaint χωρίς παράθυρα "
         'license_text "Bill Atkinson")

   "macpaint"
   (hash 'image_url "/images/macpaint.jpg"
         'caption "Η εφαρμογή ψηφιακής επεξεργασίας εικόνας MacPaint χρησιμοποιήθηκε για να διαφημίσει τη φιλικότητα του Apple Macintosh, καθώς και για να τονίσει τη νέα κατεύθυνση των υπολογιστών εκτός από τα εργαλεία και ως μέσα δημιουργικής έκφρασης. Αν και δεν έγινε ευρέως διαθέσιμη στους δημοφιλείς υπολογιστές εκείνης της εποχής, έλαβε άριστες κριτικές και οδήγησε στη δημιουργία εφαρμογών όπως το Photoshop. "
         'title "MacPaint "
         'license_text "Computer History Museum ")

   "macromedia-flash-editor"
   (hash 'image_url "/images/macromedia-flash-editor.jpg"
         'caption "Το περιβάλλον ανάπτυξης διαδραστικών πολυμεσικών εφαρμογών που βασίζονται στα κινούμενα σχέδια μοιάζει με τα συγγενικά δημιουργικά εργαλεία και επιτρέπει την σταδιακή εξοικείωση με προχωρημένες έννοιες, όπως έκανε το περιβάλλον ανάπτυξης Hypercard για τα υπερμέσα. Ο χρήστης μπορεί να ξεκινήσει με την δημιουργία διανυσματικών γραφικών για τα κινούμενα σχέδια και σταδιακά να προσθέσει μορφότυπα συμπεριφορών, πολυμέσα, δικτυακά δεδομένα, και τελικά να γράψει κώδικα με πρωτότυπες συμπεριφορές."
         'title "Περιβάλλον ανάπτυξης εφαρμογών με κινούμενο σχέδιο"
         'license_text "www.webdesign.org")

   "magic-cap"
   (hash 'image_url "/images/magic-cap.png"
         'caption ""
         'title "Η χρήση της μεταφοράς στο κινητό σύστημα Magic Cap "
         'license_text "wikimedia")

   "magnavox-odyssey"
   (hash 'image_url "/images/magnavox-odyssey.jpg"
         'caption "Η πρώτη εμπορικά πετυχημένη οικιακή κονσόλα βιντεοπαιχνιδιών είχε μόνο τη δυνατότητα να μετακινεί τρία σημεία στην τηλεόραση του χρήστη, με τα δύο χειριστήρια με τροχαλία, ενώ δεν είχε τη δυνατότητα να εκτελέσει νέα παιχνίδια, εκτός από αυτά που ήταν ήδη αποθηκευμένα στην εσωτερική μνήμη ανάγνωσης. Με τη βοήθεια ενός σετ περιφερειακών, όπως χρωματισμένες ημιδιαφανείς ζελατίνες για την τηλεόραση και κάρτες επιτραπέζιων παιχνιδιών, δημιούργησε τη βιομηχανία των βιντεοπαιχνιδιών. To πιο γνωστό παιχνίδι ήταν το Table Tennis for Two, το οποίο πολύ γρήγορα βελτιώθηκε από την Atari με το δημοφιλές Pong."
         'title "Magnavox Odyssey "
         'license_text "Philips")

   "makerspace"
   (hash 'image_url "/images/makerspace.jpg"
         'caption "Στα εργαστήρια τύπου hackerspace, η τεχνολογική καινοτομία και η μάθηση αποτελούν βασικό στόχο, τον οποίο πετυχαίνουν μέσω της συνεργασίας και της πειραματικής εξερεύνησης. Με αυτόν τον τρόπο, εργαλεία και τεχνικές που στο παρελθόν κατείχαν μόνο μεγάλες εταιρείες, πλέον βρίσκονται στη διάθεση των τελικών χρηστών, οι οποίοι έχουν, επίσης, τους ρόλους του σχεδιαστή και του κατασκευαστή."
         'title "Συνεργατικό εργαστήριο ερασιτεχνικής κατασκευής συστήματων Makerspace "
         'license_text "Fair use")

   "makey-makey"
   (hash 'image_url "/images/makey-makey.jpg"
         'caption "Το Makey Makey είναι ένα Arduino, το οποίο έχει οργανωθεί και έχει προγραμματιστεί έτσι ώστε να διευκολύνει τον πειραματισμό με νέες συσκευές εισόδου. Οι χρήστες μπορούν να συνδέσουν στους ακροδέκτες του κάποιο αγώγιμο υλικό, το οποίο στην συνέχεια θα παίξει τον ρόλο του δείκτη και της επιλογής στο λογισμικό του υπολογιστή."
         'title "Πλατφόρμα πειρασματισμού για νέες συσκευές εισόδου Makey Makey"
         'license_text "Wikimedia ")

   "mapping-principle"
   (hash 'image_url "/images/mapping-principle.jpg"
         'caption "Σε μια συσκευή που έχει την έξοδο σε διαφορετικό σημείο από την είσοδο του χρήστη θα πρέπει να υπάρχει μια συνεπής απεικόνιση ανάμεσα στην είσοδο και στην έξοδο, όπως στην περίπτωση των εστιών μιας κουζίνας μαγειρέματος."
         'title "Συνεπής απεικόνιση ανάμεσα στην είσοδο και στην έξοδο "
         'license_text "Free Art License ")

   "math-blaster"
   (hash 'image_url "/images/math-blaster.png"
         'caption "Το εκπαιδευτικό βιντεο-παιχνίδι Math Blaster βασίζεται σε μια πολύ δημοφιλή και κλασική φόρμα παιχνιδιού (shoot’em up) με τη διαφορά ότι ο χρήστης θα πρέπει να κάνει και τις μαθηματικές πράξεις σωστά για να πετύχει τον στόχο του παιχνιδιού. Τα περισσότερα εκπαιδευτικά βιντεοπαιχνίδια δυσκολεύονται να ολοκληρώσουν την μηχανική του παιχνιδιού με το εκπαιδευτικό περιεχόμενο, ενώ παράλληλα θεωρούν την διάδραση απλά ένα μέσο για έναν παλιότερο στόχο, όπως είναι οι πράξεις στα μαθηματικά, αντί να εξερευνήσουν νέους τρόπους σκέψης για τα μαθηματικά."
         'title "Εκπαιδευτικό βιντεοπαιχνίδι Math Blaster"
         'license_text "")

   "max-language"
   (hash 'image_url "/images/max-language.jpg"
         'caption "Η οπτική γλώσσα προγραμματισμού MAX δημιουργήθηκε για να διευκολύνει την καλλιτεχνική δημιουργία και βασίζεται στη λογική της ροής δεδομένων μέσα από τον οπτικά σχεδιασμένο γράφο επεξεργασίας τους, αντί για κείμενο και εντολές ελέγχου σε γραμμική σειρά, τα οποία συναντάμε στις παραδοσιακές γλώσσες προγραμματισμού."
         'title "MAX programming language "
         'license_text "wikimedia")

   "media-scrub"
   (hash 'image_url "/images/media-scrub.png"
         'caption "Η άμεση διάδραση πάνω σε μια οθόνη αφής δεν επιτρέπει τον έλεγχο του ρυθμού μετακίνησης, αλλά αυτό μπορεί να γίνει εφικτό τουλάχιστον για την περίπτωση της γραμμικής μετακίνησης, αν ο ρυθμός αντιπροσωπεύεται από μια άλλη ορθογωνική κίνηση του δακτύλου, όπως για παράδειγμα στην περίπτωση της αναζήτησης στον οριζόντιο χρόνο οπτικοακουστικού περιεχομένου, κατά την οποία ο ρυθμός αλλάζει με την κατακόρυφη θέση του δακτύλου. "
         'title "Έμεση διάδραση σε οθόνη αφής "
         'license_text "Apple")

   "media-space"
   (hash 'image_url "/images/media-space.jpg"
         'caption "Το ερευνητικό πρόγραμμα Media Space ήταν μια από τις πρώτες προσπάθειες ανθρώπινης συνεργασίας από απόσταση μέσω υπολογιστή, το οποίο χρησιμοποιούσε ζωντανή εικόνα βίντεο."
         'title "Xerox PARC Media Spaces"
         'license_text "Xerox PARC")

   "meetup"
   (hash 'image_url "/images/meetup.png"
         'caption "Τα ψηφιακά κοινωνικά δίκτυα μπορεί να φαίνεται ότι αντικαθιστούν τα πραγματικά, αλλά υπάρχουν και περιπτώσεις όπου τα ψηφιακά εργαλεία απλά διευκολύνουν τις πραγματικές συναντήσεις ομάδων που αυτό-οργανώνονται δυναμικά γύρω από έναν κοινό σκοπό ή ένα κοινό ενδιαφέρον. Η πρακτική αυτή μειώνει την ανάγκη για μεγάλες, διαχρονικά σταθερές, ιεραρχικές οργανώσεις."
         'title "Συναντήσεις οργανωμένες με το Meetup"
         'license_text "")

   "memex"
   (hash 'image_url "/images/memex.jpg"
         'caption "Το σχέδιο για έναν θεωρητικό μηχανικό υπολογιστή με το όνομα Memex, που επέτρεπε την ανάκτηση πληροφορίας από βιβλιοθήκες περιεχομένου σε ένα γραφείο, θεωρείται το αρχικό θεωρητικό πλαίσιο για το υπερκείμενο και το διαδίκτυο."
         'title "Υπερκείμενο και σημείωσεις με το Memex"
         'license_text "")

   "menu-bar-extras"
   (hash 'image_url "/images/menu-bar-extras.png"
         'caption ""
         'title "Μικροεφαρμογές στο μενού του κεντρικού παραθυρού "
         'license_text "Apple ")

   "menus-on-top"
   (hash 'image_url "/images/menus-on-top.png"
         'caption "Σε ένα παραθυρικό περιβάλλον εργασίας τα μενού μπορεί να βρίσκονται στην κορυφή της οθόνης, με αυτήν την επιλογή να είναι αντικειμενικά περισσότερο εργονομική προς τον χρήστη, χωρίς, όμως, να έχει κερδίσει την αντίστοιχη αποδοχή στην αγορά, αν και ήταν η πρώτη σχεδίαση που έγινε διαθέσιμη εμπορικά με τον Apple Macintosh."
         'title "Μενού στην κορυφή της οθόνης "
         'license_text "Wikipedia ")

   "menus-on-windows"
   (hash 'image_url "/images/menus-on-windows.png"
         'caption "Σε ένα παραθυρικό περιβάλλον εργασίας τα μενού μπορεί να βρίσκονται στην κορυφή των παραθύρων της εφαρμογής, το οποίο προσφέρει μια συνοχή, ειδικά όταν έχουμε πολλά ανοικτά, ορατά και επικαλυπτόμενα παράθυρα, αλλά, ταυτόχρονα, κάνει κάπως δυσκολότερη την επιλογή των μενού με τον δείκτη του ποντικιού. Αυτή η σχεδίαση είναι η πιο δημοφιλής, καθώς χρησιμοποιείται από τα Microsoft Windows και από πολλές εκδοχές στα παραθυρικά περιβάλλοντα του Linux, ενώ ήταν και η πρώτη που δοκιμάστηκε εργαστηριακά από τους σχεδιαστές του Apple Liza."
         'title "Μενού στην κορυφή των παραθύρων "
         'license_text "Wikipedia ")

   "messenger"
   (hash 'image_url "/images/messenger.jpg"
         'caption "Η αποδοχή του κοινωνικού δικτύου Facebook στις αρχές της δεκαετίας του 2010, από εκατοντάδες εκατομμύρια ανθρώπους σε όλον τον τεχνολογικά ανεπτυγμένο κόσμο, καθώς και η δημιουργία ξεχωριστής εφαρμογής Facebook Messenger για την ανταλλαγή μηνυμάτων, αποτελούν το πιο εμφανές παράδειγμα ότι η αντίληψη του υπολογιστή ως μέσο επικοινωνίας είναι εξίσου, αν όχι περισσότερο, σημαντική από την αρχική αντίληψη του υπολογιστή ως ένα απλό εργαλείο για την εργασία."
         'title "Εφαρμογή ανταλλαγής μηνυμάτων Messenger "
         'license_text "")

   "microsoft-basic"
   (hash 'image_url "/images/microsoft-basic.jpg"
         'caption "Για περισσότερο από μισή δεκαετία το βασικό προϊόν της Microsoft ήταν η γλώσσα προγραμματισμού BASIC για τους μικροϋπολογιστές της δεκαετίας του 1970, όπως ήταν ο Apple 2 και ο Commodore PET. Για αυτόν τον σκοπό, ο Paul Allen κατασκεύασε έναν εξομοιωτή του Altair για το DEC PDP-10, έτσι ώστε ο μεταγλωτιστής της Basic που κατασκεύασε ο Bill Gates να μπορεί να δοκιμαστεί και ας μην είχαν πρόσβαση στο πραγματικό υλικό του τελικού υπολογιστή. H τεχνογνωσία που είχε αναπτύξει για την μεταφορά της BASIC από τους κεντρικούς υπολογιστές στον Altair, μπορούσε να προσαρμοστεί σε μια μεγάλη γκάμα μικροϋπολογιστών. "
         'title "Microsoft BASIC "
         'license_text "inexhibit ")

   "microsoft-bob"
   (hash 'image_url "/images/microsoft-bob.jpg"
         'caption "Παράλληλα με την ανάπτυξη της επιφάνειας εργασίας, γίνονται προσπάθειες για την ανάπτυξη μιας διαλογικής διάδρασης. Η περίπτωση του Microsoft Bob δείνει ότι το αποτέλεσμα της ανθρωποκεντρικής σχεδίασης και των κανόνων σχεδίασης εξαρτάται και από το πλαίσιο χρήσης."
         'title "Έξυπνη διεπαφή Microsoft Bob"
         'license_text "Microsoft")

   "minecraft-end-user"
   (hash 'image_url "/images/minecraft-end-user.png"
         'caption "Η ιδέα να δημιουργούνται πίστες από τους τελικούς χρήστες δεν είναι καινούργια και έχει δοκιμαστεί με επιτυχία σε αρκετά παιχνίδια ως πρόσθετη λειτουργία. Το Minecraft είναι από την αρχή σχεδιασμένο με σκοπό οι τελικοί χρήστες να σχεδιάζουν τον εικονικό κόσμο."
         'title "Minecraft"
         'license_text "Microsoft")

   "minecraft-pi"
   (hash 'image_url "/images/minecraft-pi.jpg"
         'caption "Το RaspberryPi δημιουργήθηκε για να δώσει οικονομική πρόσβαση στον προγραμματισμό του υπολογιστή σε όσο γίνεται περισσότερους χρήστες και με ιδιαίτερη έμφαση στα παιδιά. Για αυτόν τον σκοπό, δεν περιλαμβάνει συσκευές εισόδου και εξόδου, αλλά παρέχει την δυνατότητα σύνδεσης τόσο με τα παραδοσιακές συσκευές όπως η οθόνη και το πληκτρολόγιο, αλλά και νέες συσκευές που μπορούν να εφευρεθούν μελοντικά."
         'title "MinecraftPi "
         'license_text "RaspberryPi Foundation")

   "minitel"
   (hash 'image_url "/images/minitel.jpg"
         'caption ""
         'title "Minitel "
         'license_text "")

   "mit-clearboard"
   (hash 'image_url "/images/mit-clearboard.jpg"
         'caption "Το σύστημα συνεργασίας Clearboard του MIT Media Lab προβάλλει το βίντεο δύο συνεργατών πάνω στην κοινή εφαρμογή ζωγραφικής, έτσι ώστε να υπάρχει σύγχρονη επίγνωση του βλέμματος και των χειρονομιών τους."
         'title "Clearboard "
         'license_text "MIT Media Lab")

   "mit-scratch"
   (hash 'image_url "/images/mit-scratch.png"
         'caption "Το περιβάλλον προγραμματισμού MIT Scratch έδωσε τη δυνατότητα σε πολλές ομάδες χρηστών, ακόμη και μικρών ηλικιών, να δημιουργήσουν εύκολα και χωρίς τυπική εκπαίδευση το δικό τους λογισμικό, το οποίο συνήθως έχει τη μορφή μιας διαδραστικής ιστορίας. Η ευχρηστία του βασίζεται στην οπτικοποίηση απλών εντολών με τη μορφή δομικών στοιχείων, τα οποία συνδέονται μεταξύ τους, αλλά αυτός ο τρόπος προγραμματισμού είναι μονοθεματικός και δεν επιτρέπει τη δημιουργία κλίμακας ούτε τη δημιουργία μεγαλύτερων συστημάτων."
         'title "Εκπαιδευτικό λογισμικό οπτικού προγραμματισμού "
         'license_text "Wikimedia ")

   "mixed-reality"
   (hash 'image_url "/images/mixed-reality.png"
         'caption ""
         'title "Φάσμα των τεχνολογιών μικτής πραγματικότητας "
         'license_text "wikimedia")

   "mobile"
   (hash 'image_url "/images/mobile.png"
         'caption "Τα κινητά, είτε με τη μορφή τηλεφώνου είτε με τη μορφή ταμπλέτας, γίνονται οι πιο δημοφιλείς υπολογιστές στα τέλη του 2010 και προσδιορίζουν ένα καινούριο σύνολο εφαρμογών χρήστη που έχουν να κάνουν με τη θέση του χρήστη και το ψηφιακό περιεχόμενο που δημιουργείται με την κάμερα."
         'title "Κινητός υπολογισμός "
         'license_text "")

   "mockups"
   (hash 'image_url "/images/mockups.jpg"
         'caption "Τα mock-ups είναι μια μεθόδος γρήγορης ανάπτυξης πρωτοτύπων που βοηθά τους σχεδιαστές διαδραστικών συστημάτων να μεταφέρουν ιδέες που έχουν σχεδιάσει αρχικά σε χαρτί ή διαφάνειες στον τρισδιάστατο πραγματικό χώρο, όπως για παράδειγμα η θέση των κουμπιών και της οθόνης για τη διεπαφή μιας κινητής συσκευής."
         'title "Προσχέδια διάδρασης "
         'license_text "")

   "moonlander"
   (hash 'image_url "/images/moonlander.png"
         'caption "Η πρώτη γραφική εκδοχή του πολύ δημοφιλούς βιντεοπαιχνιδιού κειμένου Lunar Lander, δημιουργήθηκε από την DEC με στόχο να διαφημίσει την οθόνη γραφικών. Εκτός από γραφικά, το παιχνίδι χρησιμοποιούσε μια πένα για την είσοδο, με την οποία ο παίκτης μπορούσε να καθορίσει σε πραγματικό χρόνο την γωνία και την ταχύτητα καθόδου για την προσγείωση.  "
         'title "Moonlander "
         'license_text "Wikipedia")

   "mouse-test-software"
   (hash 'image_url "/images/mouse-test-software.png"
         'caption "Οι σχεδιαστές νέων συσκευών διάδρασης αναπτύσσουν ειδικό λογισμικό προσομοίωσης των βασικών διεργασιών που θέλουν να επιτελεί η νέα συσκευή και το χρησιμοποιούν για να αξιολογήσουν με τη συμμετοχή των χρηστών εναλλακτικές λύσεις. Για το ποντίκι, οι δοκιμές με χρήστες αξιολογούν την επιτυχία και τον χρόνο εντοπισμού στόχων και μετακίνησης αντικειμένων και συγκρίνουν διαφορετικές σχεδιάσεις του υλικού και διαφορετικές ρυθμίσεις του λογισμικού."
         'title "Λογισμικό δοκιμών χρήστη για την συσκευή εισόδου ποντίκι "
         'license_text "Microsoft")

   "ms-dos"
   (hash 'image_url "/images/ms-dos.png"
         'caption "Η επιλογή της ΙΒΜ να αναθέσει την ανάπτυξη του λειτουργικού συστήματος για τον πρώτο προσωπικό υπολογιστή στην Microsoft, δημιούργησε μια εταιρεία ακόμη μεγαλύτερη, αλλά κυρίως έκανε τις έννοιες του λειτουργικού συστήματος και των εφαρμογών θεμελιώδεις για τους χρήστες αυτών των διαδραστικών συστημάτων. "
         'title "Microsoft DOS "
         'license_text "Wikepdia")

   "multimodal"
   (hash 'image_url "/images/multimodal.png"
         'caption "Η μελέτη των πολυτροπικών διαδράσεων ασχολείται με τον συνδυασμό διαφορετικών συστημάτων εισόδου και εξόδου για τη διάδραση με τον υπολογιστή, με στόχο να καλύψει τις ανάγκες χρηστών που δεν έχουν πρόσβαση, καθώς και πλαισίων χρήσης που δεν επιτρέπουν τον χειρισμό με το ποντίκι και το πληκτρολόγιο."
         'title "Πολυτροπική διάδραση "
         'license_text "")

   "myst"
   (hash 'image_url "/images/myst.jpg"
         'caption ""
         'title "Myst video game "
         'license_text "wikimedia")

   "napster"
   (hash 'image_url "/images/napster.jpg"
         'caption "Στα τέλη της δεκαετίας του 1990, η συμπίεση των αρχείων μουσικής σε σχετικά μικρά αρχεία και ο εύκολος συνεργατικός διαμοιρασμός τους στο δίκτυο με το λογισμικό Napster άλλαξε μέσα σε πολύ λίγα χρόνια το οικονομικό μοντέλο της διανομής της μουσικής και συνεχίζει να επηρεάζει τον τρόπο με τον οποίο διανέμονται όλα τα ψηφιακά αγαθά. Επομένως, η κατασκευή του λογισμικού διάδρασης δεν είναι απλά ένας ψηφιακός μετασχηματισμός των φυσικών διαδικασιών, αλλά ενδέχεται να επηρεάσει την ίδια τη φύση των παραδοσιακών οργανισμών."
         'title "Napster "
         'license_text "Wikipedia ")

   "ncsa-collage"
   (hash 'image_url "/images/ncsa-collage.jpg"
         'caption "Οι ερευνητές είχαν ήδη επιτραπέζια απομακρυσμένη πρόσβαση σε υπερ-υπολογιστές με την εφαρμογή Telnet και απέκτησαν σύγχρονη συνεργασία με την εφαρμογή NCSA Collage. Η συνεργατική εφαρμογή διευκόλυνε την ανάλυση δεδομένων και την οπτικοποίηση τους στους επιτραπέζιους υπολογιστές. Η πρόσθετη ανάγκη για διαμοιρασμό εγγράφων υπερκειμένου με σημειώσεις οδήγησε τελικά στην ανάπτυξη του NCSA Mosaic, ο οποίος αρχικά ήταν μια απλή λειτουργία κάτω από το μενού της συνεργασίας."
         'title "Εφαρμογή επιστημονικής συνεργασίας NCSA Collage "
         'license_text "")

   "ncsa-mosaic-annotations"
   (hash 'image_url "/images/ncsa-mosaic-annotations.png"
         'caption "Οι πρώτες εκδόσεις του περιηγητή ιστοσελίδων NCSA Mosaic είχαν την δυνατότητα συνεργατικών σημειώσεων πάνω στα έγγραφα. Η λειτουργία αυτή ήταν εμπνευσμένη από την αρχική εφαρμογή Nexus, αλλά τελικά οι κατασκευαστές προτίμησαν να ασχοληθούν με άλλες λειτουργίες της εφαρμογής."
         'title "Συνεργατικός σχολιασμός εγγράφων στον παγκόσμιο ιστό "
         'license_text "NCSA ")

   "ncsa-mosaic"
   (hash 'image_url "/images/ncsa-mosaic.jpg"
         'caption "Η εφαρμογή NCSA Mosaic δεν ήταν ούτε η πρώτη ούτε είχε τις καλύτερες προδιαγραφές, αλλά ήταν διαθέσιμη για όλα τα δημοφιλή επιτραπέζια συστήματα εκείνης της εποχής. Το αρχικό κίνητρο για την δημιουργία της ήταν η ενσωμάτωση στο σύστημα επιστημονικής συνεργασίας NCSA Collage, αλλά με την αύξηση της δημοτικότητας του παγκόσμιου ιστού, αυτή η επιμέρους εφαρμογή απόκτησε πρωταγωνιστική θέση για όλους τους χρήστες ακόμη και πέρα από τα ερευνητικά εργαστήρια. Μέσα σε λίγα μόνο χρόνια συστάθηκε ξεχωριστή εταιρεία για την ανάπτυξη της που τελικά εξελίχθηκε στον Netscape Navigator και στην δημιουργία μιας νέας μεγάλης κατηγορίας εφαρμογών για την περιήγηση στον παγκόσμιο ιστό."
         'title "Γραφική περιήγηση στον παγκόσμιο ιστό με το NCSA Mosaic "
         'license_text "")

   "ncsa-telnet"
   (hash 'image_url "/images/ncsa-telnet.jpg"
         'caption "Η εφαρμογή εικονικού τερματικού NCSA Telnet δημιουργήθηκε για να δώσει εύκολη πρόσβαση μέσω της γραμμής εντολών σε απομακρυσμένους υπερ-υπολογιστές. Η εφαρμογή αυτή βασιζόταν σε αποδεκτές προδιαγραφές επικοινωνίας και ήταν διαθέσιμη σε όλες πλατφορμές Unix, Mac, DOS, Windows, οπότε έγινε πολύ δημοφιλής και πέρα από την επιστημονική κοινότητα. "
         'title "Εφαρμογή τερματικού NCSA Telnet "
         'license_text "")

   "nelson-profile"
   (hash 'image_url "/images/nelson-profile.jpg"
         'caption "Το έργο του Ted Nelson αντανακλά την κατασκευή της διάδρασης, όπου υπάρχουν πολλές εναλλακτικές ιδέες για την οργάνωση και την οπτικοποίηση της πληροφορίας και τελικά επικρατούν κάποιες που ήταν ευκολότερο να υλοποιηθούν και να διαδοθούν γρήγορα ώστε να γίνουν οικείες. Ταυτόχρονα, η σύνθεση γνώσεων και δεξιοτήτων του Ted Nelson δείχνει τη δυσκολία του αντικειμένου, όπου απαιτούνται τόσο ανθρωπιστικές όσο και τεχνολογικές ιδιότητες. "
         'title "Ted Nelson "
         'license_text "The Transcopyright License ")

   "nls-chorded-code"
   (hash 'image_url "/images/nls-chorded-code.jpg"
         'caption "Το πληκτρολόγιο ακόρντων επιτρέπει την είσοδο 31 διαφορετικών κωδικών που καλύπουν όλο το λατινικό αλφάβητο ή μπορούν να αντιστοιχούν σε τροπικές κεντολές. Σε συνδυασμό με μια αποδοτική συσκευής επιλογής στόχων στην οθόνη όπως το ποντίκι με επιπλέον πλήκτρα για εντολές, δεν υπάρχει ανάγκη για το παραδοσιακό πληκτρολόγιο, ειδικά για την συχνή διεργασία της απλής επεξεργασίας έτοιμου κειμένου. Το σύστημα NLS είναι δύσκολο στην χρήση γιατί η ευχρηστία δεν προσφέρει κάποιο πλεονέκτημα σε ειδικούς που έχουν τακτική πρόσβαση και ασχολούνται με δύσκολα και ασαφή προβλήματα."
         'title "Πληκτρολόγηση κειμένου με ακόρντα "
         'license_text "Doug Engelbart Institute ")

   "nls-cscw"
   (hash 'image_url "/images/nls-cscw.jpg"
         'caption "Ο επεξεργαστής κειμένου στο NLS δεν σχεδιάστηκε για να γράφει κείμενο στα αρχεία ενός χρήστη, γιατί αυτό θα ήταν απλά μια κακή προσομοίωση της γραφομηχανής. Ο σκοπός αυτού του συστήματος διάδρασης είναι η συνεργασία πολλών χρηστών ταυτόχρονα πάνω σε ένα επαυξημένο έγγραφο, το οποίο επιτρέπει, εκτός από την είσοδο νέων δεδομένων, την πλοήγηση και την οπτικοποίηση διαφορετικών όψεων. Η συνεργασία μπορεί να γίνει τόσο με το πληκτρολόγιο, όσο και με τις χειρονομίες από τον δείκτη του ποντικιού, καθώς και με ταυτόχρονη προβολή βίντεο από τον χρήστη, με στόχο την επαύξηση της νοημοσύνης, μέσω της συνεργασίας ανθρώπων και υπολογιστών."
         'title "Συνεργασία με το σύστημα NLS "
         'license_text "Doug Engelbart Institute ")

   "nls-desk"
   (hash 'image_url "/images/nls-desk.jpg"
         'caption "Η πολύωρη παραμονή σε έναν σταθμό εργασίας έχει αρνητικές επιπτώσεις στον άνθρωπο, οι οποίες μπορούν να αμβλυνθούν με έναν πιο εργονομικό σχεδιασμό των συσκευών αλλά και του λογισμικού. Το σύστημα NLS βασίζεται σε ένα ειδικά ολοκληρωμένο με τον σταθμό εργασίας κάθισμα, καθώς και σε μία αποδοτική διάδραση για τον εκπαιδευμένο χρήστη, οπότε όλες αυτές οι παράμετροι θα πρέπει να αξιολογηθούν συνδυαστικά μαζί με την κατασκευή του λογισμικού διάδρασης. "
         'title "Εργονομική θέση εργασίας για το σύστημα NLS "
         'license_text "Doug Engelbart Institute")

   "nls-editor"
   (hash 'image_url "/images/nls-editor.jpg"
         'caption "Ο επεξεργαστής κειμένου του συστήματος NLS κάνει ένα σαφή διαχωρισμό ανάμεσα στην είσοδο κειμένου και στην επεξεργασία του, όπου το πρώτο γίνεται με το πληκτρολόγιο, ενώ το δεύτερο γίνεται με τον συνδυασμό του ποντικιού και του μικρού πληκτρολογίου ακόρντων. Με αυτόν τον τρόπο βελτιώνεται η εργονομία για πολύπλοκες διαδικασίες αφού ο χρήστης δεν χρειάζεται να πάρει τα χέρια του από τις συσκευές εισόδου. "
         'title "Επεξεργαστής κειμένου του NLS "
         'license_text "Doug Engelbart Organization ")

   "nls-floor"
   (hash 'image_url "/images/nls-floor.jpg"
         'caption "Μετά την εφεύρεση του λογισμικού και του υλικού διάδρασης, η ομάδα του NLS ασχολήθηκε με την οργάνωση της εργονομίας και του χώρου εργασίας, έτσι ώστε να διευκολύνεται η επαύξηση της συλλογικής νοημοσύνης. Για αυτόν τον σκοπό δοκίμασαν διάφορα είδη θέσης εργασίας, όπως το κάθισμα στο πάτωμα, καθώς και ανοιχτούς χώρους εργασίας, όπου οι άνθρωποι συνεργάζονται μεταξύ τους και μέσω της επαύξησης των υπολογιστών."
         'title "Οργάνωση του χώρου εργασίας "
         'license_text "Doug Engelbart Institute")

   "nls-group"
   (hash 'image_url "/images/nls-group.jpg"
         'caption "Το σύστημα NLS περιέχει μια σειρά από διαχρονικές τεχνολογίες, όπως το υπερκείμενο, τη διάδραση με το ποντίκι και την τηλεδιάσκεψη, οι οποίες δεν υλοποιήθηκαν απλά ως μια τεχνολογική παρουσίαση, αλλά γιατί ο συνδυασμός τους εξυπηρετεί τον μεγαλύτερο στόχο της συνεργασίας των ανθρώπων ώστε να κατανοήσουν πολύπλοκα προβλήματα. "
         'title "Επαύξηση της συλλογικής νοημοσύνης "
         'license_text "Doug Engelbart Institute ")

   "nls-input"
   (hash 'image_url "/images/nls-input.jpg"
         'caption "Η εφεύρεση και η τελική επιλογή της συσκευής εισόδου ποντίκι για το σύστημα NLS δεν ήταν τυχαία, αλλά βασιζόταν σε μια συγκριτική αξιολόγηση εναλλακτικών συσκευών εισόδου. Για τον σκοπό αυτό, δοκίμασαν τις επιδόσεις των χρηστών με πολλές διαφορετικές συσκευές εισόδου, όπως ήταν η πένα, ο τροχός κύλισης, ο κατευθυντικός μοχλός, καθώς και διεπαφές για τα πόδια και το κεφάλι, αλλά το ποντίκι ήταν καλύτερο σε ακρίβεια και ταχύτητα."
         'title "Αξιολόγηση εναλλακτικών συσκευών εισόδου "
         'license_text "Doug Engelbart Institute ")

   "nls-mouse"
   (hash 'image_url "/images/nls-mouse.jpg"
         'caption "Οι χειριστές του NLS, μετά από μερικές ώρες εκπαίδευσης, μπορούν να χρησιμοποιήσουν το πληκτρολόγιο ακόρντων σε συνδυασμό με το ποντίκι τριών πλήκτρων για να κάνουν επεξεργασία κειμένου και πληκτρολόγηση νέων λέξεων, χωρίς να μετακινήσουν τα χέρια τους στο κεντρικό πληκτρολόγιο. Με αυτόν τον τρόπο, εκτός από την ταχύτητα εκτέλεσης της διεργασίας, μειώνεται και η επιβάρυνση των χεριών που είναι σημαντική για όποιον χρησιμοποιεί τέτοια συστήματα μερικές ώρες κάθε μέρα. "
         'title "Ποντίκι με τρία πλήκτρα"
         'license_text "Doug Engelbart Institute")

   "nls-radar-keypad"
   (hash 'image_url "/images/nls-radar-keypad.jpg"
         'caption "Το σύστημα NLS που παρουσιάστηκε τελικά είχε ποντίκι με τρία κουμπιά, ακόρντα πέντε πλήκτρων και ορθογώνια οθόνη. Μερικά χρόνια νωρίτερα η ερευνητική ομάδα ξεκίνησε με το διαθέσιμο υλικό εκείνης της εποχής, που ήταν η στρογγυλή οθόνη του ραντάρ και ένα χειροποίητο ποντίκι με ένα πλήκτρο, έτσι ώστε να κατασκευάσει μια πρώτη έκδοση για το λογισμικό διάδρασης και να διαπιστώσει στην πράξη ποιες αλλαγές απαιτούνται για την επόμενη έκδοση των συσκευών διάδρασης σε μια επαναλληπτική διαδικασία σχεδίασης."
         'title "Ελάχιστο εφικτό σύστημα NLS "
         'license_text "Doug Engelbart Institute ")

   "nomodes"
   (hash 'image_url "/images/nomodes.png"
         'caption "Η διάδραση με έναν επεξεργαστή κειμένου γινόταν αρχικά με την επιλογή κατάστασης λειτουργίας όπως είναι η εισαγωγή κειμένου και οι εντολές αναζήτησης και αποθήκευσης. Ο τρόπος αυτός, αν και παραμένει αποδεκτός από τους προχωρημένους χρήστες, αποτέλεσε εμπόδιο για τους αρχάριους χρήστες, το οποίο οδήγησε τον Larry Tesler να προσθέση σχετική αναφορά στην πινακίδα του αυτοκινήτου του, καθώς και στην ονομασία της προσωπικής ιστοσελίδας του."
         'title "Μη τροπική διάδραση "
         'license_text "Larry Tesler")

   "norton-commander"
   (hash 'image_url "/images/norton-commander.png"
         'caption "Ο κεντρικός ρόλος των αρχείων στα περισσότερα δημοφιλή λειτουργικά συστήματα φαίνεται και από την αποδοχή που έχουν οι αντίστοιχες εφαρμογές διαχείρισης αρχείων. Ο διαχειριστής αρχείων αρχικά βασιζόταν μόνο σε μια διεπαφή κειμένου για να διευκολύνει τις βασικές εντολές πάνω στα αρχεία ενός συστήματος. "
         'title "Norton Commander "
         'license_text "Wikepdia")

   "note-taker"
   (hash 'image_url "/images/note-taker.jpg"
         'caption "Η πρώτη προσπάθεια υλοποίησης του οράματος του Dynabook σε υλικό φορητού μεγέθους πήρε την μορφή του Note Taker, ο οποίος είχε το μέγεθος μεγάλης βαλίτσας με το πληκτρολόγιο να κλειδώνει πάνω στην κεντρική μονάδα, ώστε να μπορεί να μεταφερθεί. Αν και αυτή η υλοποίηση δεν βγήκε στην παραγωγή, η σχεδίαση του επηρέασε την σχεδίαση των Osborne, Compaq που ακολούθησαν μερικά χρόνια αργότερα. "
         'title "Xerox Note Taker "
         'license_text "History Computer ")

   "notifications"
   (hash 'image_url "/images/notifications.png"
         'caption ""
         'title "Υπενθυμίσεις κινητού υπολογισμού "
         'license_text "")

   "nova"
   (hash 'image_url "/images/nova.jpg"
         'caption "Ακόμη και ο μικρότερος μίνι-υπολογιστής στα τέλη της δεκαετίας του 1960 δεν μοιάζει καθόλου με ένα επιτραπέζιο σύστημα διάδρασης, αφού το βασικό μοντέλο έχει μόνο διακόπτες με φωτάκια και με μια επέκταση μπορεί να συνδεθεί σε έναν τηλέτυπο. Αυτό δεν ήταν εμπόδιο για τους ερευνητές του Xerox PARC, οι οποίοι με την τεχνική της εξομοίωσης άρχισαν πάνω σε αυτό το μηχάνημα την κατασκευή του λογισμικού για το Alto που είναι πολύ διαφορετικό, αφού βασίζεται στο ποντίκι και στη γραφική διεπαφή. "
         'title "Data General Nova "
         'license_text "Wikimedia ")

   "oberon"
   (hash 'image_url "/images/oberon.png"
         'caption "Το σύστημα Oberon βασίζεται στις ιδέες του Xerox Cedar και δίνει έμφαση στην εκπαιδευτική κοινότητα με στόχο ένας χρήστης να μπορεί να κατανοήσει την λειτουργία της διάδρασης πλήρως και χωρίς να γίνονται διακρίσεις ανάμεσα σε γλώσσα προγραμματισμού, λειτουργικό σύστημα, και εφαρμογές. Για αυτόν τον σκοπό, χρησιμοποιεί την γλώσσα προγραμματισμού Oberon στην οποία είναι γραμμένο όλο το σύστημα και η διάδραση βασίζεται σε έναν συνδυασμό γραφικής διεπαφής και γραμμής εντολών."
         'title "Oberon "
         'license_text "Niklaus Wirth ")

   "office-schematic"
   (hash 'image_url "/images/office-schematic.png"
         'caption "Ίσως το πιο διάσημο πρωτότυπο χαμηλής πιστότητας να είναι το σχεδιάγραμμα της γραφικής επιφάνειας εργασίας που έγινε σε μια χαρτοπετσέτα από τους ερευνητές του Xerox PARC και χρησιμοποιούσε τη μεταφορά του γραφείου για την απεικόνιση των διεπαφών."
         'title "Αρχικό προσχέδιο της επιφάνειας εργασίας "
         'license_text "Xerox PARC")

   "olpc-classroom"
   (hash 'image_url "/images/olpc-classroom.jpg"
         'caption "Το πρόγραμμα OLPC (One Laptop Per Child) προσπαθεί να δώσει έναν φορητό υπολογιστή στα παιδιά από τις αναπτυσόμενες χώρες, με το όραμα να αυξηθούν οι ευκαιρίες τους στην εκπαίδευση και στα παγκόσμια κοινά."
         'title "Ένας φορητός υπολογιστής για κάθε παιδί "
         'license_text "wikimedia")

   "open-street-map"
   (hash 'image_url "/images/open-street-map.jpg"
         'caption "Η λογική της συμμετοχικής δημιουργίας και συντήρησης σημαντικού περιεχομένου, όπως στην εγκυκλοπαίδεια Wikipedia, εφαρμόστηκε με επιτυχία και σε άλλους τομείς, όπως οι χάρτες, οι οποίοι σε μια περίπτωση φυσικής καταστροφής ενημερώθηκαν πιο γρήγορα και πιο αποτελεσματικά από τους αντίστοιχους ιδιωτικούς."
         'title "Ψηφιακοί γεωγραφικοί χάρτες ανοιχτού κώδικα "
         'license_text "OpenStreetMap ")

   "osborne1"
   (hash 'image_url "/images/osborne1.jpg"
         'caption "Ένας από τους πρώτους φορητούς προσωπικούς υπολογιστές είχε μέγεθος βαλίτσας και ήταν σχεδιασμένος να χωράει κάτω από ένα αεροπορικό κάθισμα. Αν και δεν ήταν πραγματικά φορητός, συνοδευόταν από πλήρες λογισμικό, όπως τον επεξεργαστή κειμένου WordStar, φύλλο εργασίας, και το λειτουργικό σύστημα CPM, δίνοντας έτσι ένα προσωπικό σύστημα για δουλειές γραφείου. "
         'title "Osborne 1 "
         'license_text "Wikipedia ")

   "p2p"
   (hash 'image_url "/images/p2p.jpg"
         'caption "Η εφαρμογή Napster ήταν η πρώτη σε μια μεγάλη σειρά δημοφιλών εφαρμογών που ακολούθησαν και μετασχημάτισαν κοινωνικές και οικονομικές διαδικασίες, όπως τα Skype, Uber, AirBnB, και τα οποία δημιουργούν μια διεπαφή που επιτρέπει στους τελικούς χρήστες να μοιράζονται μεταξύ τους πόρους χωρίς ενδιάμεσες ιεραρχίες, ενώ σε όλες τις περιπτώσεις η τεχνολογία ήταν μόνον η αναγκαία συνθήκη."
         'title "Napster και οικονομία διαμοιρασμού"
         'license_text "")

   "panorama"
   (hash 'image_url "/images/panorama.jpg"
         'caption "Η δημιουργία πανοραμικών φωτογραφιών ήταν μια απαιτητική διαδικασία στην παραδοσιακή και στην ψηφιακή φωτογραφία, αφού έπρεπε να γίνουν ξεχωριστές αλλά συντονισμένες λήψεις σε διαφορετικές χρονικές στιγμές· μέχρι που τα έξυπνα κινητά έδωσαν τη δυνατότητα της επιτόπου εκτέλεσης μιας διαδραστικής εφαρμογής που διευκολύνει τον χρήστη στη δημιουργία πανοραμικής φωτογραφίας απευθείας στη συσκευή του, χάρη στον αισθητήρα κίνησης και στις δυνατότητες απεικόνισης και υπολογισμού του κινητού."
         'title "Αλληλεπίδραση με λήψη πανοραμικής φωτογραφίας "
         'license_text "")

   "paper-simulation"
   (hash 'image_url "/images/paper-simulation.jpg"
         'caption "Καθώς η εταιρεία Xerox ασχολείται διαχρονικά με το φυσικό χαρτί και τις εκτυπώσεις, οι πελάτες της είναι, κυρίως, εκδοτικοί οργανισμοί και γενικά άτομα που εργάζονται στο γραφείο με έγγραφα που αποθηκεύονται σε φυσικό χαρτί. Με αυτόν τον τρόπο, όλες οι καινοτομίες του Alto μεταφέρθηκαν στο Star, δίνοντας έμφαση στη δυνατότητα προσομοίωσης του φυσικού χαρτιού στην οθόνη του υπολογιστή και γενικά στην επιφάνεια εργασίας με τις αντίστοιχες μεταφορές από το φυσικό γραφείο. "
         'title "Η επιφάνεια εργασίας ως προσομοίωση του φυσικού χαρτιού "
         'license_text "Xerox")

   "pdp1-mini"
   (hash 'image_url "/images/pdp1-mini.jpg"
         'caption "Ο PDP1 της DEC ήταν ο πρώτος υπολογιστής της σειράς PDP (Programmed Data Processor). Ήταν πολύ πιο μικρός από τους προηγούμενους υπολογιστές αφού χωρούσε σε λιγότερο από ένα μεγάλο δωμάτιο, ενώ παράλληλα ήταν αρκετά οικονομικός για να κατασκευαστεί και να αγοραστεί από μερικές δεκάδες ερευνητικά κέντρα και εταιρείες. Το όνομα του δεν κάνει αναφορά στην έννοια του υπολογιστή, αφού οι υπεύθυνοι της DEC θεωρούσαν ότι αυτό είναι μια νέα φόρμα που μπορεί να κάνει περισσότερα πράγματα από απλούς υπολογισμούς, όπως είναι η επεξεργασία και ανάλυση δεδομένων. Πράγματι, χρησιμοποιήθηκε πολύ σύντομα για την κατσκευή του πρώτου βιντεοπαιχνιδιού, επεξεργαστή κειμένου, και άλλων εφαρμογών χρήστη με μεγαλύτερη έμφαση στην διαδραστική λειτουργία αντί για την εκτέλεση εντολών δέσμης."
         'title "Μίνι υπολογιστής PDP1 "
         'license_text "Courtey of Wikimedia ")

   "pdp1-tmrc"
   (hash 'image_url "/images/pdp1-tmrc.jpg"
         'caption "Οι τεχνολογικές εφευρέσεις του Spacewar και του Sketchpad χρωστούν πολλά στις άτυπες κοινότητες τεχνολογικής συνεργασίας στα πανεπιστήμια. Ειδικά οι κοινότητες μοντελοποίησης τρένων είχαν τόσο τις τεχνολογικές δεξιότητες, αλλά και τη δημιουργικότητα που απαιτείται για την κατασκευή νέου υλικού και λογισμικού, όπως τα χειριστήρια του Spacewar και η αλληλεπίδραση σε πραγματικό χρόνο πάνω στην οθόνη του Spacewar."
         'title "Κοινότητες τεχνολογικής συνεργασίας"
         'license_text "Computer History Museum ")

   "pdp11-tty-unix"
   (hash 'image_url "/images/pdp11-tty-unix.jpg"
         'caption "Ο μίνι-υπολογιστής PDP11 της DEC θεωρείται κομβικό σημείο, γιατί ήταν πολύ δημοφιλής σε πανεπιστήμια και ερευνητικά κέντρα, όπου χρησιμοποιήθηκε για την διάδοση του λειτουργικού συστήματος UNIX, της γλώσσας προγραμματισμού C και, κυρίως, των εξομοιωτών που επέτρεψαν την ανάπτυξη νέων συστημάτων για τους μικρο-υπολογιστές που αναπτύχθηκαν στο τέλος της δεκαετίας του 1970 και έφεραν τον υπολογισμό στα σπίτια και στους απλούς χρήστες."
         'title "Μίνι υπολογιστής PDP11 "
         'license_text "Courtey of Wikimedia ")

   "pebble-buck"
   (hash 'image_url "/images/pebble-buck.png"
         'caption "Το Arduino στη βασική του μορφή χρησιμοποιείται κατά το στάδιο της ανάπτυξης λειτουργικών υποδειγμάτων υψηλής πιστότητας για νέα συστήματα διάδρασης, όπως το έξυπνο ρολόϊ pebble, αφού επιτρέπει τον γρήγορο έλεγχο, ενώ διευκολύνει και τη μετάβαση στην παραγωγή, καθώς το κύκλωμά του είναι ελεύθερα διαθέσιμο για χρήση και μετατροπή."
         'title "Λειτουργικό υπόδειγμα για έξυπνο ρολόϊ "
         'license_text "")

   "personas"
   (hash 'image_url "/images/personas.jpg"
         'caption "Η περιγραφή αντιπροσωπευτικών χρηστών (personas) επιτρέπει στους σχεδιαστές να μπουν στη θέση των χρηστών και σε συνδυασμό με τα τεκμήρια από την τεχνική της πολιτισμικής διερεύνησης δίνει μια εικόνα για τους χρήστες και τον κόσμο τους."
         'title "Αντιπροσωπευτικοί χρήστες "
         'license_text "")

   "plan9-install"
   (hash 'image_url "/images/plan9-install.png"
         'caption "Το Plan 9 αποτελεί μια συστηματική προσπάθεια πολλών δεκαετίων για την βελτίωση του Unix, από τους ίδιους κατασκευαστές. Τελικά όμως η κοινότητα των τελικών χρηστών επιλέγει την οικειότητα που προσφέρει το παλιότερο σύστημα Unix και προτιμάει να κάνει προσθήκες και επεκτάσεις σε μια εύθραυστη και παρωχημένη αρχιτεκτονική, επιβεβαιώνοντας για μια ακόμη φορά ότι η οικειότητα και η συνήθεια είναι περισσότερο σημαντικές από την ορθότητα στις τεχνολογίες λογισμικού διάδρασης."
         'title "Λειτουργικό Σύστημα Plan 9 "
         'license_text "MIT License")

   "plan9-shell"
   (hash 'image_url "/images/plan9-shell.png"
         'caption "Η γραμμή εντολών για το Plan 9 βασίζεται στην λογική της αντίστοιχης για το Unix, από τους ίδιους κατασκευαστές, αλλά γίνοται βελτιώσεις. Το rc είναι απλούστερο και περισσότερο συνεπές με τον συνολικό σχεδιασμό του λειτουργικού συστήματος. Για παράδειγμα οι μεταβλητές είναι συμβολοσειρές και οι εντολές δεν σαρώνονται δεύτερη φορά."
         'title "Γραμμή εντολών Plan 9 "
         'license_text "Lucent Public License")

   "plato-emoticons"
   (hash 'image_url "/images/plato-emoticons.jpg"
         'caption "Τα πρώτα emoticons δημιουργήθηκαν με το εκπαιδευτικό σύστημα PLATO αρκετά πριν δημιουργηθούν τα αντίστοιχα με την σειριακή παράθεση συμβόλων. Το σύστημα PLATO είχε την δυνατότητα της επεξεργασίας των προηγούμενων χαρακτήρων στο τερματικό, οπότε οι χρήστες δημιούργησαν πολλά διαφορετικά σύμβολα με την τομή των βασικών χαρακτήρων."
         'title "PLATO emoticons "
         'license_text "")

   "plato4"
   (hash 'image_url "/images/plato4.jpg"
         'caption ""
         'title "PLATO IV "
         'license_text "UoI Library Archives ")

   "pong"
   (hash 'image_url "/images/pong.jpg"
         'caption "Το Pong αποτελεί μια βελτιωμένη εκδοχή του πρόσφατου τότε Table Tennis for Two, στο οποίο προσθέτει καλύτερη κίνηση και γίνεται γρήγορα δημοφιλές αρχικά στις δημόσιες κονσόλες βιντεοπαιχνιδιών και λίγο αργότερα στους πρώτους οικιακούς μικρο-υπολογιστές. Tο Pong με τη σειρά του έδωσε την έμπνευση για την δημιουργία του Breakout και τη δημιουργία της βιομηχανίας των βιντεοπαιχνιδιών, η οποία ήταν μια νέα κατηγορία τέχνης και εμπορικής δραστηριότητας. "
         'title "Pong "
         'license_text "Wikipedia ")

   "pop"
   (hash 'image_url "/images/pop.jpg"
         'caption "Το Prince of Persia δημιουργήθηκε από έναν μόνο ερασιτέχνη κατασκευαστή που ϋοθέτησε την ροτοσκοπική κινηματογραφιή τεχνική για να πετύχει φυσική κίνηση των γραφικών τα οποία αναπτύχθηκαν απευθείας με γλώσσα μηχανής. Τόσο το αρχικό λογισμικό, όσο και τα επόμενα, καθώς και οι συνέχειες που δημιουργήθηκαν αποτελούν σημείο αναφοράς για τρεις δεκαετίες, αλλά και για την ωρίμανση του κλάδου που εξάγει πλέον ιδέες προς τις παραδοσιακές ταινίες και βιβλία. "
         'title "Prince of Persia "
         'license_text "Wikimedia ")

   "power-glove"
   (hash 'image_url "/images/power-glove.jpg"
         'caption "Το πρώτο προσιτά οικονομικό και ευρέως διαθέσιμο γάντι διάδρασης είχε πολλά προβλήματα και λίγο διαθέσιμο λογισμικό, αλλά αυτό δεν εμπόδισε πολλούς προχωρημένους χρήστες να το προσαρμόσουν σε διαφορετικές εφαρμογές πέρα από τα βίντεοπαιχνίδια για τα οποία κατασκευάστηκε. "
         'title "Mattel PowerGlove "
         'license_text "Mattel")

   "predictive-text"
   (hash 'image_url "/images/predictive-text.png"
         'caption "Η διάδοση της αποστολής σύντομων μηνυμάτων κειμένου την δεκαετία του 1990 δημιούργησε την ανάγκη για μια αποδοτικότερη μέθοδο συγγραφής κειμένου με την χρήση πληκτρολογίου που είχε μόνο αριθμούς. Για αυτόν τον σκοπό δημιουργήθηκαν τεχνολογίες όπως το T9, το οποίο με την χρήση ενός λεξικού για την γλώσσα συγγραφής προβάλει την πιο πιθανή λέξη που ξεκινάει από τους πρώτους χαρακτήρες που έχει ήδη πατήσει ο χρήστης, έτσι ώστε τελικά να μην χρειαστεί να πατήσει και τους υπόλοιπους. "
         'title "Προγνωστική είσοδος κειμένου "
         'license_text "Wikimedia ")

   "printed-code"
   (hash 'image_url "/images/printed-code.jpg"
         'caption "Πριν την εξάπλωση του δικτύου και των μέσων αποθήκευσης, ο βασικός τρόπος διαμοιρασμού του λογισμικού ήταν σε πηγαίο κώδικα, τυπωμένο σε χαρτί περιοδικού ή βιβλίου, τα οποία ο χρήστης θα μελετούσε και μετά θα πληκτρολογούσε στον μικρο-υπολογιστή του. Αν και η διαδικασία αυτή φαίνεται κάπως ξεπερασμένη, φαίνεται ότι είχε το πλεονέκτημα μια αίσθησης ιδιοκτησίας, καθώς και μιας έμμεσης ενθάρρυνσης για σκόπιμες ή ακούσιες μετατροπές, οι οποίες τελικά λειτουργούσαν θετικά για τις γνώσεις και τις δεξιότητες του χρήστη. "
         'title "Διαμοιρασμός κώδικα με βιβλία και περιοδικά "
         'license_text " David H. Ahl ")

   "probes-analysis"
   (hash 'image_url "/images/probes-analysis.jpg"
         'caption "Η ανάλυση των αντικειμένων που επιστρέφουν οι χρήστες σε έναν φάκελο πολιτισμικής διερεύνησης δεν έχει σκοπό τον απευθείας καθορισμό των αναγκών τους, αλλά τη δημιουργία ενός πλαισίου ώστε οι σχεδιαστές να δημιουργήσουν προδιαγραφές συμβατές με τον κόσμο όπου κινείται ο χρήστης. "
         'title "Ανάλυση Πολιτισμικής Διερεύνησης "
         'license_text "")

   "probes-items"
   (hash 'image_url "/images/probes-items.jpg"
         'caption "Η τεχνική της πολιτισμικής διερεύνησης βασίζεται σε απλά αντικείμενα καθημερινής χρήσης (π.χ., φωτογραφική μηχανή, ημερολόγιο, σημειώσεις, κτλ.) που μπορούν εύκολα να ενσωματώσουν στη ζωή τους οι άνθρωποι που συμμετέχουν στις αντίστοιχες έρευνες."
         'title "Φάκελος Πολιτισμικής Διερεύνησης "
         'license_text "")

   "processing-ide"
   (hash 'image_url "/images/processing-ide.png"
         'caption "Το περιβάλλον ανάπτυξης Processing μοιάζει σκόπιμα με μια εφαρμογή εκτέλεσης αρχείων πολυμέσων. Τα προγράμματα ονομάζονται σχεδιαγράμματα, έτσι ώστε να ενθαρρύνουν την συνεχή αλλαγή τους."
         'title "Ολοκληρωμένο περιβάλλον ανάπτυξης για νέους προγραμματιστές"
         'license_text "Processing Foundation")

   "programming-example"
   (hash 'image_url "/images/programming-example.jpg"
         'caption "Το σύστημα SmallStar επιτρέπει τη δημιουργία νέου λογισμικού χωρίς τη χρήση γλώσσας προγραμματισμού με κείμενο για τη ροή εκτέλεσης. Για τον σκοπό αυτό, ο χρήστης κάνει εγγραφή της αλληλεπίδρασης με τη διεπαφή και συμπληρώνει φόρμες στα σημεία όπου υπάρχει ασάφεια. "
         'title "Κατασκευή λογισμικού διάδρασης με παραδείγματα "
         'license_text "Xerox PARC")

   "prototype-evaluation"
   (hash 'image_url "/images/prototype-evaluation.jpg"
         'caption "H αξιολόγηση πρωτοτύπων σε δοκιμές με χρήστες είναι μια από τις σημαντικότερες δραστηριότητες του προγραμματισμού της διάδρασης καθώς μας βοηθά να κατανοήσουμε καλύτερα και να ορίσουμε τις ανάγκες ενός χρήστη ή μιας ομάδας χρηστών."
         'title "Αξιολόγηση διαδραστικού πρωτοτύπου "
         'license_text "yougenics")

   "prototype-levels"
   (hash 'image_url "/images/prototype-levels.png"
         'caption "Η κατασκευή πρωτοτύπου περιλαμβάνει πολλά διαφορετικά επίπεδα και τεχνικές, όπως φαίνεται και στο σχήμα, αν και τα επίπεδα αυτά έχουν επικαλύψεις και οι διαχωριστικές γραμμές δεν είναι πάντα τόσο εμφανείς κατά τη μετάβαση από το ένα στάδιο στο επόμενο."
         'title "Επίπεδα κατασκευής πρωτοτύπου "
         'license_text "")

   "prototype-lifecycle"
   (hash 'image_url "/images/prototype-lifecycle.png"
         'caption "Ανάλογα με τη φάση σχεδίασης και ανάπτυξης υπάρχουν διαφορετικά είδη πρωτοτύπου που μπορούμε να κατασκευάσουμε, τα οποία μπορούμε να οργανώσουμε ανάλογα με την πιστότητα που έχουν αναφορικά με τη λειτουργικότητά τους ως προς τη διάδραση με τον χρήστη."
         'title "Κύκλος ζωής του διαδραστικού πρωτοτύπου "
         'license_text "")

   "prototype-types"
   (hash 'image_url "/images/prototype-types.png"
         'caption "Το οριζόντιο πρωτότυπο της διεπαφής με τον χρήστη δίνει μια συνολική εικόνα του συστήματος από την πλευρά του χρήστη, αλλά δεν είναι πραγματικά λειτουργικό, όπως είναι ένα κατακόρυφο πρωτότυπο, το οποίο όμως υλοποιεί μόνο ένα μικρό μέρος της λειτουργικότητας του συστήματος."
         'title "Τα είδη του διαδραστικού πρωτοτύπου "
         'license_text "")

   "pull-down-menus"
   (hash 'image_url "/images/pull-down-menus.jpg"
         'caption "Η προσθήκη πολλαπλών παραθύρων στην γραφική διεπαφή του Apple Liza οδήγησε στην μεταφορά των μενού επιλογών από το κάτω μέρος της οθόνης στο πάνω περιθώριο του κάθε παραθύρου από όπου ο χρήστης με ένα κλικ τραβούσε και έβλεπε να ξεδιπλώνονται οι επιμέρους επιλογές του κάθε μενού. Αν και αυτή η σχεδίαση παραμένει δημοφιλής στα γραφικά περιβάλλοντα Windows και Linux, η υλοποίηση αυτή ήταν ένα ενδιάμεσο στάδιο πριν την μεταφορά του μενού σε μια ζώνη στην κορυφή της οθόνης."
         'title "Τράβηγμα και ξεδίπλωμα του μενού επιλογών πάνω στο παράθυρο"
         'license_text "")

   "pygmalion"
   (hash 'image_url "/images/pygmalion.jpg"
         'caption "Το σύστημα Pygmalion, στα μέσα της δεκαετίας του 1970, ήταν εκείνο που έδωσε τον ορισμό για τα εικονίδια, αλλά, κυρίως, ήταν το πρώτο που επέτρεψε τη δημιουργία λογισμικού με βάση την τελική συμπεριφορά και το αποτέλεσμα που πρέπει να έχει ένα πρόγραμμα υπολογιστή (αντί της κυρίαρχης πρακτικής που ήταν να δίνουμε οδηγίες στο πρόγραμμα για το τι ακριβώς να κάνει)."
         'title "Pygmalion"
         'license_text "David Canfield Smith ")

   "qwerty-typewriter"
   (hash 'image_url "/images/qwerty-typewriter.jpg"
         'caption ""
         'title "Πληκτρολόγιο QWERTY "
         'license_text "Creative Commons CC0")

   "rand-tablet"
   (hash 'image_url "/images/rand-tablet.jpg"
         'caption "Η πένα έχει το πλεονέκτημα σε σχέση με το ποντίκι ότι μπορεί να χρησιμοποιηθεί και ως συσκευή έμμεσης διάδρασης με τη βοήθεια μιας επιφάνειας ευαίσθητης στη μύτη της πένας και χωρίς να υπάρχει η ανάγκη αυτή η επιφάνεια να είναι οθόνη."
         'title "RAND tablet "
         'license_text "RAND")

   "raskin-profile"
   (hash 'image_url "/images/raskin-profile.jpg"
         'caption "Ο Jef Raskin είναι από τους λίγους κατασκευαστές της διάδρασης που συνδύασε μια ανθρωποκεντρική φιλοσοφία με την πρακτική εφαρμογή σε ένα προϊόν επεξεργασίας κειμένου. Το αποτέλεσμα αυτής της προσπάθειας αποτελεί παράδειγμα προς μίμηση και ταυτόχρονα μας θυμίζει ότι τα περισσότερα πετυχημένα εμπορικά προϊόντα δεν εξυπηρετούν την αντικειμενική ευχρηστία, αλλά μόνο μια βολική συνήθεια των χρηστών και τα συμφέροντα των κατασκευαστών. "
         'title "Jef Raskin "
         'license_text "Jef Raskin")

   "raspberrypi"
   (hash 'image_url "/images/raspberrypi.jpg"
         'caption "To RaspberryPi είναι ένας μικρός σε μέγεθος και προσιτός οικονομικά υπολογιστής, με έμφαση στην εκμάθηση προγραμματισμού από νέους χρήστες και ειδικά από παιδιά. Για αυτόν τον σκοπό, δεν περιλαμβάνει συσκευές εισόδου και εξόδου, αλλά συνδέεται απευθείας στην τηλεόραση του χρήστη. Η δυνατότητα του για διασύνδεση με εξωτερικές συσκευές τον έκανε δημοφιλή πέρα από την εκπαίδευση σε πολλούς χομπίστες καθώς και στο διαδίκτυο των πραγμάτων."
         'title "Raspberry Pi"
         'license_text "")

   "reactable-fountain"
   (hash 'image_url "/images/reactable-fountain.jpg"
         'caption "Το διαφορετικό πλαίσιο χρήσης και οι διαφορετικές ανάγκες των χρηστών του Reactable οδήγησαν τους σχεδιαστές στην κατασκευή ενός προσομοιωτή για μια νέα κατηγορία εφαρμογών, η οποία εκτός από τη μουσική χρησιμοποιείται και αλλού, όπως στον έλεγχο της ροής του νερού και των φωτιστικών εφέ για ένα συντριβάνι στην Βαρκελώνη."
         'title "Διαδραστικό συντριβάνι με το Reactable "
         'license_text "Sergi Jorda ")

   "reactable-music"
   (hash 'image_url "/images/reactable-music.jpg"
         'caption "Το ηλεκτρονικό μουσικό όργανο Reactable βασίζεται σε μια δημιουργική σύνθεση υλικού και λογισμικού, η οποία είναι εύκολα διαθέσιμη και η οποία παρότι ξεκίνησε ως ερευνητικό έργο σε ένα πανεπιστήμιο δεν άργησε να βρει αποδοχή από τη μουσική αγορά."
         'title "Reactable"
         'license_text "Reactable ")

   "reactivision-simulator"
   (hash 'image_url "/images/reactivision-simulator.png"
         'caption "Ο προσομοιωτής για το πολυαπτικό σύστημα Reactable επιτρέπει στον κατασκευαστή να δοκιμάσει τη διάδραση στον επιτραπέζιο υπολογιστή ανάπτυξης, αλλά σίγουρα δεν μπορεί να δοκιμάσει εκείνες τις νέες χειρονομίες που δεν μπορούν να προσομοιωθούν από το ποντίκι, όπως τις χειρονομίες που απαιτούν πολλά δάκτυλα ή και τα δύο χέρια για τον χειρισμό των αντικειμένων, όπως στην περίπτωση πολλών χρηστών."
         'title "Προσομοιωτής Reactivision"
         'license_text "Reactivision")

   "relational-agent"
   (hash 'image_url "/images/relational-agent.jpg"
         'caption "Ο ανθρωπομορφισμός αρχικά χρησιμοποιήθηκε για να βελτιώσει τη φιλικότητα της διάδρασης με τον υπολογιστή. Στην πορεία δοκιμάστηκε και ως ένας τρόπος να αυξηθεί η πειστικότητα των συμβουλών του υπολογιστή προς έναν χρήστη που θέλει να βελτιώσει τον τρόπο ζωής του."
         'title "Ανθρωπομορφισμός και έξυπνες διεπαφές "
         'license_text "MIT")

   "rio-window-system"
   (hash 'image_url "/images/rio-window-system.png"
         'caption "Οι δημιουργοί του Unix παρακολουθούν τις τεχνολογικές εξελίξεις της δεκαετίας του 1980 με τα οθόνες εικονοστοιχείων και το ποντίκι, στα οποία δίνουν την δικιά τους σχεδίαση με το Plan9 και το σύστημα παραθύρων rio. Η κεντρική ιδέα στην σχεδίαση του είναι τα παράθυρα και το ποντίκι είναι αρχεία σε έναν ιδεατό χώρο, κάτι που επιτρέπει την ομοιόμορφη και διαφανή επικοινωνία με τις εφαρμογές."
         'title "Σύστημα παραθύρων rio  "
         'license_text "MIT License")

   "robot-odyssey"
   (hash 'image_url "/images/robot-odyssey.png"
         'caption ""
         'title "Robot Odyssey "
         'license_text "")

   "rockys-boots"
   (hash 'image_url "/images/rockys-boots.jpg"
         'caption ""
         'title ""
         'license_text "Warren Robinett")

   "sage-lightgun"
   (hash 'image_url "/images/sage-lightgun.jpg"
         'caption "Ένας από τους μεγαλύτερους σε μέγεθος και πολύ ισχυρός υπολογιστής της δεκαετίας του 1950 ήταν ο SAGE (Semi-Automatic Ground Environment), ο οποίος συγκέντρωνε τα δεδομένα πτήσεων από ένα δίκτυο ραντάρ και τα πρόβαλε στην οθόνη μαζί με απλά γραφικά χάρτη. Ο χρήστης μπορούσε να επιλέξει ένα σημείο στο ραντάρ με τη βοήθεια μια αρχικής μορφής πένας για να ταυτοποιήσει το αντίστοιχο αντικείμενο."
         'title "SAGE Lightgun "
         'license_text "MIT")

   "sage-radar"
   (hash 'image_url "/images/sage-radar.jpg"
         'caption "Ο μετασχηματισμός της διάδρασης από τον τηλέτυπο προς τη γραφική διεπαφή στις αρχές της δεκαετίας του 1960 φαντάζει ως μια πολύ σημαντική αλλαγή παραδείγματος. Στην πράξη, όμως, μπορούμε να διαγνώσουμε την έμπνευση των σχεδιαστών των Sketchpad, Spacewar, στο οικείο για αυτούς σύστημα SAGE, το οποίο χρησιμοποιούσε γραφικά για την απεικόνιση και την ταυτοποίηση ιπτάμενων αντικειμένων πάνω σε μια οθόνη ραντάρ."
         'title "Γραφικά σε οθόνη ραντάρ "
         'license_text "MIT")

   "sam-editor"
   (hash 'image_url "/images/sam-editor.png"
         'caption "Τα εργαλεία του αρχικού UNIX βασίζονται στην διάδραση με γραμμές κειμένου, όπως αυτές εμφανίζονται στην γραμμή εντολών ή στα αρχεία. Αυτή είναι μια πρακτική που προκύπτει από τις ρίζες του συστήματος στον τηλέτυπο, αλλά με την διάθεση τερματικών με οθόνη εικονοστοιχείων και ποντίκι, δημιουργήθηκε η ανάγκη για μια πιο εκφραστική διάδραση που βασίζεται σε μια γλώσσα μοτίβων, που συνδυάζεται με την γραμμή εντολών και τον δείκτη."
         'title "Επεξεργαστής κειμένου Sam "
         'license_text "Wikimedia ")

   "second-life"
   (hash 'image_url "/images/second-life.jpg"
         'caption "Οι φωτορεαλιστικοί εικονικοί κόσμοι έγιναν δημοφιλείς αρχικά σε εφαρμογές ψυχαγωγίας και πολιτισμού και στη συνέχεια επεκτάθηκαν σε γενικές εφαρμογές επικοινωνίας, όπως το Second Life."
         'title "Second Life"
         'license_text "Linden Research ")

   "sensory_homunculus"
   (hash 'image_url "/images/sensory_homunculus.png"
         'caption "Πριν την κατασκευή νέων συσκευών εισόδου και εξόδου για τον χρήστη θα πρέπει να εξετάσουμε τις δυνατότητες του ανθρώπου."
         'title "Sensory Homunculus"
         'license_text "")

   "sketchpad-drafting"
   (hash 'image_url "/images/sketchpad-drafting.jpg"
         'caption "Η βασική λειτουργία του Sketchpad είναι η υποστήριξη της διαδικασίας της δημιουργίας προσχεδίων για τον κλάδο της μηχανολογίας. Το Sketchpad, εκτός απο τη διάδραση με την πένα, παρέχει μια σειρά εντολών που ορίζουν περιορισμούς πάνω στα αρχικά σχεδιαγράμματα, έτσι ώστε να είναι εύκολος ο μετασχηματισμός τους με βάση κάποιους κανόνες, όπως οι παράλληλες γραμμές και οι ορθές γωνίες. "
         'title "Sketchpad"
         'license_text "Wikipedia ")

   "sketchpad-interaction"
   (hash 'image_url "/images/sketchpad-interaction.png"
         'caption "Το σύστημα Sketchpad θεωρείται το πρώτο σημαντικό σύστημα αλληλεπίδρασης ανθρώπου και υπολογιστή με χρήση γραφικών. Οι κεντρικοί υπολογιστές εκείνης της εποχής συνήθως βασίζονταν σε διάτρητες κάρτες ή σε τερματικά γραμμής. Με αυτόν τον τρόπο, το Sketchpad έδειξε ότι είναι εφικτό να έχουμε έναν υπολογιστή, ο οποίος να μην αλληλεπιδρά με τον χρήστη με τον τρόπο που που έχει προγραμμιστεί ο ίδιος ο υπολογιστής, αφού μέχρι τότε η διάδραση γινόταν ασύγχρονα με εργασίες δέσμης σε διάτρητες κάρτες."
         'title "Το σύστημα Sketchpad ως μετασχηματισμός της αλληλεπίδρασης"
         'license_text "History Computer ")

   "skype-video-call"
   (hash 'image_url "/images/skype-video-call.png"
         'caption "Τα συστήματα επικοινωνίας και τηλεδιάσκεψης μέσω υπολογιστή (π.χ. Skype, Zoom) συνιστούν μια διαφορετική θεώρηση του υπολογιστή σε σχέση με την κλασική θεώρηση του εργαλείου. Οι χρήστες επικοινωνούν μέσω κειμένου, ήχου, βίντεο και οι εφαρμογές αφορούν την εργασία, την καθημερινότητα, τη διασκέδαση και την εκπαίδευση."
         'title "Βιντεοδιάσκεψη με το Skype "
         'license_text "Microsoft")

   "smalltalk-browser"
   (hash 'image_url "/images/smalltalk-browser.png"
         'caption "Όλα τα αντικείμενα του συστήματος Smalltalk είναι προσβάσιμα με την λειτουργία του *class browser* η οποία επιτρέπει την άμεση μετατροπή του αντίστοιχου κώδικα."
         'title "Περιηγητής πηγαίου κώδικα αντικειμένων στην Smalltalk "
         'license_text "PARC")

   "smalltalk-paint"
   (hash 'image_url "/images/smalltalk-paint.png"
         'caption "Οι γραφικές διεπαφές μετατοπίζουν τη σημασία της διάδρασης από το κείμενο προς τις εικόνες και τα γραφικά. Για αυτόν τον σκοπό, μαζί με τη δημιουργία του περιβάλλοντος προγραμματισμού είναι εξίσου σημαντικό να δημιουργηθεί ένα πρόγραμμα επεξεργασίας εικόνας, με το οποίο θα διευκολυνθεί η κατασκευή των πρόσθετων γραφικών στοιχείων, καθώς, και των εικονιδίων και των γραμματοσειρών."
         'title "Eπεξεργασία εικόνας "
         'license_text "Squeak ")

   "smalltalk-scrollbar-left"
   (hash 'image_url "/images/smalltalk-scrollbar-left.png"
         'caption "Σε ένα παραθυρικό περιβάλλον εργασίας η μπάρα κύλισης των περιεχομένων αρχικά βρισκόταν στην αριστερή πλευρά του παραθύρου στο περιβάλλον Smalltalk. "
         'title "Μπάρα κύλισης στα αριστερά "
         'license_text "Rochus Keller")

   "smalltalk"
   (hash 'image_url "/images/smalltalk.jpg"
         'caption "Η αντικειμενοστραφής γλώσσα προγραμματισμού Smalltalk, η οποία εμπνέεται από τον τρόπο που επικοινωνούν σε πολύ μεγάλη κλίμακα τα βιολογικά κύτταρα, έδινε έμφαση σε οντότητες υψηλού επιπέδου και στη διάδραση με τον χρήστη, με αποτέλεσμα να διευκολύνει την κατασκευή και τις δοκιμές του λογισμικού, γεγονός που τελικά οδήγησε στους πρώτους επιτυχημένους εμπορικά επιτραπέζιους υπολογιστές. "
         'title "Smalltalk"
         'license_text "Xerox PARC")

   "social-media-diy"
   (hash 'image_url "/images/social-media-diy.jpg"
         'caption "Ο δημιουργός του περισσότερο δημοφιλούς κοινωνικού δικτύου του 2010 προσπαθεί να αποφύγει την κατανάλωση μεγάλης ποσότητας κρέατος από ζώα με το να ασχολείται προσωπικά με την ανατροφή και το κυνήγι τους. Αν οι χρήστες της υπηρεσίας του, είχαν τον ίδιο τρόπο σκέψης, τότε θα είχαμε έναν μεγάλο αριθμό από διαφορετικά κοινωνικά δίκτυα.  "
         'title "Κατασκευή νέων κοινωνικών μέσων "
         'license_text "")

   "social-media"
   (hash 'image_url "/images/social-media.jpg"
         'caption "Από τα τέλη της δεκαετίας του 2000 και μέχρι τα μέσα της δεκαετίας του 2010, τα κοινωνικά δίκτυα όπως τα Facebook, Twitter, Instagram, κ.α., σε συνδυασμό με την διάδοση των έξυπνων κινητών τηλεφώνων είχαν γίνει ο ελάχιστος κοινός παρανομαστής για τους περισσότερους χρήστες ανεξάρτητα από δημογραφικά ή άλλα χαρακτηριστικά. Η ευχρηστία τους σε συνδυασμό με τους εθιστικούς αλγόριθμους προβολής σχετικού περιεχομένου και την άμεση συνεχή επικοινωνία διαμόρφωσαν μια μοντέρνα εκδοχή του ψηφιακού αλφαβητισμού που διαφέρει σημαντικά από το αρχικό και περισσότερο παραγωγικό όραμα για τους υπολογιστές. "
         'title "Κοινωνικά δίκτυα διαμοιρασμού περιεχομένου"
         'license_text "")

   "social-reviews"
   (hash 'image_url "/images/social-reviews.jpg"
         'caption "Τα δημοφιλή δικτυακά καταστήματα βασίζονται στις αξιολογήσεις των προϊόντων και των προμηθευτών τους, τις οποίες κάνουν οι ίδιοι οι χρήστες και λιγότερο στην προσπάθεια να διαλέξουν μετά από κόπο μια σειρά προϊόντων, τα οποία οι πελάτες τους θα βρουν σίγουρα αξιόπιστα."
         'title "Ομότιμη αξιολόγηση προϊόντων "
         'license_text "Amazon")

   "socio-technical-design"
   (hash 'image_url "/images/socio-technical-design.jpg"
         'caption "Η ανάγκη για συντονισμό είναι παρούσα σε όλα τα επίπεδα ανάπτυξης πληροφοριακών συστημάτων, αλλά γίνεται περισσότερο πολύπλοκη καθώς αυξάνεται ο αριθμός των ανθρώπων που συμμετέχουν σε ένα σύνθετο κοινωνικό και τεχνολογικό σύστημα, σε αντίθεση με ένα καθαρά τεχνολογικό σύστημα όπου ο συντονισμός μεταξύ των επιμέρους δομών είναι ένας στόχος σταθερός και περισσότερο εφικτός."
         'title "Σχεδίαση υβριδικών συστημάτων τεχνολογίας και κοινότητας "
         'license_text "")

   "space-invaders-competition"
   (hash 'image_url "/images/space-invaders-competition.jpg"
         'caption "Πολύ πριν τη διάδοση των δικτυωμένων υπολογιστών και βιντεοπαιχνιδιών οι χρήστες μαζεύονταν για να παίξουν όλοι μαζί τα αγαπημένα τους παιχνίδια. Εκτός από τις άτυπες συναντήσεις, διοργάνωνονταν πρωταθλήματα για την ανάδειξη των καλύτερων παικτών σε δημοφιλή παιχνίδια εκείνης της εποχής όπως το Space Invaders."
         'title "Διαγωνισμός επιδόσεων σε βιντεοπαιχνίδια"
         'license_text "")

   "space-invaders"
   (hash 'image_url "/images/space-invaders.jpg"
         'caption "Το βιντεοπαιχνίδι Space Invaders πήρε έμπνευση από το Breakout με την διαφορά ότι ο παίκτης αντί να σπάει τα τουβλάκια προσπαθεί να πετύχει τα διαστημόπλοια στην κορυφή της οθόνης. Το Space Invaders άφησε σημαντικό πολιτιστικό αποτύπωμα γιατί αύξησε την αποδοχή τόσο της δημόσιας κονσόλας βιντεοπαιχνιδιών, αλλά κυρίως της οικειακής, δημιουργόντας έτσι μια νέα κατηγορία βιντεοπαιχνιδιού, αλλά και έναν νέο είδος καταναλωτικής ηλεκτρονικής συσκευής, που θα ακολουθήσει μια παράλληλη πορεία με τον προσωπικό υπολογιστή για τις επόμενες δεκαετίες."
         'title "Space Invaders "
         'license_text "Wikipedia")

   "spacewar-gamepad"
   (hash 'image_url "/images/spacewar-gamepad.jpg"
         'caption ""
         'title "Χειριστήριο για το βιντεοπαιχνίδι Spacewar "
         'license_text "Thomas Tilley ")

   "spacewar-players"
   (hash 'image_url "/images/spacewar-players.jpg"
         'caption "Ενα από τα πρώτα δημοφιλή βιντεοπαιχνίδια δημιουργήθηκε το 1962 και παιζόταν από δύο παίκτες, γιατί ο δυνατός για την εποχή υπολογιστής δεν είχε αρκετή ισχύ για τον αυτόματο έλεγχο του αντιπάλου, αφού οι πόροι είχαν χρησιμοποιηθεί για τα γραφικά, τη φυσική κίνηση και τον έλεγχο της σύγκρουσης. Το παιχνίδι αυτό, αν και δημιουργήθηκε σε ερευνητικό περιβάλλον για επίδειξη, έγινε σημείο αναφοράς και αντιγραφής από πολλούς προγραμματιστές και επηρέασε τα παιχνίδια της επόμενης δεκαετίας, ταοποία δημιούργησαν τη βιομηχανία των βιντεοπαιχνιδιών."
         'title "Spacewar "
         'license_text "MIT")

   "squeakos"
   (hash 'image_url "/images/squeakos.jpg"
         'caption "Το σύστημα Squeak βασίζεται στο περιβάλλον προγραμματισμού Smalltalk, το οποίο επιτρέπει τις απευθείας αλλαγές σε όλα τα αντικείμενα του συστήματος και ταυτόχρονα δεν κάνει καμία διάκριση ανάμεσα σε αρχεία, εφαρμογές και λειτουργικό σύστημα, έτσι ώστε ο χρήστης να έχει τον πλήρη έλεγχο, με έμφαση στα έργα του."
         'title "Squeak"
         'license_text "Bauman National Library ")

   "star7-sunmicrosystems"
   (hash 'image_url "/images/star7-sunmicrosystems.jpg"
         'caption ""
         'title "Sun Microsystems Star7 "
         'license_text " ")

   "starfire-video"
   (hash 'image_url "/images/starfire-video.jpg"
         'caption "Στις αρχές της δεκαετίας του 1990 η Sun παρουσίασε ένα βίντεο με μια μεγάλη επιτραπέζια συσκευή χειρονομίας, η οποία βασίζεται στη συνεργασία μέσω τηλεδιάσκεψης με βίντεο, στην οποία η πρωταγωνίστρια εργάζεται από το σπίτι της. Το βίντεο υπόδειγμα χρησιμοποιεί την τεχνική της μπλε οθόνης για να εισάγει τις πρόσθετες ροές βίντεο πάνω στο αρχικό σκηνοθετημένο βίντεο. "
         'title "Sun Starfire "
         'license_text "Sun Microsystems ")

   "steve-mann-wearable-computer"
   (hash 'image_url "/images/steve-mann-wearable-computer.png"
         'caption ""
         'title "Φορετός υπολογισμός "
         'license_text "Wikipedia.org")

   "sugar-neighborhood"
   (hash 'image_url "/images/sugar-neighborhood.png"
         'caption "Στο λειτουργικό σύστημα SugarOS, το οποίο απευθύνεται σε μικρά παιδιά, δεν υπάρχει γραφική διεπαφή με αρχεία, φακέλους και εφαρμογές, όπως στην επιφάνεια εργασίας, αλλά η έμφαση βρίσκεται στις δραστηριότητες και, κυρίως, σε μια οπτικοποίηση των γειτονικών συνδέσεων με άλλους χρήστες που βρίσκονται σε κοντινή απόσταση."
         'title "Ομότιμο τοπικό δίκτυο στο σύστημα SugarOS"
         'license_text "wikimedia")

   "superpaint-rack"
   (hash 'image_url "/images/superpaint-rack.jpg"
         'caption "Η αρχική υλοποίηση του προγράμματος ψηφιακής επεξεργασίας εικόνας Superpaint έγινε σε γλώσσα μηχανής στον μίνι υπολογιστή DG Nova, ο οποίος ήταν συνδεδεμένος με επιπλέον υλικό για την ψηφιοποίηση αναλογικού βίντεο, καθώς και για την είσοδο και έξοδο του προγράμματος ψηφιακής ζωγραφικής. Η προβολή των εικόνων γινόταν σε μια αναλογική οθόνη τηλεόρασης, ενώ για την επεξεργασία της εικόνας η βασική συσκευή εισόδου ήταν μια πένα."
         'title "Superpaint rack "
         'license_text "Computer History Museum ")

   "superpaint-screens"
   (hash 'image_url "/images/superpaint-screens.jpg"
         'caption "Η διεπαφή εξόδου για το πρόγραμμα ψηφιακής επεξεργασίας εικόνας Superpaint ήταν ένα σύνολο από οθόνες τηλεόρασης, οι οποίες είχαν διαφορετική λειτουργικότητα. Μια οθόνη ήταν εστιασμένη στην τελική εικόνα, ενώ συμπληρωματικές οθόνες είχαν τα εικονίδια των εργαλείων επεξεργασίας καθώς και το τερματικό κειμένου για τον έλεγχο του προγράμματος."
         'title "Πολλαπλές οθόνες εξόδου για το Superpaint "
         'license_text "Web Archive ")

   "superpaint-selfie"
   (hash 'image_url "/images/superpaint-selfie.jpg"
         'caption "Ο κατασκευαστής του προγράμματος επεξεργασίας εικόνας Superpaint χρησιμοποιήσε το διαθέσιμο υλικό της εποχής για να φτιάξει ένα λειτουργικό υπόδειγμα, το οποίο μετά χρησιμοποίησε για να επεξεργαστεί το ψηφιακό αυτοπορτραίτο του."
         'title "Αυτοπορτραίτο με το Superpaint "
         'license_text "Web Archive ")

   "superpaint-setup"
   (hash 'image_url "/images/superpaint-setup.jpg"
         'caption "Η αρχική υλοποίηση του προγράμματος ψηφιακής επεξεργασίας εικόνας Superpaint έγινε σε γλώσσα μηχανής στον μίνι υπολογιστή Data General Nova, ο οποίος ήταν συνδεμένος με επιπλέον υλικό για την ψηφιοποίηση αναλογικού βίντεο καθώς και για την είσοδο και έξοδο του προγράμματος ψηφιακής ζωγραφικής. Η προβολή των εικόνων γινόταν σε μια αναλογική οθόνη τηλεόρασης, ενώ για την επεξεργασία της εικόνας η βασική συσκευή εισόδου ήταν μια πένα έμμεσης διάδρασης. Η τεχνολογία αυτή αναπτύχθηκε παράλληλα με τα γραφικά περιβάλλοντα και οδήγησε σε εφαρμογές ψηφιακής τέχνης και ψηφιακής κινηματογραφίας."
         'title "Σύστημα ψηφιακής επεξεργασίας εικόνας Superpaint "
         'license_text "Web Archive ")

   "superpaint-toolbox"
   (hash 'image_url "/images/superpaint-toolbox.jpg"
         'caption "Ένα από τα πρώτα προγράμματα επεξεργασίας εικόνας βασίζεται στην είσοδο και στην έξοδο βίντεο για την αποθήκευση και την προβολή των εικόνων, οι οποίες ψηφιοποιούνται και μπορούν να επεξεργαστούν με την παλέτα εργαλείων, η οποία εμφανίζεται σε μια δεύτερη οθόνη. Η εφαρμογή των εργαλείων από την δεύτερη οθόνη στην εικόνα γίνεται με έμμεση διάδραση από μια πένα σε μια ταμπλέτα. Η τεχνολογία αυτή αναπτύχθηκε παράλληλα με τα γραφικά περιβάλλοντα και οδήγησε σε εφαρμογές ψηφιακής τέχνης και ψηφιακής κινηματογραφίας."
         'title "Superpaint "
         'license_text "Web Archive ")

   "sutherland-profile"
   (hash 'image_url "/images/sutherland-profile.jpg"
         'caption "Στο σύστημα Sketchpad, εκτός από την υποστήριξη της δημιουργίας προσχεδίων, υπήρχε η δυνατότητα επίλυσης εξισώσεων, όπως αυτές ορίζονται από τα γραφικά που αναπαριστούν μια γέφυρα. O Ivan Sutherland ξεκίνησε από την περιοχή των διαδραστικών γραφικών και συνέχισε ως μέντορας ερευνητών και στέλεχος πολλών οργανισμών που άφησαν το αποτύπωμα τους στην ευρύτερη περιοχή των υπολογιστών. "
         'title "Ivan Sutherland "
         'license_text "MIT")

   "swyftware"
   (hash 'image_url "/images/swyftware.jpg"
         'caption "Το σύστημα SwyftWare βασιζόταν σε μια κάρτα επέκτασης για τον Apple II και σε λογισμικό διάδρασης για την επεξεργασία εγγράφων κειμένου, η οποία γινόταν μόνο με το πληκτρολόγιο και μερικές εντολές. Η κεντρική ιδέα σε αυτό το σύστημα είναι ότι η διάδραση με τα έγγραφα γίνεται πιο απλή αν αποφύγουμε ιδέες που σχετίζονται με μηχανήματα γενικής χρήσης, όπως είναι τα αρχεία, οι εφαρμογές, και το λειτουργικό σύστημα."
         'title "SwyftWare "
         'license_text "hackaday ")

   "symbolic-abstraction"
   (hash 'image_url "/images/symbolic-abstraction.png"
         'caption "Η οπτική αναπαράσταση του στατικού κώδικα δεν είναι αρκετή, αλλά θα πρέπει να έχουμε και ζωντανή οπτική αναπαράσταση των δεδομένων και της συμπεριφοράς ενός προγράμματος διάδρασης με τον χρήστη. Ο απλός κώδικας υπολογιστή είναι μεν πολύ ευέλικτος είναι όμως και ασαφής, όπως ακριβώς και ο μαθηματικός συμβολισμός."
         'title "Συμβολική αφαίρεση και αναπαράσταση "
         'license_text "Bret Victor")

   "tabs-pads-boards"
   (hash 'image_url "/images/tabs-pads-boards.png"
         'caption "Το όραμα για τον διάχυτο υπολογισμό από το εργαστήριο Xerox PARC βασίζεται σε τρεις διακριτές φόρμες συσκευών διάδρασης με τους χρήστες, οι οποίες επικοινωνούν διαφανώς μεταξύ τους έτσι ώστε οι χρήστες να μπορούν να πραγματοποιήσουν τους στόχους τους είτε ατομικά είτε συνεργατικά."
         'title "Διάχυτος Υπολογισμός "
         'license_text "Mark Stefik")

   "telefunken-ball-mouse"
   (hash 'image_url "/images/telefunken-ball-mouse.jpg"
         'caption "Το αρχικό ποντίκι με τους δύο τροχούς κύλισης, οι οποίοι ακουμπάνε απευθείας πάνω στο τραπέζι μπορούσε να επιλέγει κείμενο, αλλά δεν ήταν βέλτιστο για την ελεύθερη επιλογή σημείων στην οθόνη, γιατί μπορούσε να κινηθεί μόνο σε οριζόντιες και κατακόρυφες ευθείες γραμμές. Οι μηχανικοί της Telefunken, βασιζόμενοι στη σχεδίαση της μπάλας κύλισης, την οποία γύρισαν ανάποδα, έφτιαξαν το πρώτο εύχρηστο ποντίκι για γραφικά περιβάλλοντα. "
         'title "Ποντίκι με μπάλα κύλισης από την Telefunken "
         'license_text "")

   "telepresence-doors"
   (hash 'image_url "/images/telepresence-doors.jpg"
         'caption "Το σύστημα επίγνωσης συνεργατικού πλαισίου Telepresence doors χρησιμοποιεί την αναλογία της πόρτας για να δείξει ποια είναι η κατάσταση ενός απομακρυσμένου συνεργάτη, το οποίο βοηθάει στην επιλογή της κατάλληλης στιγμής για μια σύγχρονη τηλεδιάσκεψη με βίντεο και ήχο. "
         'title "Telepresence doors "
         'license_text "University of Toronto")

   "teletext"
   (hash 'image_url "/images/teletext.jpg"
         'caption "Το teletext είναι ένα από τα πρώτα λειτουργικά συστήματα διαδραστικής πληροφόρησης, το οποίο βασίζεται στην αναλογική τεχνολογία μετάδοσης και απεικόνισης τηλεοπτικού σήματος. Αρχικά σχεδιάστηκε για τη μετάδοση προαιρετικών υπότιτλων για όσους έχουν προβλήματα ακοής, αλλά στη συνέχεια έγινε δημοφιλές για τις σελίδες πληροφόρησης σχετικά με τον καιρό, τις ειδήσεις, αθλητικά και σελίδες τοπικού ενδιαφέροντος αφού η εμβέλεια του τηλεοπτικού σήματος είναι από τη φύση της γεωγραφικά περιορισμένη."
         'title "Teletext "
         'license_text "wikimedia")

   "teletype"
   (hash 'image_url "/images/teletype.jpg"
         'caption "Η συσκευή τηλέτυπος είναι μια γραφομηχανή με δυνατότητα επικοινωνίας που είχε χρησιμοποιηθεί ευρέως στον τηλέγραφο για την αποστολή μηνυμάτων, οπότε η μεγάλη διαθεσιμότητα και η ωριμότητα του τηλέτυπου οδήγησε στην επιλογή του ως εύχρηστο τερματικό χρήστη για τους πρώτους μεγάλους υπολογιστές καθώς και για τους μίνιϋπολογιστές. Αν και αυτές οι συσκευές δεν χρησιμοποιούνται πλέον, μας έχουν αφήσει την συντομογραφία ΤΤΥ, η οποία εμφανίζεται στα τερματικά κειμένου στο λειτουργικό σύστημα UNIX."
         'title "Τηλέτυπος "
         'license_text "Wikimedia ")

   "tenbyten"
   (hash 'image_url "/images/tenbyten.png"
         'caption "Η πληθώρα και η πολυπλοκότητα της διαθέσιμης πληροφορίας δημιούργησε την ανάγκη για μια νέα μορφή ανάκτησης και απεικόνισης της πληροφορίας, όπου ο ρόλος του δημοσιογράφου είναι περισσότερο ως προγραμματιστής της διάδρασης."
         'title "Οπτικοποίηση των ειδήσεων "
         'license_text "Jonathan Harris ")

   "tennis-for-two"
   (hash 'image_url "/images/tennis-for-two.jpg"
         'caption "Το βιντεοπαιχνίδι Tennis for Two είναι μια σχετικά πιστή προσομοίωση του τένις για δύο παίκτες, όπως αυτό φαίνεται από το πλάϊ, σε πρόσοψη. Κατασκευάστηκε σε αναλογικό ηλεκτρονικό υπολογιστή και για την οπτικοποίησή του χρησιμοποιήθηκε ένα φασματοσκόπιο. Η επίδρασή του ήταν καταλυτική, αφού έδωσε την έμπνευση για το δημοφιλές Pong, ενώ για πολλές δεκαετίες μετά τα βιντεοπαιχνίδια προσομοίωσης αθλημάτων παραμένουν πολύ δημοφιλή."
         'title "Tennis for Two "
         'license_text "wikimedia")

   "terminal-emulator"
   (hash 'image_url "/images/terminal-emulator.png"
         'caption "Η απλότητα και η διαχρονικότητα του πληκτρολογίου και της οθόνης κειμένου για τη διάδραση με τον υπολογιστή οδήγησαν στη δημιουργία εφαρμογών εξομοίωσης, οι οποίες δίνουν πρόσβαση σε έναν υπολογιστή ανεξάρτητα από την τοποθεσία του. Η εφαρμογή εξομοίωσης τερματικού επιτρέπει σε έναν χρήστη να αλληλεπιδράσει τόσο με τον προσωπικό υπολογιστή όσο και με ένα σύστημα που βρίσκεται κάπου αλλού ή ακόμη και με ένα εικονικό σύστημα στο υπολογιστικό νέφος."
         'title "Εξομοιωτής Τερματικού "
         'license_text "Wikimedia ")

   "tesler-profile"
   (hash 'image_url "/images/tesler-profile.jpg"
         'caption "Ο Larry Tesler κατασκεύασε λογισμικό με έμφαση στην προσβασιμότητα από απλούς χρήστες. Η πιο σημαντική συνεισφορά του είναι η μη-τροπική αλληλεπίδραση, την οποία δοκίμασε αρχικά στο Xerox Alto με τον επεξεργαστή κειμένου Gypsy. Η έννοια της ευχρηστίας για τον Larry Tesler συμπίπτει με την ευκολία για τον περιστασιακό και αρχάριο χρήστη και τελικά επικράτησε στην περιοχή της διάδρασης."
         'title "Larry Tesler "
         'license_text "Xerox PARC")

   "tiling-windows"
   (hash 'image_url "/images/tiling-windows.png"
         'caption "Αν και τα γραφικά παράθυρα με αλληλοεπικαλυπτόμενα παράθυρα έχουν επικρατήσει εμπορικά και είναι περισσότερο δημοφιλή, τα συνταιριασμένα παράθυρα παραμένουν διαχρονικά η επιλογή των προχωρημένων χρηστών που δουλεύουν κυρίως με γραπτό κείμενο."
         'title "Συνταιριασμένα παράθυρα"
         'license_text "Wikipedia")

   "time-space-cscw"
   (hash 'image_url "/images/time-space-cscw.jpg"
         'caption "Η ταξινόμηση των εφαρμογών στον χώρο (διά ζώσης ή εξ αποστάσεως) και στον χρόνο (σύγχρονη ή ασύγχρονη) επιτρέπει την εύκολη ταξινόμηση των κοινωνικών και συνεργατικών εφαρμογών και των λειτουργιών τους. Επίσης, επιτρέπει τον εντοπισμό ευκαιριών για τη δημιουργία νέων τύπων συστήματος."
         'title "Χωροχρονική ταξινόμηση συνεργατικών συστημάτων "
         'license_text "Public domain ")

   "tmux-desktop"
   (hash 'image_url "/images/tmux-desktop.png"
         'caption "Η επιφάνεια εργασίας έχει συνδεθεί με τα γραφικά και τα πολυμέσα αλλά μπορεί να πραγματοποιηθεί σε μεγάλο βαθμό μόνο με τη χρήση της γραμμής εντολών, μερικών συνοδευτικών εργαλείων και αρκετών ρυθμίσεων με αποτέλεσμα μια πολύ γρήγορη, απλή και πυκνή σε πληροφορία διεπαφή."
         'title "Επιφάνεια εργασίας σε περιβάλλον τερματικού "
         'license_text "Fair use")

   "tool-need"
   (hash 'image_url "/images/tool-need.jpg"
         'caption "Η ανθρωποκεντρική σχεδίαση είναι μια προσπάθεια να γεφυρώσουμε το χάσμα ανάμεσα σε αυτό που μπορεί σχετικά εύκολα να κάνει ο άνθρωπος και σε αυτό που έχει άναγκη να κάνει."
         'title "Ανάγκες και δυνατότητες των ανθρώπων "
         'license_text "")

   "tools-palette"
   (hash 'image_url "/images/tools-palette.jpg"
         'caption "Η πρώτη εργαλειοθήκη στον Apple Liza αντιμετωπίστηκε αρχικά σαν μια ιδέα, γιατί λειτουργεί ως τροπική διεπαφή, το οποίο χαλάει την συνέπεια της βασικής σχεδίασης που θέλει κάθε συσκευή εισόδου να κάνει πάντα το ίδιο πράγμα και να μην αλλάζει συμπεριφορά."
         'title "Εργαλειοθήκη "
         'license_text "")

   "touch-develop"
   (hash 'image_url "/images/touch-develop.png"
         'caption "Το πειραματικό περιβάλλον ανάπτυξης Touch Develop είναι σχεδιασμένο ώστε να δουλεύει σε έξυπνα κινητά, οπότε έχουμε ξανά τα πλεονεκτήματα που δίνει η ανάπτυξη και εκτέλεση πάνω στην ίδια πλατφόρμα. Επιπλέον, είναι μια απάντηση στο διαχωριστικό γυαλί που δημιουργούν οι δημοφιλείς κινητές συσκευές με οθόνη αφής ανάμεσα στον χρήστη και στον προγραμματισμό της διάδρασης."
         'title "Ανάπτυξη εφαρμογών με συσκευές αφής "
         'license_text "")

   "touchpad"
   (hash 'image_url "/images/touchpad.jpg"
         'caption "Το touchpad είναι ένα δημοφιλές παράδειγμα έμμεσης διάδρασης όπως και το ποντίκι, γιατί το δάχτυλο του χρήστη κινείται σε μια διαφορετική επιφάνεια, από αυτή της συσκευής εξόδου, και μέσω της κίνησης του οδηγεί έναν δείκτη πάνω στη συσκευή εξόδου."
         'title "Έμμεση διάδραση με επιφάνεια αφής "
         'license_text "")

   "trackball"
   (hash 'image_url "/images/trackball.jpg"
         'caption "Όπως και η πένα εισόδου, έτσι και η μπάλα κύλισης δημιουργήθηκε αρχικά για να διευκολύνει τον εντοπισμό σημείων πάνω σε μια οθόνη ραντάρ που οπτικοποιεί πλοία. Η μπάλα κύλισης παράμεινε πάντα σε χρήση για ορισμένες εφαρμογές και έδωσε την έμπνευση για την πιο σημαντική βελτίωση στη χρήση του ποντικιού, του οποίου οι τροχοί αντικαταστάθηκαν από μια μικρή μπάλα."
         'title "Trackball "
         'license_text "Courtesy of J. Vardalas ")

   "transistor-radio"
   (hash 'image_url "/images/transistor-radio.png"
         'caption "Το τρανζιστοράκι της δεκαετίας του 1950 ήταν συνώνυμο με την πρώτη πραγματικά φορητή και δημοφιλή εκδοχή του ραδιοφώνου με τρανζίστορ. Ταυτόχρονα ήταν και η πρώτη δημοφιλής εφαρμογή της εφεύρεσης του τρανζίστορ, το οποίο στη συνέχεια θα μπει σε πολλές συσκευές που μέχρι τότε δούλευαν με λυχνίες, όπως ο υπολογιστής. Εκτός από τη χρήση τρανζίστορ, αυτό που είναι κοινό και στις δύο αυτές περιπτώσεις (τρανζιστοράκι, υπολογιστής) είναι πως η ονομασία τους γίνεται με βάση την εσωτερική τους λειτουργία και όχι με βάση τη χρήση τους, η οποία στην περίπτωση του υπολογιστή είναι ένα ανοιχτό θέμα."
         'title "Ραδιόφωνο με τρανζίστορ "
         'license_text "Bullock Museum ")

   "troff"
   (hash 'image_url "/images/troff.png"
         'caption "Η τυπογραφία με το σύστημα troff γίνεται με την περιγραφή της μορφοποίησης σε μια απλή δηλωτική γλώσσα προγραμματισμού, το οποίο είναι πολύ διαφορετικό από τα συστήματα απευθείας απεικόνισης. Το σύστημα troff δημιουργήθηκε για την μορφοποίηση εγγράφων για πατέντες, το οποίο ήταν και το κίνητρο για την αγορά του μίνι-υπολογιστή PDP11, όπου τελικά έγινε η ωρίμανση και η διάδοση του UNIX."
         'title "Σύστημα τυπογραφίας troff "
         'license_text "")

   "tty-model33"
   (hash 'image_url "/images/tty-model33.jpg"
         'caption "Το μοντέλο 33 της εταιρείας Teletype αποτελεί μια ολοκληρωμένη συσκευή εισόδου και εξόδου και ήταν πολύ δημοφιλής με τους μίνι-υπολογιστές της δεκαετίας του 1960, καθώς και με τους πρώτους μίκρο-υπολογιστές, αφού για πολλά χρόνια ήταν η πιο οικονομική και οικεία λύση. Ο χρήστης μπορούσε να αλληλεπιδράσει με τον υπολογιστή με το πληκτρολόγιο και να δει την έξοδο να τυπώνεται στο χαρτί, ενώ η διάτρητη χαρτοταινία επέτρεπε τόσο την αποθήκευση δεδομένων, όσο και τη φόρτωση τους. "
         'title "Τηλέτυπος Μοντέλο 33 "
         'license_text "Wikipedia")

   "tv-typewriter"
   (hash 'image_url "/images/tv-typewriter.jpg"
         'caption "Η μεγάλη διαθεσιμότητα των συσκευών τηλεόρασης τη δεκαετία του 1970 επέτρεψε σε πολλούς ερασιτέχνες να συνδέσουν ένα πληκτρολόγιο για να γράψουν κείμενο στην οθόνη της. Αν και οι συσκευές αυτές δεν είχαν κάποιο επεξεργαστή, στη συνέχεια επεκτάθηκαν για να συνδεθούν με τους πρώτους μικρο-υπολογιστές. "
         'title "Γραφομηχανή τηλεόρασης "
         'license_text "Wikimedia ")

   "uber"
   (hash 'image_url "/images/uber.jpg"
         'caption "Αν και οι υπολογιστές έχουν κατηγορηθεί (όπως παλιότερα η μηχανή εσωτερικής καύσης και η ρομποτική) ότι αφαιρούν δουλειές, την ίδια στιγμή δημιουργούν και ευκαιρίες για νέες αγορές, όπως για παράδειγμα στην περίπτωση του Uber."
         'title "Πληθοπορισμός και ανθρώπινη εργασία "
         'license_text "")

   "ubiq"
   (hash 'image_url "/images/ubiq.png"
         'caption "Ο διάχυτος υπολογισμός δημιουργεί διεπαφές στο περιβάλλον, όπως ο θερμοστάτης Nest που είναι συνδεμένος με το διαδίκτυο ώστε να είναι πάντα προσβάσιμος από τις συσκευές του χρήστη όπως ο φορετός, ο κινητός, και ο επιτραπέζιος υπολογιστής, δημιουργώντας έτσι ένα οικοσύστημα συσκευών και εφαρμογών, που βασίζονται περισσότερο στην επίγνωση πλαισίου παρά στην διάδραση με τον χρήστη."
         'title "Διάχυτος υπολογισμός "
         'license_text "")

   "ui-sketch"
   (hash 'image_url "/images/ui-sketch.png"
         'caption "Η σχεδίαση της διεπαφής στα πρώτα στάδια μπορεί να γίνει ακόμη και στο χαρτί, αν και υπάρχουν ψηφιακά εργαλεία που διευκολύνουν την παραγωγή των αντίστοιχων διαγραμμάτων."
         'title "Προσχέδια διάδρασης "
         'license_text "")

   "uist-history"
   (hash 'image_url "/images/uist-history.png"
         'caption "Η κατασκευή της διάδρασης ανθρώπου-υπολογιστή είναι τόσο παλιά όσο οι πρώτοι υπολογιστές. Όμως, ενώ στα πρώτα στάδια οι χρήστες ανήκαν κατα πλειοψηφία σε έναν στενό και κλειστό κύκλο ειδικών· οι σύγχρονοι χρήστες είναι στις περισσότερες περιπτώσεις μη-ειδικοί."
         'title "Η εξέλιξη της τεχνολογίας λογισμικού διάδρασης "
         'license_text "")

   "unix-shell"
   (hash 'image_url "/images/unix-shell.png"
         'caption "Η διεπαφή του πυρήνα του λειτουργικού συστήματος UNIX ονομάστηκε κέλυφος (shell), καθώς κρύβει τις λεπτομέρειες της υλοποίησης και παρέχει μια προσβάσιμη διάδραση για τον χρήστη. Εκτός από τις βασικές λειτουργίες του συστήματος, παρέχει και μια απλή γλώσσα προγραμματισμού μεταγλώτισης, η οποία επιτρέπει τη φορητότα των προγραμμάτων του χρήστη σε παρόμοια συστήματα. "
         'title "Γραμμή εντολών UNIX "
         'license_text "Wikimedia ")

   "unix-tmg"
   (hash 'image_url "/images/unix-tmg.png"
         'caption "Για τον μετασχηματισμό από την αρχική έκδοση του UNIX που ήταν γραμμένη σε συμβολική γλώσσα μηχανής σε μια έκδοση που βασίζεται σε μια γλώσσα υψηλού επιπέδου, όπως η B και η C, χρειάστηκε να δημιουργηθεί από την αρχή ένας μεταφραστής. Η διαδικασία δημιουργίας του μεταφραστή είναι σημαντική, γιατί είναι μια δεξιότητα που επιτρέπει τη δημιουργία μιας νέας γλώσσας, αφού η αρχική εκδοχή του μεταφραστή μπορεί να είναι πολύ απλή και να γραφεί απευθείας σε συμβολική γλώσσα μηχανής."
         'title "UNIX TMG "
         'license_text "Wikipedia ")

   "unreal-blueprints"
   (hash 'image_url "/images/unreal-blueprints.png"
         'caption "Η κατασκευή της διάδρασης σε ένα βιντεοπαιχνίδι απαιτεί πολλές διαφορετικές δεξιότητες, όπως κώδικα, γραφικά, ήχο, κίνηση. Για τη διευκόλυνση της δημιουργικής διαδικασίας, οι σχεδιαστές βασίζονται σε έτοιμα μοτίβα, τα οποία μπορούν να παραμετροποιήσουν και να διασυνδέσουν σε διαγράμματα ροής."
         'title "UNREAL Blueprints "
         'license_text "Epic Games ")

   "usability-observation"
   (hash 'image_url "/images/usability-observation.png"
         'caption "Η παρατήρηση της δραστηριότητας του χρήστη κατά τη διάδραση με τον υπολογιστή είναι η πιο δημοφιλής και η πιο απλή τεχνική αξιολόγησης μιας νέας εφαρμογής ή συσκευής. Για μια νέα συσκευή εισόδου ο χρήστης εκτελεί τυπικές διεργασίες σε διαθέσιμο λογισμικό ή ακόμη καλύτερα σε ειδικό λογισμικό, το οποίο καταγράφει με λεπτομέρεια τις συμπεριφορές."
         'title "Αξιολόγηση της ευχρηστίας με παρατήρηση του χρήστη "
         'license_text "Microsoft ")

   "user-centered-history"
   (hash 'image_url "/images/user-centered-history.jpg"
         'caption "Η ανθρωποκεντρική σχεδίαση είναι μια ευρύτατη περιοχή που συνδυάζει τόσο την τεχνολογία και τις εφαρμοσμένες τέχνες, όσο και τις ανθρωπιστικές και κοινωνικές επιστήμες."
         'title "Η εξέλιξη της ανθρωποκεντρικής σχεδίασης "
         'license_text "")

   "utoronto-hydra"
   (hash 'image_url "/images/utoronto-hydra.jpg"
         'caption "To διάχυτο σύστημα τηλεδιάσκεψης Hydra από το πανεπιστήμιο του Τορόντο χρησιμοποιεί ξεχωριστά υποσυστήματα οθόνης, κάμερας και ηχείου, έτσι ώστε να υπάρχει σαφής αίσθηση στην κατεύθυνση του βλέματος και του ήχου. Για κάθε συνεργάτη σε μια τηλεδιάσκεψη απαιτείται μια αντιπροσωπευτική πολυμεσική συσκευή, οπότε για μια συνάντηση τεσσάρων, απαιτείται ο καθένας να έχει τρεις τέτοιες συσκευές πάνω στο γραφείο."
         'title "Σύστημα τηλεδιάσκεψης Hydra"
         'license_text "University of Toronto ")

   "vi-editor"
   (hash 'image_url "/images/vi-editor.png"
         'caption "Ο επεξεργαστής κειμένου vi δημιουργήθηκε για το λειτουργικό σύστημα UNIX για τερματικά χρήστη που βασίζονται στην οθόνη και το πληκτρολόγιο. Θεωρείται ο πρώτος δημοφιλής επεξεργαστής κειμένου που έφυγε από τη διάδραση γραμμής και πέρασε στη διάδραση με την οθόνη και, επειδή είναι σχετικά απλός, παρά την τροπική λειτουργία του, χρησιμοποιείται ευρέως, κυρίως, από διαχειριστές συστήματος."
         'title "Επεξεργαστής κειμένου VI "
         'license_text "Wikimedia ")

   "videoplace"
   (hash 'image_url "/images/videoplace.png"
         'caption "Το ερευνητικό σύστημα Videoplace του Myron Krueger τοποθετεί τη σιλουέτα του χρήστη μέσα σε ένα συμμετοχικό διαδραστικό περιβάλλον, όπου δεν υπάρχει διάκριση ανάμεσα σε χρήστες και γραφικά, με τη χρήση κάμερας σε πραγματικό χρόνο και χωρίς να μεσολαβεί κάποια συσκευή έμμεσης διάδρασης. Σε αντιδιαστολή με τα πρώτα συστήματα εικονικής πραγματικότητας εκείνης της περιόδου, αυτό το σύστημα χαρακτηρίζεται από τον δημιουργό του ως τεχνητή πραγματικότητα, η οποία αρχικά υλοποιήθηκε με αναλογικά φίλτρα και κινηματογραφικές τεχνικές πριν περάσει σε τεχνολογίες υπολογιστικής όρασης."
         'title "Τεχνητή Πραγματικότητα Videoplace "
         'license_text "Myron Krueger")

   "vim-ide"
   (hash 'image_url "/images/vim-ide.jpg"
         'caption "Ο συνδυασμός ενός ευέλικτου και επεκτάσιμου επεξεργαστή κειμένου, όπως ο vim, με ένα απλό παραθυρικό περιβάλλον ή ακόμη και με έναν πολυπλέκτη τερματικών όπως το tmux, επιτρέπει στον έμπειρο προγραμματιστή να έχει ένα γρήγορο και πλούσιο σε πληροφορία περιβάλλον που μπορεί να τον ακολουθεί ανεξάρτητα από τις δυνατότητες του τερματικού υπολογιστή."
         'title "Ολοκληρωμένο περιβάλλον ανάπτυξης στο τερματικό "
         'license_text "Chris Nicola ")

   "viola-classes"
   (hash 'image_url "/images/viola-classes.jpg"
         'caption "Το viola εμπνεύστηκε από το Hypercard και ήταν διαθέσιμο για συστήματα Unix. Χρησιμοποιήθηκε για την ανάπτυξη πολλών υπερμεσικών εφαρμογών, όπως ένα υπερμεσικό ευρετήριο υπηρεσιών για το διαδίκτυο για τις εκδόσεις Oreilly. Η πιο δημοφιλής εφαρμογή του ήταν ο πρώτος περιηγητής υπερσυνδέσμων για τον παγκόσμιο ιστό με γραφικά violaWWW. "
         'title "Συγγραφή υπερμεσικών εφαρμογών με το σύστημα viola "
         'license_text "Pei-Yuan Wei  ")

   "violaWWW"
   (hash 'image_url "/images/violaWWW.jpg"
         'caption "Ο πρώτος περιηγητής ιστοσελίδων με γραφικά είναι μια εφαρμογή του αντικειμενοστραφούς λογισμικού δημιουργίας υπερμέσων viola. Ο δημιουργός του viola εμπνεύστηκε από το Ηypercard και θέλησε να το συνδυάσει με τους υπερσυνδέσμους του παγκόσμιου ιστού που μόλις τότε είχε εφευρεθεί. Αν και είχε προχωρημένες για την εποχή δυνατότητες εκτέλεσης τοπικών εφαρμογών τελικά δεν είχε την ευρεία αποδοχή του Mosaic γιατί ήταν διαθέσιμη μόνο για συστήματα Unix."
         'title "Περιηγητής ιστοσελίδων violaWWW "
         'license_text "Pei-Yuan Wei  ")

   "virtual-keyboard"
   (hash 'image_url "/images/virtual-keyboard.jpg"
         'caption "Η είσοδος χαρακτήρων στα πρώτους μικρούς προσωπικούς υπολογιστές τσέπης γινόταν με φυσικές διεπαφές και αναγνώριση γραφής ή χειρονομίας. Η Microsoft στις αρχές του 2000 επέλεξε να χρησιμοποιήσει την γραφίδα και την οθόνη αφής για να προβάλει ένα εικονικό πληκτρολόγιο, το οποίο από τότε βελτιώνεται συνέχεια καθώς δανείζεται και στοιχεία από την αναγνώριση χειρονομίας και έτσι αυξάνει την ευχρηστία και την ταχύτητα εισόδου χαρακτήρων. "
         'title "Εικονικό Πληκτρολόγιο "
         'license_text "Wikimedia ")

   "visicalc"
   (hash 'image_url "/images/visicalc.png"
         'caption "Ανάμεσα στις πολλές διαφορετικές χρήσεις του υπολογιστή ως εργαλείο (π.χ. επεξεργασία κειμένου, σχεδίαση κτλ.), ξεχωρίζει η περίπτωση του VisiCalc που είναι το πρώτο δημοφιλές εργαλείο επεξεργασίας υπολογιστικών φύλλων, το οποίο μεταφέρει από το χαρτί στην οθόνη του υπολογιστή μια πολύ βασική διεργασία που κάνουν οι εταιρείες και τα νοικοκυριά για τη διαχείριση των οικονομικών τους. Η διάθεση μιας εφαρμογής γραφείου σε μικρο-υπολογιστές θα στρέψει την προσοχή της IBM στους προσωπικούς υπολογιστές και θα δημιουργήσει πολλές νέες μεγάλες εταιρείες όπως η Microsoft και η Apple."
         'title "Φύλλο εργασίας Visicalc"
         'license_text "Visicorp")

   "visual-basic-form-designer"
   (hash 'image_url "/images/visual-basic-form-designer.png"
         'caption "Το οπτικό περιβάλλον της Visual Basic έδωσε τη δυνατότητα σε πολλούς χρήστες, οι οποίοι δεν ήταν ειδικοί της πληροφορικής, να φτιάξουν προγράμματα για ειδικούς σκοπούς, όπως η αναζήτηση και η ανάκτηση πληροφορίας από μία βάση δεδομένων, χωρίς να πρέπει να μάθουν όλες τις λεπτομέρειες της ανάπτυξης του λογισμικού. Ταυτόχρονα, όμως, ο σχεδιασμός περιορίζεται από τα διαθέσιμα αρχέτυπα, με αποτέλεσμα τη δημιουργία κινητών εφαρμογών, οι οποίες μοιάζουν και συμπεριφέρονται όπως οι επιτραπέζιες."
         'title "Οπτικός προγραμματισμός φόρμας δεδομένων "
         'license_text "Microsoft")

   "vnc"
   (hash 'image_url "/images/vnc.png"
         'caption "Σε αναλογία με την τεχνολογία εξομοιωτή τερματικού κειμένου, η τεχνολογία εικονικού υπολογιστή επιτρέπει τη διάδραση με γραφικές διεπαφές και συσκευές εισόδου πέρα από το πληκτρολόγιο. Η διαθεσιμότητα των ευρυζωνικών δικτύων έδωσε τη δυνατότητα της μετάδοσης σε πραγματικό χρόνο μιας γραφικής διεπαφής από έναν απομακρυσμένο υπολογιστή σε ένα απλό τερματικό, το οποίο έχει μόνο συστήματα εισόδου και εξόδου με τον χρήστη. Το τερματικό αναλαμβάνει την απεικόνιση της διεπαφής και την είσοδο από τον χρήστη, αλλά όλη η επεξεργασία, καθώς και η σύνθεση της εικόνας, γίνεται στον απομακρυσμένο υπολογιστή και στέλνεται ως συμπιεσμένη εικόνα."
         'title "Virtual Network Computing "
         'license_text "Wikipedia ")

   "vpl-data-glove"
   (hash 'image_url "/images/vpl-data-glove.png"
         'caption "Το γάντι δεδομένων περιέχει αισθητήρες που καταγράφουν την θέση του χεριού και τις κινήσεις των δακτύλων, έτσι ώστε να υπάρχει λεπτομερής χειρισμός σε περιβάλλον εικονικής πραγματικότητας ή σε άλλες εφαρμογές, όπως στη ρομποτική. "
         'title "VPL DataGlove "
         'license_text "VPL")

   "vpl-data-suit"
   (hash 'image_url "/images/vpl-data-suit.jpg"
         'caption "Η έμφαση στο σύστημα εισόδου περισσότερο από το σύστημα εξόδου για τις πρώτες εφαρμογές εικονικής πραγματικότητας τεκμηριώνεται με την κατασκευή της πρώτης στολής καταγραφής της κίνησης όλου του σώματος. Η στολή παρακολουθεί την θέση του σώματος και την κίνηση των άκρων και ταυτόχρονα συνδυάζεται με το γάντι, έτσι ώστε να υπάρχει μεγαλύτερη εμβύθιση στο εικονικό περιβάλλον, το οποίο δεν χρειάζεται να έχει μεγάλη πιστότητα γραφικών."
         'title "VPL Datasuit "
         'license_text "Wikimedia ")

   "vpl-eye-phone"
   (hash 'image_url "/images/vpl-eye-phone.jpg"
         'caption "Το πρώτο εμπορικό σύστημα εικονικής πραγματικότητας βασίζεται στην μάσκα EyePhone η οποιά δίνει έμφαση όχι τόσο στην πιστότητα των γραφικών, αλλά κυρίως στην ακρίβεια καταγραφής της κίνησης του κεφαλιού, ενώ το λογισμικό είναι σχεδιασμένο για την επικοινωνία με τους άλλους χρήστες και όχι απλά την πλοήγηση σε έναν εικονικό κόσμο. "
         'title "VPL Eyephone "
         'license_text "Wikimedia ")

   "vpl-virtual-reality"
   (hash 'image_url "/images/vpl-virtual-reality.jpg"
         'caption "Το γάντι δεδομένων περιέχει αισθητήρες, οι οποίοι καταγράφουν τη θέση του χεριού και τις κινήσεις των δακτύλων, έτσι ώστε να υπάρχει λεπτομερής χειρισμός στο περιβάλλον εικονικής πραγματικότητας, το οποίο απεικονίζεται στη μάσκα. Η δυνατότητα του χρήστη όχι μόνο να πλοηγηθεί, αλλά κυρίως να εκφραστεί σωματικά και να χειριστεί με μεγάλη ακρίβεια τον εικονικό εαυτό και το περιβάλλον του, στο οποίο συνεργάζεται και με άλλους χρήστες, ήταν τα θεμέλια στο πρώτο εμπορικό σύστημα εικονικής πραγματικότητας. "
         'title "VPL Virtual Reality "
         'license_text "VPL")

   "vt100"
   (hash 'image_url "/images/vt100.jpg"
         'caption "Από τις αρχές της δεκαετίας του 1970, άρχισαν να εμφανίζονται τα πρώτα ακριβά τερματικά με οθόνη, αλλά μόνο προς τα τέλη της δεκαετίας έγιναν πραγματικά δημοφιλή για τους περισσότερους χρήστες με συστήματα όπως το VT100 της DEC, το οποίο είχε μικροεπεξεργαστή, αν και η χρήση του ήταν μόνο ως τερματικό σε έναν μεγαλύτερο απομακρυσμένο κεντρικό ή μίνιϋπολογιστή. To VT100 μπορεί να έχει ξεπεραστεί ως συσκευή, αλλά ακόμη χρησιμοποιείται ως λογισμικό επικοινωνίας στα σύγχρονα εικονικά τερματικά."
         'title "Τερματικό χρήστη με οθόνη VT100 "
         'license_text "")

   "we-feel-fine"
   (hash 'image_url "/images/we-feel-fine.jpg"
         'caption "Η ανάκτηση της πληροφορίας μπορεί να ξεκίνησε από την αναζήτηση σε κείμενο στις μεγάλες ψηφιακές βιβλιοθήκες, αλλά γρήγορα βρήκε εφαρμογή στις νέες δραστηριότητες των ανθρώπων, όπως είναι η ανάκτηση πληροφορίας σχετικής με το συναίσθημα (π.χ. We Feel Fine) από ιστολόγια που συνήθως χρησιμοποιούνται από τους χρήστες τους ως προσωπικά ημερολόγια."
         'title "Οπτικοποίηση δεδομένων συναισθήματων από δικτυακά ημερολόγια χρηστών "
         'license_text "Jonathan Harris ")

   "wearable"
   (hash 'image_url "/images/wearable.png"
         'caption "O φορετός υπολογιστής Pebble μεταφέρει τη διάδραση στον καρπό του χεριού και μετατρέπει τον προγραμματισμό της διάδρασης σε μια σύνθεση των πόρων του ρολογιού, του κινητού, και του διαδικτύου."
         'title "Φορετός Υπολογισμός "
         'license_text "Zach Honig for Engadget")

   "web-search"
   (hash 'image_url "/images/web-search.png"
         'caption "Ανεξάρτητα από τη μορφή του υπολογιστή (επιτραπέζιος, κινητός), για περισσότερο από δύο δεκαετίες, η ανάκτηση της πληροφορίας και η διάδραση με το σύστημα των ιστοσελίδων είναι τόσο τεχνολογικά όσο και συμπεριφορικά ο πιο διαχρονικός και δημοφιλής τρόπος διάδρασης ανθρώπου και υπολογιστή."
         'title "Ανάκτηση πληροφορίας στον παγκόσμιο ιστό "
         'license_text "Craigslist ")

   "weiser-profile"
   (hash 'image_url "/images/weiser-profile.jpg"
         'caption ""
         'title "Marc Weiser"
         'license_text "")

   "weiser-tab-pad-board"
   (hash 'image_url "/images/weiser-tab-pad-board.png"
         'caption ""
         'title "Συσκευές κινητού και διάχυτου υπολογισμού "
         'license_text "Xerox PARC")

   "white-windows"
   (hash 'image_url "/images/white-windows.jpg"
         'caption "Τα πρώτα παράθυρα στο γραφικό περιβάλλον κατασκευάζονται λίγο μετά την επίσκεψη της Apple στο Xerox PARC, οπότε υπάρχουν πολλές ομοιότητες στην μορφή και στην λειτουργία τους. Η επιλογή για λευκό υπόβαθρο στα παράθυρα του γραφικού περιβάλλοντος του Liza έγινε με κριτήριο την δυνατότητα για ομοιόμορφη προβολή και εκτύπωση τόσο του κειμένου, όσο και των εικόνων. "
         'title "Παράθυρα με λευκό υπόβραθρο  "
         'license_text "Andy Hertzfeld ")

   "wikipedia-edit"
   (hash 'image_url "/images/wikipedia-edit.png"
         'caption "Η εύκολη και καθολική συμμετοχή των χρηστών στη δημιουργία και ενημέρωση του περιεχομένου γίνεται με τη βοήθεια λογισμικού τύπου wiki, το οποίο επιτρέπει την επιτόπου επεξεργασία ενός άρθρου μέσα στο λογισμικό περιηγητή του χρήστη."
         'title "Συνεργατική επεξεργασία εγγράφων στην Wikipedia "
         'license_text "Wikipedia")

   "wikipedia-growth"
   (hash 'image_url "/images/wikipedia-growth.png"
         'caption "To 2015 η Αγγλική έκδοση της wikipedia είχε σχεδόν πέντε εκατομμύρια άρθρα, τα οποία αντιστοιχούν σε περισσότερους από δύο χιλιάδες τόμους της εγκυκλοπαίδειας Britannica, αριθμός που προφανώς δεν θα ήταν ποτέ εφικτό να τυπωθεί σε χαρτί και να διανεμηθεί."
         'title "Η ανάπτυξη της Wikipedia "
         'license_text "")

   "winamp"
   (hash 'image_url "/images/winamp.jpg"
         'caption "Το Winamp επιτρέπει στους χρήστες του να χρησιμοποιήσουν εναλλακτικές εμφανίσεις (skins) και επιπλέον, τους παρέχει ένα καλά τεκμηριωμένο τρόπο για να φτιάξουν τις δικές τους, με αποτέλεσμα να έχει δημιουργηθεί μια πολύ μεγάλη συλλογή από εμφανίσεις, με τις περισσότερες από αυτές να δίνουν έμφαση στη μορφή και να υιοθετούν ένα σκευομορφικό στυλ διάδρασης."
         'title "Εξατομίκευση και προσαρμογή της αισθητικής της διάδρασης "
         'license_text "Piotr Gontarczyk ")

   "window-manager"
   (hash 'image_url "/images/window-manager.png"
         'caption "Τα παράθυρα στο λειτουργικό σύστημα Unix χρησιμοποιούνται κυρίως ως πλαίσιο για τις βασικές λειτουργίες με κείμενο που είναι κυρίαρχες σε αυτό το λειτουργικό και με βασική παράμετρο την επιλογή για παράθυρα που δεν επικαλύπτονται αλλά συνταιριάζουν. Με αυτόν τον τρόπο, ο χρήστης είναι ελεύθερος να προσαρμόσει και να συνθέσει ένα γραφικό περιβάλλον που ταιριάζει στις προτιμήσεις του και στο πεδίο εφαρμογής. Οπότε διαπιστώνουμε ότι τα παράθυρα αν και αναγκαία συνθήκη, δεν είναι και ικανή για να έχουμε ένα πλήρες γραφικό περιβάλλον τύπου επιφάνειας εργασίας, το οποίο προσομοιώνει το φυσικό γραφείο."
         'title "Διαχειριστής παραθυρικού περιβάλλοντος "
         'license_text "Wikipedia")

   "windows-mobile"
   (hash 'image_url "/images/windows-mobile.png"
         'caption "Ένα από τα πρώτα λειτουργικά συστήματα με γραφικό περιβάλλον για κινητά τηλέφωνα, τα windows mobile, μεταφέρουν τις έννοιες από το λειτουργικό σύστημα του επιτραπέζιου υπολογιστή σε εκείνο του κινητού. Οι έννοιες αυτές, αν και επιτυχημένες, είναι ακατάλληλες για το πλαίσιο χρήσης του κινητού υπολογισμού."
         'title "Διάδραση με τα πρώτα Windows Mobile "
         'license_text "Microsoft")

   "windows-phone"
   (hash 'image_url "/images/windows-phone.png"
         'caption "Δέκα χρόνια μετά την πρώτη προσπάθεια στον κινητό υπολογισμό η Microsoft κάνει ένα συνολικό σχεδιασμό του λογισμικού της για όλες τις πλατφόρμες που βασίζεται περισσότερο στον κινητό υπολογισμό και στην διάδραση με αφή. "
         'title "Windows Phone "
         'license_text "")

   "windows1"
   (hash 'image_url "/images/windows1.jpg"
         'caption "Τα πρώτα Microsoft Windows ήταν στην πραγματικότητα μια διαφορετική οργάνωση του λειτουργικού συστήματος MS-DOS, με την προσθήκη παραθύρων τα οποία δεν μπορούν να επικαλύπτονται και είσοδο με το ποντίκι, αλλά χωρίς να υπάρχει ένα πλήρες παραθυρικό περιβάλλον."
         'title "Πρώτη έκδοση για τα Microsoft Windows "
         'license_text "")

   "windows10"
   (hash 'image_url "/images/windows10.jpg"
         'caption "Τα Windows 10 επανέφεραν το κουμπί της εκίνησης (Start menu), το οποίο αν και λειγουργικά δεν χρειάζεται και είχε αφαιρεθεί από την προηγούμενη έκδοση (Windows 8), αλλά η οικειότητα που είχε ήδη δημιουργηθεί στους χρήστες το έχει μετατρέψει σε μια χρήσιμη συνήθεια."
         'title "Microsoft Windows 10"
         'license_text "wikimedia")

   "windows8"
   (hash 'image_url "/images/windows8.png"
         'caption "Τα Windows8 προσφέρουν μια διεπαφή με τον χρήστη, η οποία, εμφανισιακά και λειτουργικά, είναι δανεισμένη από τις κινητές συσκευές, αφού έχουμε μεγάλα ζωντανά εικονίδια και χειρονομίες, δηλαδή έχουμε μοτίβα διάδρασης που συναντάμε περισσότερο στον κινητό παρά στον επιτραπέζιο υπολογισμό, καθώς ο στόχος είναι να δημιουργηθεί μια ενιαία εμπειρία χρήσης ανάμεσα σε πολλές συσκευές διάδρασης. Επιπλέον, για πρώτη φορά μετά τα Windows 95, δεν υπάρχει το κουμπί Start."
         'title "Microsoft Windows 8 χωρίς κουμπί εκκίνησης"
         'license_text "Microsoft")

   "windows95"
   (hash 'image_url "/images/windows95.jpg"
         'caption "Τα Windows95 ήταν μια πολύ επιτυχημένη προσπάθεια, η οποία βασίστηκε στην ευρύτατη προβολή, στην οικονομική τιμή, στην ευελιξία εγκατάστασης σε διαφορετικό υλικό αλλά και στην εύκολη ενσωμάτωση υλικού από άλλους κατασκευαστές. Ήταν η πρώτη έκδοση με το κουμπί εκκίνησης και ένα πλήρες παραθυρικό περιβάλλον, το οποίο περιλάμβανε και την μπάρα ανοικτών εφαρμογών."
         'title "Microsoft Windows 95 "
         'license_text "Microsoft")

   "wordstar-disk"
   (hash 'image_url "/images/wordstar-disk.jpg"
         'caption "Η διανομή λογισμικού σε οικονομικές μαγνητικές δισκέτες διευκόλυνε πολύ την διάδοση του την δεκαετία του 1980 και μέχρι πριν την εξάπλωση του δικτύου λίγο μετά το 2000. Αν και ήταν πιο εύκολο να γίνει παράνομη αντιγραφή, ταυτόχρονα ήταν πιο κοντά στις προσδοκίες και συνήθειες των ανθρώπων για την διανομή και αρχειοθέτηση έργων που βασίζονται στην πνευματική ιδιοκτησία, όπως είναι τα βιβλία και το λογισμικό. "
         'title "Διανομή λογισμικού σε μαγνητική δισκέτα "
         'license_text "Wikipedia")

   "wordstar-editor"
   (hash 'image_url "/images/wordstar-editor.png"
         'caption "Οι πρώτοι επεξεργαστές κειμένου για τους μικρο-υπολογιστές της δεκαετίας του 1980 εμπνέονται από τον Xerox Bravo και προσπαθούν να αποδώσουν, σε μια οθόνη απλού κειμένου χωρίς πολλαπλές γραμματοσειρές, την τελική εμφάνιση και ροή του κειμένου στην τυπωμένη σελίδα. Το αποτέλεσμα είναι ένας συνδυασμός από τα μειονεκτήματα των δύο κόσμων, χωρίς κανένα πλεονέκτημα, αλλά αυτό δεν θα εμποδίσει το WordStar και τους ανταγωνιστές του να κυριαρχίσουν στην αγορά."
         'title "Επεξεργαστής κειμένου WordStar "
         'license_text "Wikimedia ")

   "wristwatch-computer-mann"
   (hash 'image_url "/images/wristwatch-computer-mann.jpg"
         'caption ""
         'title "Φορετός υπολογιστής χεριού "
         'license_text "Steve Mann  ")

   "www"
   (hash 'image_url "/images/www.png"
         'caption "Οι πρώτες σελίδες του WWW είχαν στόχο να βελτιώσουν την ταχύτητα της δημοσίευσης επιστημονικών άρθρων μέσω του Internet, το οποίο είχε ήδη παρόμοιες υπηρεσίες όπως το FTP, ενώ η ανάπτυξη τόσο του εξυπηρετητή όσο και του φυλλομετρητή για το WWW αναπτύχθηκαν από έναν άνθρωπο τον Tim Berners Lee, ο οποίος εργαζόταν στην τεχνολογική υποστήριξη του ερευνητικού κέντρου CERN."
         'title "Παγκόσμιος ιστός "
         'license_text "Tim Berners Lee")

   "wysiwyg"
   (hash 'image_url "/images/wysiwyg.png"
         'caption "Η μετάβαση σε οθόνες απεικόνισης μεγάλου αριθμού εικονοστοιχείων επέτρεψε την δημιουργία μιας νέας κατηγορίας διαδραστικών εφαρμογών που υποσχόνται η εκτύπωση ενός εγγράφου να είναι ίδια με την προβολή του στην οθόνη. Αυτή η εξέλιξη βοήθησε πολύ στην φαινομενική ευχρηστία των εφαρμογών, αλλά ταυτόχρονα ενίσχυσε και την τάση δημιουργίας εφαρμογών που ήταν απλά προσομοίωση των εγγράφων που βασίζονται στην τεχνολογία του χαρτιού. "
         'title "What You See Is What You Get (WYSIWYG) "
         'license_text "wikimedia")

   "x-windows-system"
   (hash 'image_url "/images/x-windows-system.png"
         'caption "Το σύστημα X-Windows δημιουργήθηκε για να δώσει πρόσβαση σε απομακρυσμένους υπολογιστές εφαρμογών, μέσω τερματικών με γραφικά και ποντίκι, και μπορεί να λειτουργήσει σε μικρό εύρος ζώνης γιατί μετατίδει την περιγραφή του γραφικού περιβάλλοντος και όχι την εικόνα της εφαρμογής. Η τεχνολογία αυτή μοιάζει με τον εξομοιωτή τερματικού κειμένου, με την διαφορά ότι το τερματικό αφορά ένα γραφικό περιβάλλον με ποντίκι."
         'title "Σύστημα γραφικού περιβάλλοντος X Windows "
         'license_text "")

   "xanadu-mockup"
   (hash 'image_url "/images/xanadu-mockup.jpg"
         'caption "Η συμμετρικά διασυνδεμένη δομή του συστήματος Xanadu συμπληρώνεται με την αντίστοιχη οπτικοποίηση της πληροφορίας, η οποία εκτός από το βασικό έγγραφο δείχνει και τουλάχιστον ένα ακόμη έγγραφο που σχετίζεται. Η οπτικοποίηση αυτή έχει διαφορετική σύμανση για ένα σύνδεσμο παράθεσης από έναν σύνδεσμο αναφοράς, ενώ η συμμετρία της επιτρέπει να δούμε παράλληλα τα έγγραφα που αναφέρονται στο βασικό."
         'title "Πρωτότυπο για το Xanadu"
         'license_text "The Transcopyright License ")

   "xanadu-sketch"
   (hash 'image_url "/images/xanadu-sketch.jpg"
         'caption "Το όραμα για το σύστημα Xanadu του Ted Nelson σχεδιάστηκε αρχικά για να προσφέρει πολλές λειτουργίες που, ενώ πλέον θεωρούνται δεδομένες για τα αντίστοιχα σύγχρονα συστήματα, τότε δεν ήταν συμβατές στην πράξη με τις τρέχουσες ανάγκες των χρηστών, ούτε με το τεχνολογικό πλαίσιο της εποχής."
         'title "Σύστημα υπερκειμένου Xanadu"
         'license_text "The Transcopyright License ")

   "xanadu-viewer3d"
   (hash 'image_url "/images/xanadu-viewer3d.png"
         'caption "Σε μια από τις πολλές προσπάθειες υλοποίησης μιας διεπαφής για το Xanadu δοκιμάστηκαν τα γραφικά τριών διαστάσεων και η πλοήγηση με διεπαφή μεγέθυνσης. Για αυτήν την περίπτωση, το κείμενο ήταν η Παλαιά Διαθήκη, η οποία συνοδεύεται από πολλές εναλλακτικές σημειώσεις και ερμηνείες, έτσι ώστε ο αναγνώστης να μπορεί να τις μελετήσει συγκριτικά. "
         'title "Xanadu μεγέθυνσης σε τρεις διαστάσεις"
         'license_text "The Transcopyright License ")

   "xerox-alto"
   (hash 'image_url "/images/xerox-alto.jpg"
         'caption "Ο επιτραπέζιος υπολογιστής της Xerox Alto ήταν ένα λειτουργικό πρωτότυπο πάνω στην ιδέα του Dynabook, το οποίο βελτιωνόταν συνεχώς από τους ερευνητές του PARC και οδήγησε τελικά στην κατασκευή του πρώτου σύγχρονου υπολογιστή με γραφική επιφάνεια εργασίας, του Xerox Star."
         'title "Xerox Alto "
         'license_text "DigiBarn")

   "xerox-bravo"
   (hash 'image_url "/images/xerox-bravo.png"
         'caption ""
         'title "Επεξεργαστής κειμένου Bravo "
         'license_text "")

   "xerox-cedar"
   (hash 'image_url "/images/xerox-cedar.png"
         'caption "Το σύστημα Xerox Cedar αποτελεί τη συνέχεια του αποτυχημένου εμπορικά Star, δανειζόμενο στοιχεία από το πετυχημένο ερευνητικό πρωτότυπο Alto. Η διάδραση βασίζεται στα έγγραφα, τα οποία είναι το βασικό αντικείμενο της εταιρείας και το σύστημα παρέχει την ομώνυμη γλώσσα προγραμματισμού, με την οποία ο χρήστης μπορεί να προσαρμόσει τη διάδραση μέσα από ένα παραθυρικό περιβάλλον, που εμφανίζει παράλληλα τα έγγραφα και τον πηγαίο κώδικα των εντολών. "
         'title "Xerox Cedar "
         'license_text "toastytech.com ")

   "xerox-colab"
   (hash 'image_url "/images/xerox-colab.jpg"
         'caption "Δύο δεκαετίες μετά τη δημιουργία του επιτραπέζιου υπολογιστή γραφείου, οι ερευνητές του Xerox PARC δημιουργούν λογισμικό, το οποίο διευκολύνει τη σύγχρονη συνεργασία διά ζώσης, στο οποίο εκτός από τους προσωπικούς υπολογιστές, προσθέτουν και τον ηλεκτρονικό πίνακα τοίχου. "
         'title "Δωμάτιο ηλεκτρονικών συναντήσεων "
         'license_text "Mark Stefik ")

   "xerox-gypsy"
   (hash 'image_url "/images/xerox-gypsy.png"
         'caption "Η εφαρμογή Gypsy ήταν ο πρώτος επεξεργαστής κειμένου με μη-τροπικό χειρισμό και λειτουργούσε στον υπολογιστή Xerox Alto. Για τον σκοπό αυτο το πληκτρολόγιο ήταν μόνο για την είσοδο χαρακτήρων, ενώ το ποντίκι και τα πλήκτρα του έκαναν τις επιλογές των εντολών, όπως αντιγραφή και επικόλληση."
         'title "Επεξεργαστής κειμένου Gypsy "
         'license_text "Xerox PARC")

   "xerox-liveboard"
   (hash 'image_url "/images/xerox-liveboard.jpg"
         'caption "Το τρίτο και μεγαλύτερο σε μέγεθος μέλος της οικογένειας του διάχυτου υπολογισμού του Xerox PARC είναι το Liveboard. Βασίζεται στην είσοδο με πένα και προσομοιώνει τις λειτουργίες των σημειώσεων και της παρουσίασης σε μια μεγάλη οθόνη τοίχου, έτσι ώστε οι ομάδες συνεργασίας να μπορούν να μεταφέρουν χρήσιμη πληροφορία από τα προσωπικά τερματικά τους. "
         'title "Διαδραστικός πίνακας τοίχου "
         'license_text "Xerox PARC")

   "xerox-pad-board"
   (hash 'image_url "/images/xerox-pad-board.jpg"
         'caption "Η επικοινωνία ανάμεσα στη συσκευή Tab και στη συσκευή Board έχει πολλές συνεργατικές εφαρμογές, όπως, σε αίθουσες συναντήσεων, καθώς και σε αίθουσες διδασκαλίας."
         'title "Σύγχρονη συνεργασία στον ίδιο χώρο "
         'license_text "Xerox PARC")

   "xerox-parc-tab"
   (hash 'image_url "/images/xerox-parc-tab.png"
         'caption "Η συσκευή τύπου Tab ήταν η μικρότερη στην οικογένεια συσκευών διάχυτου υπολογισμού Tab-Pad-Board και ήταν σχεδιασμένη έτσι ώστε να χωράει στην παλάμη και να μπορεί να λειτουργήσει τα κουμπιά μόνο με το ένα χέρι, ενώ επέτρεπε και την αφή με το δεύτερο χέρι, με τη χρήση μιας πένας."
         'title "Xerox Tab "
         'license_text "Bill Buxton collection")

   "xerox-portholes"
   (hash 'image_url "/images/xerox-portholes.png"
         'caption "Σε έναν οργανισμό που λειτουργεί κατανεμημένα σε διαφορετικές γεωγραφικές περιοχές υπάρχει η ανάγκη για μια ήπια επαφή μεταξύ των συνεργατών, αντίστοιχη με αυτή που υπάρχει σε έναν μεγάλο ενιαίο χώρο εργασίας. Η ανάγκη αυτή μελετήθηκε με το σύστημα επίγνωσης πλαισίου απομακρυσμένου συνεργάτη Portholes του Xerox PARC, το οποίο μοιράζει ασύγχρονα στιγμιότυπα από κάμερες που βρίσκονται στα γραφεία, έτσι ώστε να υπάρχει κατανόηση της δραστηριότητας σε διαφορετικές τοποθεσίες. "
         'title "Επίγνωση κοινωνικού πλαισίου με το Portholes"
         'license_text "Xerox PARC")

   "xerox-star-desktop"
   (hash 'image_url "/images/xerox-star-desktop.png"
         'caption "Η επιφάνεια εργασίας ως μεταφορά για τη χρήση του υπολογιστή σε γραφικό περιβάλλον ανταποκρίνεται κυρίως στις ανάγκες που είχαν οι πελάτες και χρήστες των πρώτων επιτραπέζιων υπολογιστών, οι οποίοι ήθελαν ένα εργαλείο που να διευκολύνει τις εργασίες σε εκδοτικούς οργανισμούς."
         'title "Η επιφάνεια εργασίας του Xerox Star"
         'license_text "Xerox PARC")

   "xerox-star-genealogy"
   (hash 'image_url "/images/xerox-star-genealogy.png"
         'caption "Το γενεαλογικό δέντρο του Xerox Star περιέχει σημαντικούς προγόνους (π.χ. Memex, NLS, Sketchpad κ.ά.), καθώς και εξίσου σημαντικούς απογόνους (π.χ. Macintosh), με τα περισσότερα στοιχεία της διάδρασης (π.χ. γραφική επιφάνεια εργασίας, απευθείας χειρισμός κτλ.) να παραμένουν τα ίδια για δεκαετίες."
         'title "Το γενεαλογικό δένδρο του Xerox Star "
         'license_text "Digibarn")

   "xerox-star-pc"
   (hash 'image_url "/images/xerox-star-pc.jpg"
         'caption "Ο επιτραπέζιος υπολογιστής με πληκτρολόγιο, ποντίκι και γραφική επιφάνεια εργασίας (παράθυρα, εικονίδια, φάκελοι), ο οποίος δημιουργήθηκε από τη Xerox στα τέλη της δεκαετίας του 1970 λίγο διαφέρει από τον μοντέρνο επιτραπέζιο υπολογιστή."
         'title "Ο επιτραπέζιος υπολογιστής Xerox Star"
         'license_text "Xerox PARC")

   "zoomable"
   (hash 'image_url "/images/zoomable.png"
         'caption "Οι διεπαφές μεγέθυνσης εμφανίζονται από πολύ νωρίς με το Sketchpad και συνεχίζονται με την Smalltalk και το Spatial Dataland, τα οποία χρησιμοποιούν αυτήν την τεχνική για μια πτυχή του αντίστοιχου συστήματος. Η τεχνική της μεγέθυνσης ωριμάζει με το Pad++ για τις εφαρμογές των επιτραπέζιων συστημάτων."
         'title "Διεπαφές μεγέθυνσης "
         'license_text "Wikipedia ")
   ))
